[{"Company Name":"DocuSign, Inc.","Symbol":"DOCU","Current Price":"98.00","Latest MA":"63.88","Price Target":"97.60","Difference from MA":"53.40%","Difference from Open":"0.28%","Change from Yesterday":"-0.17%","Change from Last Report":"-0.05","Latest Volume":"612,763","Market Cap":"19,798,255,616","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":26.279236,"ROE":0.70342004,"DTE":6.913,"Industry":"Software - Application","Sector":"Technology","Beta":0.898,"Trailing PEG":0.5976,"Trailing PE":20.33195,"Trailing PS":6.9261627,"Quick Ratio":0.785,"Day High":98.205,"Day Low":97.43,"VS Average Volume":0.157562357,"Company Summary":"DocuSign, Inc. provides electronic signature solution in the United States and internationally. The company provides e-signature solution that enables sending and signing of agreements on various devices; Contract Lifecycle Management (CLM), which automates workflows across the entire agreement process; Document Generation streamlines the process of generating new, custom agreements; and Gen for Salesforce, which allows sales representatives to automatically generate agreements with a few clicks from within Salesforce. It also provides Identify, a signer-identification option for checking government-issued IDs; Standards-Based Signatures, which support signatures that involve digital certificates; Monitor that uses advanced analytics to track DocuSign eSignature web, mobile, and API account; Notary which enables notaries public to conduct remote online notarization transactions; and Web Forms, a web forms that quickly draft agreements using pre-populated data from completed forms or external systems via APIs. In addition, the company offers Rooms for Real Estate that provides a way for brokers and agents to manage the entire real estate transaction digitally. Signature and CLM are FedRAMP, an authorized version of DocuSign eSignature for U.S. federal government agencies; and life sciences modules that support compliance with the electronic signature practices. The company sells its products through direct and partner-assisted sales, and digital self-service purchasing. DocuSign, Inc. was incorporated in 2003 and is headquartered in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Adobe Inc.","Symbol":"ADBE","Current Price":"453.15","Latest MA":"519.13","Price Target":"588.34","Difference from MA":"-12.71%","Difference from Open":"0.14%","Change from Yesterday":"-0.58%","Change from Last Report":"0.15","Latest Volume":"727,690","Market Cap":"199,234,519,040","Earning Date":"2024-12-11","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":19.627647,"ROE":0.35355,"DTE":41.788,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.299,"Trailing PEG":1.4889,"Trailing PE":36.558968,"Trailing PS":9.511363,"Quick Ratio":0.966,"Day High":453.82,"Day Low":447.4307,"VS Average Volume":0.2191729743,"Company Summary":"Adobe Inc., together with its subsidiaries, operates as a diversified software company worldwide. It operates through three segments: Digital Media, Digital Experience, and Publishing and Advertising. The Digital Media segment offers products, services, and solutions that enable individuals, teams, and enterprises to create, publish, and promote content; and Document Cloud, a unified cloud-based document services platform. Its flagship product is Creative Cloud, a subscription service that allows members to access its creative products. This segment serves content creators, students, workers, marketers, educators, enthusiasts, and communicators. The Digital Experience segment provides an integrated platform and set of applications and services that enable brands and businesses to create, manage, execute, measure, monetize, and optimize customer experiences from analytics to commerce. This segment serves marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers, and executives across the C-suite. The Publishing and Advertising segment offers products and services, such as e-learning solutions, technical document publishing, web conferencing, document and forms platform, web application development, and high-end printing, as well as Advertising Cloud offerings. It also provides consulting, technical support, and learning services. The company offers its products and services directly to enterprise customers through its sales force and local field offices, as well as to end users through app stores and through its website at adobe.com. It also distributes products and services through distributors, value-added resellers, systems integrators, software vendors and developers, retailers, and original equipment manufacturers. The company was formerly known as Adobe Systems Incorporated and changed its name to Adobe Inc. in October 2018. Adobe Inc. was founded in 1982 and is headquartered in San Jose, California.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Micron Technology, Inc.","Symbol":"MU","Current Price":"110.48","Latest MA":"110.08","Price Target":"146.68","Difference from MA":"0.36%","Difference from Open":"0.31%","Change from Yesterday":"1.80%","Change from Last Report":"0.05","Latest Volume":"8,124,371","Market Cap":"123,340,939,264","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.564917,"ROE":0.01743,"DTE":31.194,"Industry":"Semiconductors","Sector":"Technology","Beta":1.179,"Trailing PEG":0.1735,"Trailing PE":158.16428,"Trailing PS":4.9118295,"Quick Ratio":1.592,"Day High":112.03,"Day Low":109.35,"VS Average Volume":0.373903991,"Company Summary":"Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Mainland China, rest of the Asia Pacific, Hong Kong, Japan, Europe, and internationally. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Embedded Business Unit, and Storage Business Unit. It provides memory and storage technologies comprising dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; non-volatile and re-writeable semiconductor storage devices; and non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers serves the data center, PC, graphics, networking, automotive, industrial, and consumer embedded markets, as well as for smartphone and other mobile-device markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Birkenstock Holding plc","Symbol":"BIRK","Current Price":"59.37","Latest MA":"52.76","Price Target":"66.04","Difference from MA":"12.54%","Difference from Open":"-2.58%","Change from Yesterday":"6.31%","Change from Last Report":"-0.29","Latest Volume":"1,693,992","Market Cap":"11,193,612,288","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":27.002705,"ROE":0.04422,"DTE":57.584,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":null,"Trailing PE":96.12048,"Trailing PS":6.494815,"Quick Ratio":1.413,"Day High":62.4,"Day Low":59.19,"VS Average Volume":1.4674144105,"Company Summary":"Birkenstock Holding plc manufactures and sells footwear products. It also offers sandals, shoes, closed-toe silhouettes, skincare products, and accessories. The company sells its products through e-commerce sites and a network of owned retail stores, as well as business-to-business channels. It operates in the United States, Brazil, Canada, Mexico, Europe, APMA, and internationally. Birkenstock Holding plc was founded in 1774 and is based in London, the United Kingdom. Birkenstock Holding plc operates as a subsidiary of BK LC Lux MidCo S.à r.l.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Hewlett Packard Enterprise Comp","Symbol":"HPE","Current Price":"21.61","Latest MA":"19.85","Price Target":"23.93","Difference from MA":"8.83%","Difference from Open":"-0.30%","Change from Yesterday":"0.30%","Change from Last Report":"0.05","Latest Volume":"818,208","Market Cap":"28,021,682,176","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.458412,"ROE":0.086660005,"DTE":53.696,"Industry":"Communication Equipment","Sector":"Technology","Beta":1.206,"Trailing PEG":3.7346,"Trailing PE":11.194301,"Trailing PS":0.96559894,"Quick Ratio":0.469,"Day High":21.8,"Day Low":21.53,"VS Average Volume":0.0609866276,"Company Summary":"Hewlett Packard Enterprise Company provides solutions that allow customers to capture, analyze, and act upon data seamlessly in the Americas, Europe, the Middle East, Africa, the Asia Pacific, and Japan. It operates in six segments: Compute, HPC & AI, Storage, Intelligent Edge, Financial Services, and Corporate Investments and Other. The company offers general purpose servers for multi-workload computing and workload-optimized servers; HPE ProLiant rack and tower servers; HPE Synergy; HPE Alletra, HPE GreenLake, Zerto, HPE InfoSight, and HPE CloudPhysics storage products; HPE Cray EX, HPE Cray XD, and converged edge systems; and HPE Superdome Flex, HPE Nonstop, and HPE Integrity products. It also provides HPE Aruba products that includes hardware products, such as Wi-Fi access points, switches, and gateways; HPE Aruba Networking software and services comprising cloud-based management, network management and access control, analytics and assurance, software-defined wide-area networking, network security, analytics and assurance, and location services software; and professional and support services, as well as as-a-service and consumption models. In addition, the company offers leasing, financing, IT consumption, and utility programs and asset management services for customers to facilitate technology deployment models and the acquisition of various IT solutions, including hardware, software, and services from Hewlett Packard Enterprise and others; consultative-led services; HPE Ezmeral Container Platform; HPE Ezmeral Software Container Platform and HPE Ezmeral Software Data Fabric; OpsRamp; and Hewlett Packard Labs. It serves commercial and large enterprise groups, such as business and public sector enterprises; and through various partners comprising resellers, distribution partners, original equipment manufacturers, independent software vendors, systems integrators, and advisory firms. The company was founded in 1939 and is headquartered in Spring, Texas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Oracle Corporation","Symbol":"ORCL","Current Price":"169.50","Latest MA":"154.27","Price Target":"199.38","Difference from MA":"9.87%","Difference from Open":"0.05%","Change from Yesterday":"-0.21%","Change from Last Report":"0.06","Latest Volume":"822,078","Market Cap":"473,606,422,528","Earning Date":"2024-12-09","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":24.01363,"ROE":1.55578,"DTE":749.978,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.013,"Trailing PEG":1.8245,"Trailing PE":41.40073,"Trailing PS":8.800639,"Quick Ratio":0.591,"Day High":169.8,"Day Low":168.39,"VS Average Volume":0.1050337974,"Company Summary":"Oracle Corporation offers products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning (ERP), Oracle Fusion cloud enterprise performance management, Oracle Fusion cloud supply chain and manufacturing management, Oracle Fusion cloud human capital management, Oracle Cerner healthcare, and NetSuite applications suite, as well as Oracle Fusion Sales, Service, and Marketing. The company also offers cloud-based industry solutions for various industries; Oracle application licenses; and Oracle license support services. In addition, it provides cloud and license business' infrastructure technologies, such as the Oracle Database and MySQL Database; Java, a software development language; and middleware, including development tools and others. The company's cloud and license business' infrastructure technologies also comprise cloud-based compute, storage, and networking capabilities; and Oracle autonomous database and MySQL HeatWave, as well as Internet-of-Things, digital assistant, and blockchain. Further, it provides hardware products and other hardware-related software offerings, including Oracle engineered systems, enterprise servers, storage solutions, industry-specific hardware, virtualization software, operating systems, management software, and related hardware services, as well as hardware support products; and consulting and customer services. The company markets and sells its cloud, license, hardware, support, and services offerings directly to businesses in various industries, government agencies, and educational institutions, as well as through indirect channels. Oracle Corporation was founded in 1977 and is headquartered in Austin, Texas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"General Mills, Inc.","Symbol":"GIS","Current Price":"63.79","Latest MA":"67.73","Price Target":"73.78","Difference from MA":"-5.82%","Difference from Open":"1.09%","Change from Yesterday":"-3.13%","Change from Last Report":"-0.10","Latest Volume":"3,347,044","Market Cap":"35,455,229,952","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.605262,"ROE":0.24168,"DTE":139.823,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.107,"Trailing PEG":3.3603,"Trailing PE":15.205954,"Trailing PS":1.7906139,"Quick Ratio":0.317,"Day High":64.5113,"Day Low":62.81,"VS Average Volume":0.8919742032,"Company Summary":"General Mills, Inc. manufactures and markets branded consumer foods worldwide. The company operates through four segments: North America Retail; International; Pet; and North America Foodservice. It offers grain, ready-to-eat cereals, refrigerated yogurt, soup, meal kits, refrigerated and frozen dough products, dessert and baking mixes, bakery flour, frozen pizza and pizza snacks, snack bars, fruit and savory snacks, ice cream and frozen desserts, unbaked and fully baked frozen dough products, frozen hot snacks, ethnic meals, side dish mixes, frozen breakfast and entrees, nutrition bars, and frozen and shelf-stable vegetables. The company also manufactures and markets pet food products, including dog and cat food; and operates ice cream parlors. It markets its products under the Annie's, Betty Crocker, Bisquick, Blue Buffalo, Bugles, Cascadian Farm, Cheerios, Chex, Cinnamon Toast Crunch, Cocoa Puffs, Cookie Crisp, Dunkaroos, Edgard & Cooper, Fiber One, Fruit by the Foot, Fruit Gushers, Fruit Roll-Ups, Gardetto's, Gold Medal, Golden Grahams, Häagen-Dazs, Kitano, Kix, Lärabar, Latina, Lucky Charms, Muir Glen, Nature Valley, Nudges, Oatmeal Crisp, Old El Paso, Pillsbury, Progresso, Tastefuls, Total, Totino's , Trix, True Chews, True Solutions, Wanchai Ferry, Wheaties, Wilderness, and Yoki brands. The company sells its products to grocery stores, mass merchandisers, membership stores, natural food chains, drug, dollar and discount chains, e-commerce retailers, commercial and noncommercial foodservice distributors and operators, restaurants, convenience stores, and pet specialty stores. General Mills, Inc. was founded in 1866 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Broadcom Inc.","Symbol":"AVGO","Current Price":"237.33","Latest MA":"164.58","Price Target":"234.66","Difference from MA":"44.20%","Difference from Open":"-0.93%","Change from Yesterday":"-1.45%","Change from Last Report":"-0.21","Latest Volume":"6,072,231","Market Cap":"1,105,853,284,352","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":31.189693,"ROE":0.12509,"DTE":166.032,"Industry":"Semiconductors","Sector":"Technology","Beta":1.187,"Trailing PEG":0.6897,"Trailing PE":182.13078,"Trailing PS":23.621773,"Quick Ratio":0.841,"Day High":239.65,"Day Low":233.101,"VS Average Volume":0.2351425714,"Company Summary":"Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides set-top box system-on-chips (SoCs); cable, digital subscriber line, and passive optical networking central office\/consumer premise equipment SoCs; wireless local area network access point SoCs; Ethernet switching and routing custom silicon solutions; serializer\/deserializer application specific integrated circuits; optical and copper, and physical layer devices; and fiber optic components and RF semiconductor devices. The company also offers RF front end modules and filter; Wi-Fi, Bluetooth, and global positioning system\/global navigation satellite system SoCs; custom touch controllers; inductive charging; attached small computer system interface, and redundant array of independent disks controllers and adapters; peripheral component interconnect express; fiber channel host bus adapters; read channel based SoCs; custom flash controllers; preamplifiers; optocouplers, industrial fiber optics, and motion control encoders and subsystems; light emitting diode, ethernet PHYs, switch ICs, and camera microcontrollers. Its products are used in various applications, including enterprise and data center networking, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was founded in 1961 and is headquartered in Palo Alto, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Jabil Inc.","Symbol":"JBL","Current Price":"145.51","Latest MA":"117.91","Price Target":"149.25","Difference from MA":"23.41%","Difference from Open":"-1.79%","Change from Yesterday":"8.48%","Change from Last Report":"-0.38","Latest Volume":"1,016,752","Market Cap":"16,222,291,968","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":14.442832,"ROE":0.60295,"DTE":207.887,"Industry":"Electronic Components","Sector":"Technology","Beta":1.245,"Trailing PEG":null,"Trailing PE":13.0026865,"Trailing PS":0.5616554,"Quick Ratio":0.58,"Day High":150.0,"Day Low":144.39,"VS Average Volume":0.7723848737,"Company Summary":"Jabil Inc. provides manufacturing services and solutions worldwide. It operates in two segments, Electronics Manufacturing Services and Diversified Manufacturing Services. The company offers electronics design, production, and product management services; electronic circuit design services, such as application-specific integrated circuit design, firmware development, and rapid prototyping services; and designs plastic and metal enclosures that include the electro-mechanics, such as the printed circuit board assemblies (PCBA). It also provides three-dimensional mechanical design comprising the analysis of electronic, electro-mechanical, and optical assemblies, as well as various industrial design, mechanism development, and tooling management services. In addition, the company provides computer-assisted design services consisting of PCBA design, as well as PCBA design validation and verification services; and other consulting services, such as the generation of a bill of materials, approved vendor list, and assembly equipment configuration for various PCBA designs. Further, it offers product and process validation services, such as product system, product safety, regulatory compliance, and reliability tests, as well as manufacturing test solution development services. Additionally, the company provides systems assembly, test, direct-order fulfillment, and configure-to-order services. It serves 5G, wireless and cloud, digital print and retail, industrial and semi-cap, networking and storage, automotive and transportation, connected devices, healthcare and packaging, and mobility industries. The company was formerly known as Jabil Circuit, Inc. and changed its name to Jabil Inc. in June 2017. Jabil Inc. was founded in 1966 and is headquartered in Saint Petersburg, Florida.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Lennar Corporation","Symbol":"LEN","Current Price":"151.38","Latest MA":"168.83","Price Target":"192.40","Difference from MA":"-10.34%","Difference from Open":"-0.06%","Change from Yesterday":"0.10%","Change from Last Report":"-0.06","Latest Volume":"529,564","Market Cap":"40,931,774,464","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.550664,"ROE":0.15878001,"DTE":14.665,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.619,"Trailing PEG":1.1055,"Trailing PE":10.068061,"Trailing PS":1.1225642,"Quick Ratio":3.257,"Day High":152.99,"Day Low":150.87,"VS Average Volume":0.2626692201,"Company Summary":"Lennar Corporation, together with its subsidiaries, operates as a homebuilder primarily under the Lennar brand in the United States. It operates through Homebuilding East, Homebuilding Central, Homebuilding Texas, Homebuilding West, Financial Services, Multifamily, and Lennar Other segments. The company's homebuilding operations include the construction and sale of single-family attached and detached homes, as well as the purchase, development, and sale of residential land; and development, construction, and management of multifamily rental properties. It also offers residential mortgage financing, title, insurance, and closing services for home buyers and others, as well as originates and sells securitization commercial mortgage loans. In addition, the company is involved in the fund investment activity. It primarily serves first-time, move-up, active adult, and luxury homebuyers. Lennar Corporation was founded in 1954 and is based in Miami, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"The Campbell's Company","Symbol":"CPB","Current Price":"42.13","Latest MA":"46.43","Price Target":"47.94","Difference from MA":"-9.27%","Difference from Open":"-0.43%","Change from Yesterday":"-2.11%","Change from Last Report":"0.10","Latest Volume":"540,183","Market Cap":"12,562,313,216","Earning Date":"2024-12-04","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.628222,"ROE":0.15203,"DTE":198.683,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.181,"Trailing PEG":0.6896,"Trailing PE":23.02732,"Trailing PS":1.3036855,"Quick Ratio":0.206,"Day High":42.5,"Day Low":41.55,"VS Average Volume":0.2288700573,"Company Summary":"The Campbell's Company, together with its subsidiaries, manufactures and markets food and beverage products in the United States and internationally. The company operates through Meals & Beverages and Snacks segments. The Meals & Beverages segment engages in the retail and foodservice businesses in the United States and Canada. This segment provides Campbell's condensed and ready-to-serve soups; Swanson broth and stocks; Pacific Foods broth, soups, and non-dairy beverages; Prego pasta sauces; Pace Mexican sauces; Campbell's gravies, pasta, beans, and dinner sauces; Swanson canned poultry; V8 juices and beverages; Campbell's tomato juice; Rao's pasta sauces, dry pasta, frozen entrées, frozen pizza and soups; Michael Angelo's frozen entrées and pasta sauces; and noosa yogurts, as well as snacking products in foodservice in Canada. The Snacks segment retails Pepperidge Farm cookies, crackers, fresh bakery, and frozen products, that includes Goldfish crackers, Snyder's of Hanover pretzels, Lance sandwich crackers, Cape Cod and Kettle Brand potato chips, Late July snacks, Snack Factory pretzel crisps, and other snacking products. This segment is also involved in the retail business in Latin America. It sells its products through retail food chains, mass discounters and merchandisers, club stores, convenience stores, drug stores, and dollar stores, as well as e-commerce and other retail, commercial, and non-commercial establishments, and independent contractor distributors. The company was formerly known as Campbell Soup Company and changed its name to The Campbell's Company in November 2024. The company was founded in 1869 and is headquartered in Camden, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"UiPath, Inc.","Symbol":"PATH","Current Price":"13.84","Latest MA":"13.02","Price Target":"15.81","Difference from MA":"6.32%","Difference from Open":"-1.14%","Change from Yesterday":"-0.54%","Change from Last Report":"0.07","Latest Volume":"598,458","Market Cap":"7,603,701,760","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":27.285814,"ROE":-0.058920003,"DTE":4.505,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.87,"Trailing PEG":0.8832,"Trailing PE":"N\/A","Trailing PS":5.4998097,"Quick Ratio":3.339,"Day High":14.005,"Day Low":13.8,"VS Average Volume":0.0701257348,"Company Summary":"UiPath Inc. provides an end-to-end automation platform that offers a range of robotic process automation (RPA) solutions primarily in the United States, Romania, the United Kingdom, the Netherlands, and internationally. The company offers a suite of interrelated software to build, manage, run, engage, measure, and govern automation within the organization. Its platform's embedded AI, ML, and NLP capabilities improve decisioning and information processing; emulate human behavior allows organizations to address a myriad of use cases; emulate human behavior allows organizations to address a myriad of use cases; multi-tenant platform enterprise deployment with security and governance and Automation Cloud, which enables customers to begin automating without the need to provision infrastructure, install applications, or perform additional configurations; intuitive interface and low-code, drag-and-drop functionality; signed to enable people and automations to work together; and tracks, measures, and forecasts the performance of automations, enables customers to gain powerful insights and generate key performance indicators with actionable metric. It serves banking and financial services, healthcare, insurance, public sectors, manufacturing, retail, and telecom industries. The company was founded in 2005 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"16.82","Latest MA":"14.75","Price Target":"18.88","Difference from MA":"14.08%","Difference from Open":"-0.38%","Change from Yesterday":"-0.50%","Change from Last Report":"-0.09","Latest Volume":"1,106,736","Market Cap":"24,487,110,656","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":12.547084,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.8967,"Trailing PE":16.364079,"Trailing PS":3.6602557,"Quick Ratio":"N\/A","Day High":16.91,"Day Low":16.77,"VS Average Volume":0.081233887,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"38.80","Latest MA":"43.62","Price Target":"56.70","Difference from MA":"-11.07%","Difference from Open":"-0.45%","Change from Yesterday":"-0.30%","Change from Last Report":"0.04","Latest Volume":"2,353,046","Market Cap":"54,812,602,368","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":10.75604,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.751,"Trailing PE":12.480707,"Trailing PS":1.5227838,"Quick Ratio":1.003,"Day High":39.05,"Day Low":38.44,"VS Average Volume":0.192465086,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"GameStop Corporation","Symbol":"GME","Current Price":"30.75","Latest MA":"24.16","Price Target":"10.00","Difference from MA":"27.29%","Difference from Open":"-1.13%","Change from Yesterday":"-1.70%","Change from Last Report":"0.13","Latest Volume":"2,220,042","Market Cap":"13,730,163,712","Earning Date":"2024-12-04","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":"Infinity","ROE":0.015039999,"DTE":12.171,"Industry":"Specialty Retail","Sector":"Consumer Cyclical","Beta":-0.098,"Trailing PEG":null,"Trailing PE":153.65,"Trailing PS":3.0162926,"Quick Ratio":5.442,"Day High":31.122,"Day Low":30.282,"VS Average Volume":0.2021805028,"Company Summary":"GameStop Corp., a specialty retailer, provides games and entertainment products through its stores and ecommerce platforms in the United States, Canada, Australia, and Europe. The company sells new and pre-owned gaming platforms; accessories, such as controllers, gaming headsets, and virtual reality products; new and pre-owned gaming software; and in-game digital currency, digital downloadable content, and full-game downloads. It sells collectibles comprising apparel, toys, trading cards, gadgets, and other retail products for pop culture and technology enthusiasts, as well as engages in the digital asset wallet and NFT marketplace activities. The company operates stores and ecommerce sites under the GameStop, EB Games, and Micromania brands; and pop culture themed stores that sell collectibles, apparel, gadgets, electronics, toys, and other retail products under the Zing Pop Culture brand, as well as offers Game Informer magazine, a print and digital gaming publication. The company was formerly known as GSC Holdings Corp. GameStop Corp. was founded in 1996 and is headquartered in Grapevine, Texas.","Stock Sentiment":"Sell","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"45.31","Latest MA":"41.67","Price Target":"50.24","Difference from MA":"8.74%","Difference from Open":"0.15%","Change from Yesterday":"0.40%","Change from Last Report":"-0.02","Latest Volume":"738,037","Market Cap":"60,149,932,032","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":11.501256,"ROE":-0.09505,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.035,"Trailing PEG":1.9441,"Trailing PE":"N\/A","Trailing PS":4.1491294,"Quick Ratio":"N\/A","Day High":45.44,"Day Low":45.0,"VS Average Volume":0.0905731903,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"State Street Corporation","Symbol":"STT","Current Price":"98.70","Latest MA":"84.62","Price Target":"105.07","Difference from MA":"16.64%","Difference from Open":"0.05%","Change from Yesterday":"0.07%","Change from Last Report":"0.02","Latest Volume":"1,071,473","Market Cap":"28,953,059,328","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":10.444028,"ROE":0.0855,"DTE":"N\/A","Industry":"Asset Management","Sector":"Financial Services","Beta":1.48,"Trailing PEG":0.655,"Trailing PE":15.480407,"Trailing PS":2.3073845,"Quick Ratio":"N\/A","Day High":98.97,"Day Low":98.495,"VS Average Volume":0.4906901618,"Company Summary":"State Street Corporation, through its subsidiaries, provides a range of financial products and services to institutional investors worldwide. The company offers investment servicing products and services, including custody, accounting, regulatory reporting, investor, and performance and analytics; middle office products, such as IBOR, transaction management, loans, cash, derivatives and collateral, record keeping, and client reporting and investment analytics; finance leasing; foreign exchange, and brokerage and other trading services; securities finance and enhanced custody products; deposit and short-term investment facilities; investment manager and alternative investment manager operations outsourcing; performance, risk, and compliance analytics; and financial data management to support institutional investors. It also engages in the provision of portfolio management and risk analytics, as well as trading and post-trade settlement services with integrated compliance and managed data. In addition, the company offers investment management strategies and products, such as core and enhanced indexing, multi-asset strategies, active quantitative and fundamental active capabilities, and alternative investment strategies. Further, it provides services and solutions, including environmental, social, and governance investing; defined benefit and defined contribution; and global fiduciary solutions, as well as exchange-traded funds under the SPDR ETF brand. The company provides its products and services to mutual funds, collective investment funds, UCITS, hedge funds and other investment pools, corporate and public retirement plans, insurance companies, foundations, endowments, and investment managers. State Street Corporation was founded in 1792 and is headquartered in Boston, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"71.29","Latest MA":"63.14","Price Target":"82.14","Difference from MA":"12.91%","Difference from Open":"0.15%","Change from Yesterday":"0.30%","Change from Last Report":"-0.08","Latest Volume":"936,560","Market Cap":"134,903,578,624","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.80077,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.7845,"Trailing PE":20.321938,"Trailing PS":1.9464359,"Quick Ratio":"N\/A","Day High":71.47,"Day Low":71.045,"VS Average Volume":0.0687918472,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"45.31","Latest MA":"41.06","Price Target":"50.10","Difference from MA":"10.37%","Difference from Open":"0.39%","Change from Yesterday":"0.64%","Change from Last Report":"-0.02","Latest Volume":"3,058,193","Market Cap":"347,887,632,384","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.311325,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":1.996,"Trailing PE":16.4275,"Trailing PS":3.6764488,"Quick Ratio":"N\/A","Day High":45.3963,"Day Low":44.99,"VS Average Volume":0.0872831011,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"71.36","Latest MA":"60.85","Price Target":"76.14","Difference from MA":"17.28%","Difference from Open":"1.06%","Change from Yesterday":"0.79%","Change from Last Report":"-0.01","Latest Volume":"1,798,462","Market Cap":"237,625,704,448","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.025649,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.3012,"Trailing PE":14.837838,"Trailing PS":3.0513732,"Quick Ratio":"N\/A","Day High":71.49,"Day Low":70.72,"VS Average Volume":0.1000844211,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Devon Energy Corporation","Symbol":"DVN","Current Price":"32.05","Latest MA":"42.08","Price Target":"50.04","Difference from MA":"-23.83%","Difference from Open":"-0.14%","Change from Yesterday":"-0.42%","Change from Last Report":"-0.02","Latest Volume":"1,181,010","Market Cap":"21,043,789,824","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.8222713,"ROE":0.26279,"DTE":64.021,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":2.071,"Trailing PEG":14.898,"Trailing PE":5.9324074,"Trailing PS":1.448399,"Quick Ratio":0.834,"Day High":32.3,"Day Low":31.97,"VS Average Volume":0.1300077321,"Company Summary":"Devon Energy Corporation, an independent energy company, engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. It operates in Delaware, Eagle Ford, Anadarko, Williston, and Powder River Basins. The company was founded in 1971 and is headquartered in Oklahoma City, Oklahoma.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"238.50","Latest MA":"215.14","Price Target":"250.33","Difference from MA":"10.86%","Difference from Open":"-0.21%","Change from Yesterday":"0.09%","Change from Last Report":"-0.06","Latest Volume":"911,174","Market Cap":"671,655,723,008","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.0499525,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":4.7153,"Trailing PE":13.253889,"Trailing PS":4.1422386,"Quick Ratio":"N\/A","Day High":239.07,"Day Low":237.74,"VS Average Volume":0.1064174273,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"76.96","Latest MA":"70.48","Price Target":"82.63","Difference from MA":"9.19%","Difference from Open":"0.26%","Change from Yesterday":"0.25%","Change from Last Report":"0.10","Latest Volume":"714,847","Market Cap":"140,874,039,296","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.934517,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":1.2354,"Trailing PE":30.06125,"Trailing PS":7.5188956,"Quick Ratio":0.481,"Day High":77.165,"Day Low":76.43,"VS Average Volume":0.0902065794,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"26.53","Latest MA":"22.32","Price Target":"26.67","Difference from MA":"18.89%","Difference from Open":"-0.23%","Change from Yesterday":"-0.26%","Change from Last Report":"-0.02","Latest Volume":"707,531","Market Cap":"58,962,100,224","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":21.069767,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":1.9484,"Trailing PE":23.486637,"Trailing PS":3.8916311,"Quick Ratio":0.291,"Day High":26.723,"Day Low":26.46,"VS Average Volume":0.0511542681,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"61.76","Latest MA":"50.45","Price Target":"78.22","Difference from MA":"22.43%","Difference from Open":"1.28%","Change from Yesterday":"1.66%","Change from Last Report":"0.00","Latest Volume":"597,552","Market Cap":"39,891,271,680","Earning Date":"2025-01-10","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":8.343725,"ROE":0.4067,"DTE":186.78,"Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PE":8.574203,"Trailing PS":0.66147,"Quick Ratio":0.268,"Day High":61.98,"Day Low":60.74,"VS Average Volume":0.0717522217,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Carnival Corporation","Symbol":"CCL","Current Price":"25.91","Latest MA":"19.10","Price Target":"27.52","Difference from MA":"35.60%","Difference from Open":"-0.79%","Change from Yesterday":"0.82%","Change from Last Report":"0.00","Latest Volume":"2,415,831","Market Cap":"34,780,749,824","Earning Date":"2024-12-20","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":15.017555,"ROE":0.20120001,"DTE":352.355,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.668,"Trailing PEG":null,"Trailing PE":22.153847,"Trailing PS":1.4208403,"Quick Ratio":0.202,"Day High":26.188,"Day Low":25.78,"VS Average Volume":0.09443743,"Company Summary":"Carnival Corporation & plc engages in the provision of leisure travel services in North America, Australia, Europe, Asia, and internationally. The company operates through four segments: NAA Cruise Operations, Europe Cruise Operations, Cruise Support, and Tour and Other. It operates port destinations, private islands, and a solar park, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. The company offers its services under the Carnival Cruise Line, Princess Cruises, Holland America Line, Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises, and Cunard brand. Additionally, it sells its cruises primarily through travel agents, tour operators, vacation planners, and websites. Carnival Corporation & plc was founded in 1972 and is headquartered in Miami, Florida.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"9.87","Latest MA":"10.59","Price Target":"9.94","Difference from MA":"-6.85%","Difference from Open":"-0.35%","Change from Yesterday":"-1.00%","Change from Last Report":"-0.10","Latest Volume":"2,825,843","Market Cap":"8,522,626,560","Earning Date":"2025-01-02","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":6.15517,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.05771869,"Quick Ratio":0.332,"Day High":10.11,"Day Low":9.84,"VS Average Volume":0.117288949,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"UnitedHealth Group Incorporated","Symbol":"UNH","Current Price":"502.07","Latest MA":"553.27","Price Target":"639.52","Difference from MA":"-9.25%","Difference from Open":"2.79%","Change from Yesterday":"2.95%","Change from Last Report":"-0.03","Latest Volume":"2,085,509","Market Cap":"460,178,849,792","Earning Date":"2025-01-10","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":16.727657,"ROE":0.15252,"DTE":74.683,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.591,"Trailing PEG":1.3426,"Trailing PE":32.491226,"Trailing PS":1.168269,"Quick Ratio":0.833,"Day High":503.79,"Day Low":486.35,"VS Average Volume":0.5067345226,"Company Summary":"UnitedHealth Group Incorporated operates as a diversified health care company in the United States. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage, and health and well-being services to individuals age 50 and older addressing their needs; Medicaid plans, children's health insurance and health care programs; and health and dental benefits, and hospital and clinical services, as well as health care benefits products and services to state programs caring for the economically disadvantaged, medically underserved, and those without the benefit of employer-funded health care coverage. The Optum Health segment provides care delivery, care management, wellness and consumer engagement, and health financial services patients, consumers, care delivery systems, providers, employers, payers, and public-sector entities. The Optum Insight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The Optum Rx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and community health pharmacy services, infusion, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease\/drug therapy management. UnitedHealth Group Incorporated was founded in 1974 and is based in Minnetonka, Minnesota.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"18-12-2024 17:06:56"},{"Company Name":"Nike, Inc.","Symbol":"NKE","Current Price":"78.19","Latest MA":"81.01","Price Target":"88.53","Difference from MA":"-3.48%","Difference from Open":"0.27%","Change from Yesterday":"0.28%","Change from Last Report":"-0.03","Latest Volume":"1,777,332","Market Cap":"116,430,471,168","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":25.260698,"ROE":0.3798,"DTE":86.962,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.035,"Trailing PEG":3.9884,"Trailing PE":22.412607,"Trailing PS":2.3280506,"Quick Ratio":1.417,"Day High":78.55,"Day Low":77.35,"VS Average Volume":0.1465957739,"Company Summary":"NIKE, Inc., together with its subsidiaries, engages in the design, development, marketing, and sale of athletic footwear, apparel, equipment, accessories, and services worldwide. The company provides athletic and casual footwear, apparel, and accessories under the NIKE, Jumpman, Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also sells a line of performance equipment and accessories comprising bags, sport balls, socks, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. In addition, the company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel; licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks; and operates digital platforms, including fitness and activity apps; sport, fitness, and wellness content; and digital services and features in retail stores. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was founded in 1964 and is headquartered in Beaverton, Oregon.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"18-12-2024 17:06:56"}]