[{"Company Name":"Toll Brothers, Inc.","Symbol":"TOL","Current Price":"138.41","Latest MA":"138.23","Price Target":"162.15","Difference from MA":"0.14%","Difference from Open":"-2.52%","Change from Yesterday":"-2.82%","Change from Last Report":"-0.05","Latest Volume":"1,323,451","Market Cap":"13,812,155,392","Earning Date":"2024-12-09","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":8.71191,"ROE":0.21799,"DTE":39.692,"Stock Sentiment":"Strong Buy","Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.671,"Trailing PEG":0.9857,"Trailing PS":1.3112692,"Quick Ratio":"N\/A","Day High":142.02,"Day Low":138.39,"Average Volume":1252080,"Company Summary":"Toll Brothers, Inc., together with its subsidiaries, designs, builds, markets, sells, and arranges finance for a range of detached and attached homes in luxury residential communities in the United States. It designs, builds, markets, and sells condominiums through Toll Brothers City Living. The company also develops a range of single-story living and first-floor primary bedroom suite home designs, as well as communities with recreational amenities, such as golf courses, marinas, pool complexes, country clubs, and fitness and recreation centers; and develops, operates, and rents apartments. In addition, it provides various interior fit-out options, such as flooring, wall tile, plumbing, cabinets, fixtures, appliances, lighting, and home-automation and security technologies. Further, the company owns and operates architectural, engineering, mortgage, title, land development, insurance, smart home technology, landscaping, lumber distribution, house component assembly, and component manufacturing operations. It serves luxury first-time, move-up, empty-nester, active-adult, and second-home buyers. Toll Brothers, Inc. was founded in 1967 and is headquartered in Fort Washington, Pennsylvania.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Lamb Weston Holdings, Inc.","Symbol":"LW","Current Price":"74.22","Latest MA":"73.47","Price Target":"80.42","Difference from MA":"1.03%","Difference from Open":"-1.24%","Change from Yesterday":"-0.98%","Change from Last Report":"0.24","Latest Volume":"738,517","Market Cap":"10,584,336,384","Earning Date":"2025-01-02","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.049828,"ROE":0.37015,"DTE":221.158,"Stock Sentiment":"Buy","Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.715,"Trailing PEG":2.5288,"Trailing PS":1.6393558,"Quick Ratio":"N\/A","Day High":75.17,"Day Low":73.565,"Average Volume":2275639,"Company Summary":"Lamb Weston Holdings, Inc. engages in the production, distribution, and marketing of frozen potato products in the United States, Canada, Mexico, and internationally. It offers frozen potatoes, commercial ingredients, and appetizers under the Lamb Weston brand, as well as under various customer labels. The company also provides its products under its owned or licensed brands, such as Grown in Idaho and Alexia, and other licensed brands, as well as under retailers' own brands. It sells its products through a network of internal sales personnel and independent brokers, agents, and distributors to quick service and full-service restaurants and chains, wholesale, grocery, mass merchants, club retailers, and specialty retailers, as well as foodservice distributors and institutions, including businesses, educational institutions, independent restaurants, regional chain restaurants, and convenience stores. The company was incorporated in 1950 and is headquartered in Eagle, Idaho.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Birkenstock Holding plc","Symbol":"BIRK","Current Price":"53.38","Latest MA":"52.50","Price Target":"65.92","Difference from MA":"1.67%","Difference from Open":"-1.78%","Change from Yesterday":"-1.36%","Change from Last Report":"-0.11","Latest Volume":"712,324","Market Cap":"10,032,885,760","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":30.859846,"ROE":0.04422,"DTE":57.584,"Stock Sentiment":"Strong Buy","Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":null,"Trailing PS":5.821332,"Quick Ratio":"N\/A","Day High":54.6615,"Day Low":52.79,"Average Volume":1136407,"Company Summary":"Birkenstock Holding plc manufactures and sells footwear products. It also offers sandals, shoes, closed-toe silhouettes, skincare products, and accessories. The company sells its products through e-commerce sites and a network of owned retail stores, as well as business-to-business channels. It operates in the United States, Brazil, Canada, Mexico, Europe, APMA, and internationally. Birkenstock Holding plc was founded in 1774 and is based in London, the United Kingdom. Birkenstock Holding plc operates as a subsidiary of BK LC Lux MidCo S.à r.l.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"General Mills, Inc.","Symbol":"GIS","Current Price":"66.31","Latest MA":"67.83","Price Target":"74.11","Difference from MA":"-2.24%","Difference from Open":"0.56%","Change from Yesterday":"1.23%","Change from Last Report":"0.07","Latest Volume":"1,678,447","Market Cap":"36,809,818,112","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":14.106696,"ROE":0.24168,"DTE":139.823,"Stock Sentiment":"Buy","Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.107,"Trailing PEG":3.3384,"Trailing PS":1.8590254,"Quick Ratio":"N\/A","Day High":66.375,"Day Low":65.2514,"Average Volume":3763374,"Company Summary":"General Mills, Inc. manufactures and markets branded consumer foods worldwide. The company operates through four segments: North America Retail; International; Pet; and North America Foodservice. It offers grain, ready-to-eat cereals, refrigerated yogurt, soup, meal kits, refrigerated and frozen dough products, dessert and baking mixes, bakery flour, frozen pizza and pizza snacks, snack bars, fruit and savory snacks, ice cream and frozen desserts, unbaked and fully baked frozen dough products, frozen hot snacks, ethnic meals, side dish mixes, frozen breakfast and entrees, nutrition bars, and frozen and shelf-stable vegetables. The company also manufactures and markets pet food products, including dog and cat food; and operates ice cream parlors. It markets its products under the Annie's, Betty Crocker, Bisquick, Blue Buffalo, Bugles, Cascadian Farm, Cheerios, Chex, Cinnamon Toast Crunch, Cocoa Puffs, Cookie Crisp, Dunkaroos, Edgard & Cooper, Fiber One, Fruit by the Foot, Fruit Gushers, Fruit Roll-Ups, Gardetto's, Gold Medal, Golden Grahams, Häagen-Dazs, Kitano, Kix, Lärabar, Latina, Lucky Charms, Muir Glen, Nature Valley, Nudges, Oatmeal Crisp, Old El Paso, Pillsbury, Progresso, Tastefuls, Total, Totino's , Trix, True Chews, True Solutions, Wanchai Ferry, Wheaties, Wilderness, and Yoki brands. The company sells its products to grocery stores, mass merchandisers, membership stores, natural food chains, drug, dollar and discount chains, e-commerce retailers, commercial and noncommercial foodservice distributors and operators, restaurants, convenience stores, and pet specialty stores. General Mills, Inc. was founded in 1866 and is headquartered in Minneapolis, Minnesota.","Row Color":"negative-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"FedEx Corporation","Symbol":"FDX","Current Price":"283.33","Latest MA":"276.60","Price Target":"311.30","Difference from MA":"2.43%","Difference from Open":"0.65%","Change from Yesterday":"0.78%","Change from Last Report":"0.13","Latest Volume":"641,945","Market Cap":"69,227,700,224","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.32808,"ROE":0.1507,"DTE":"N\/A","Stock Sentiment":"Strong Buy","Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":1.177,"Trailing PEG":1.1476,"Trailing PS":0.79035175,"Quick Ratio":"N\/A","Day High":284.5,"Day Low":279.37,"Average Volume":1846301,"Company Summary":"FedEx Corporation, together with its subsidiaries, provides transportation, e-commerce, and business services in the United States and internationally. It operates through FedEx Express, FedEx Ground, FedEx Freight, and FedEx Services segments. The FedEx Express segment offers express transportation, small-package ground delivery, and freight transportation services; and time-critical transportation services. The FedEx Ground segment provides small-package ground delivery services. The FedEx Freight segment offers less-than-truckload freight transportation services. The FedEx Services segment provides sales, marketing, information technology, communications, customer service, technical support, billing and collection, and back-office support services. In addition, the company offers supply chain management solutions; and air and ocean freight forwarding and cargo transportation, specialty transportation, customs brokerage, third party logistics and supply chain, and document and business solutions, as well as provides trade management tools and data. The company was founded in 1971 and is headquartered in Memphis, Tennessee.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Constellation Brands, Inc.","Symbol":"STZ","Current Price":"238.95","Latest MA":"245.20","Price Target":"290.00","Difference from MA":"-2.55%","Difference from Open":"-1.05%","Change from Yesterday":"-0.39%","Change from Last Report":"0.11","Latest Volume":"668,728","Market Cap":"43,390,160,896","Earning Date":"2025-01-03","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":15.75858,"ROE":0.07111,"DTE":149.155,"Stock Sentiment":"Strong Buy","Industry":"Beverages - Brewers","Sector":"Consumer Defensive","Beta":0.893,"Trailing PEG":1.2603,"Trailing PS":4.2577777,"Quick Ratio":"N\/A","Day High":242.64,"Day Low":238.18,"Average Volume":1299325,"Company Summary":"Constellation Brands, Inc., together with its subsidiaries, produces, imports, markets, and sells beer, wine, and spirits in the United States, Canada, Mexico, New Zealand, and Italy. The company provides beer primarily under the Corona Extra, Corona Familiar, Corona Hard Seltzer, Corona Light, Corona Non-Alcoholic, Corona Premier, Corona Refresca, Modelo Especial, Modelo Chelada, Modelo Negra, Modelo Oro, Victoria, Vicky Chamoy, and Pacifico brands. It also offers wine under the Cook's California Champagne, Kim Crawford, Meiomi, Mount Veeder, Ruffino, SIMI, My Favorite Neighbor, Robert Mondavi Winery, Schrader, and The Prisoner Wine Company brands; and spirits under the Casa Noble, Copper & Kings, High West, Mi CAMPO, Nelson's Green Brier, and SVEDKA brands. The company provides its products to wholesale distributors, retailers, on-premise locations, and state alcohol beverage control agencies. Constellation Brands, Inc. was founded in 1945 and is headquartered in Victor, New York.","Row Color":"negative-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"ConAgra Brands, Inc.","Symbol":"CAG","Current Price":"28.18","Latest MA":"29.29","Price Target":"30.80","Difference from MA":"-3.78%","Difference from Open":"0.48%","Change from Yesterday":"1.64%","Change from Last Report":"0.11","Latest Volume":"2,957,465","Market Cap":"13,451,938,816","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":10.552346,"ROE":0.05605,"DTE":100.881,"Stock Sentiment":"Buy","Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.332,"Trailing PEG":0.3328,"Trailing PS":1.1264583,"Quick Ratio":"N\/A","Day High":28.2,"Day Low":27.7,"Average Volume":5056149,"Company Summary":"Conagra Brands, Inc., together with its subsidiaries, operates as a consumer packaged goods food company primarily in the United States. The company operates through four segments: Grocery & Snacks, Refrigerated & Frozen, International, and Foodservice. The Grocery & Snacks segment primarily offers shelf stable food products through various retail channels. The Refrigerated & Frozen segment provides temperature-controlled food products through various retail channels. The International segment offers food products in various temperature states through retail and foodservice channels outside of the United States. The Foodservice segment offers branded and customized food products, including meals, entrees, sauces, and various custom-manufactured culinary products packaged for restaurants and other foodservice establishments. The company sells its products under the Birds Eye, Marie Callender's, Duncan Hines, Healthy Choice, Slim Jim, Reddi-wip, Angie's, BOOMCHICKAPOP brands. The company was incorporated in 1919 and is headquartered in Chicago, Illinois.","Row Color":"negative-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Nike, Inc.","Symbol":"NKE","Current Price":"78.22","Latest MA":"81.36","Price Target":"89.70","Difference from MA":"-3.86%","Difference from Open":"-0.62%","Change from Yesterday":"-0.81%","Change from Last Report":"-0.04","Latest Volume":"4,539,260","Market Cap":"116,423,016,448","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.535112,"ROE":0.3798,"DTE":86.962,"Stock Sentiment":"Strong Buy","Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.035,"Trailing PEG":4.0318,"Trailing PS":2.3279016,"Quick Ratio":"N\/A","Day High":79.37,"Day Low":78.07,"Average Volume":11965880,"Company Summary":"NIKE, Inc., together with its subsidiaries, engages in the design, development, marketing, and sale of athletic footwear, apparel, equipment, accessories, and services worldwide. The company provides athletic and casual footwear, apparel, and accessories under the NIKE, Jumpman, Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also sells a line of performance equipment and accessories comprising bags, sport balls, socks, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. In addition, the company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel; licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks; and operates digital platforms, including fitness and activity apps; sport, fitness, and wellness content; and digital services and features in retail stores. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was founded in 1964 and is headquartered in Beaverton, Oregon.","Row Color":"negative-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"MongoDB, Inc.","Symbol":"MDB","Current Price":"288.04","Latest MA":"275.29","Price Target":"388.69","Difference from MA":"4.63%","Difference from Open":"-1.34%","Change from Yesterday":"-3.07%","Change from Last Report":"-0.12","Latest Volume":"2,184,802","Market Cap":"21,453,490,176","Earning Date":"2024-12-09","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":86.91664,"ROE":-0.19561,"DTE":89.869,"Stock Sentiment":"Strong Buy","Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.153,"Trailing PEG":null,"Trailing PS":11.790158,"Quick Ratio":"N\/A","Day High":294.62,"Day Low":284.2879,"Average Volume":1544455,"Company Summary":"MongoDB, Inc., together with its subsidiaries, provides general purpose database platform worldwide. The company provides MongoDB Atlas, a hosted multi-cloud database-as-a-service solution; MongoDB Enterprise Advanced, a commercial database server for enterprise customers to run in the cloud, on-premises, or in a hybrid environment; and Community Server, a free-to-download version of its database, which includes the functionality that developers need to get started with MongoDB. It offers professional services comprising consulting and training. The company was formerly known as 10gen, Inc. and changed its name to MongoDB, Inc. in August 2013. MongoDB, Inc. was incorporated in 2007 and is headquartered in New York, New York.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"KB Home","Symbol":"KBH","Current Price":"73.71","Latest MA":"77.69","Price Target":"84.50","Difference from MA":"-5.12%","Difference from Open":"-0.41%","Change from Yesterday":"-0.81%","Change from Last Report":"-0.01","Latest Volume":"1,157,848","Market Cap":"5,405,485,568","Earning Date":"2025-01-08","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.145561,"ROE":0.15727,"DTE":42.959,"Stock Sentiment":"Sell","Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.815,"Trailing PEG":null,"Trailing PS":0.8184952,"Quick Ratio":"N\/A","Day High":75.16,"Day Low":73.13,"Average Volume":1042209,"Company Summary":"KB Home operates as a homebuilding company in the United States. It operates through four segments: West Coast, Southwest, Central, and Southeast. It builds and sells various homes, including attached and detached single-family residential homes, townhomes, and condominiums primarily for first-time, first move-up, second move-up, and active adult homebuyers. The company also provides financial services, such as insurance products and title services, as well as mortgage banking services, including residential consumer mortgage loans to homebuyers. It has operations in Arizona, California, Colorado, Florida, Idaho, Nevada, North Carolina, Texas, and Washington. The company was formerly known as Kaufman and Broad Home Corporation and changed its name to KB Home in January 2001. KB Home was founded in 1957 and is based in Los Angeles, California.","Row Color":"negative-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Ferguson Enterprises Inc.","Symbol":"FERG","Current Price":"191.10","Latest MA":"202.62","Price Target":"225.99","Difference from MA":"-5.68%","Difference from Open":"-1.22%","Change from Yesterday":"-1.32%","Change from Last Report":"0.04","Latest Volume":"1,224,535","Market Cap":"38,352,097,280","Earning Date":"2024-12-10","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.70471,"ROE":0.32573003,"DTE":98.237,"Stock Sentiment":"Strong Buy","Industry":"Industrial Distribution","Sector":"Industrials","Beta":1.2,"Trailing PEG":1.6969,"Trailing PS":1.2941487,"Quick Ratio":"N\/A","Day High":195.025,"Day Low":190.61,"Average Volume":1745395,"Company Summary":"Ferguson Enterprises Inc. distributes plumbing and heating products in the United States and Canada. The company provides expertise, solutions, and products, including infrastructure, plumbing, appliances, fire, and fabrication, as well as heating, ventilation, and air conditioning (HVAC) to residential and non-residential customers. It also supplies specialist water and wastewater treatment products to residential, commercial, and infrastructure contractors, as well as supplies pipe, valves, and fittings solutions to industrial customers. In addition, it offers customized solutions, such as virtual design, fabrication, valve actuation, pre-assembly, kitting, installation, and project management services, as well as after-sales support that comprises warranty, credit, project-based billing, returns and maintenance, and repair and operations support. The company sells its products through a network of distribution centers, branches, counter service and specialist sales associates, showroom consultants, and e-commerce channels. Ferguson Enterprises Inc. was founded in 1953 and is headquartered in Newport News, Virginia.","Row Color":"negative-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"UnitedHealth Group Incorporated","Symbol":"UNH","Current Price":"515.41","Latest MA":"553.44","Price Target":"639.92","Difference from MA":"-6.87%","Difference from Open":"-3.03%","Change from Yesterday":"-3.42%","Change from Last Report":"0.10","Latest Volume":"6,433,266","Market Cap":"474,226,786,304","Earning Date":"2025-01-10","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":17.223412,"ROE":0.15252,"DTE":74.683,"Stock Sentiment":"Strong Buy","Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.591,"Trailing PEG":1.4739,"Trailing PS":1.203933,"Quick Ratio":"N\/A","Day High":533.275,"Day Low":514.19,"Average Volume":3648457,"Company Summary":"UnitedHealth Group Incorporated operates as a diversified health care company in the United States. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage, and health and well-being services to individuals age 50 and older addressing their needs; Medicaid plans, children's health insurance and health care programs; and health and dental benefits, and hospital and clinical services, as well as health care benefits products and services to state programs caring for the economically disadvantaged, medically underserved, and those without the benefit of employer-funded health care coverage. The Optum Health segment provides care delivery, care management, wellness and consumer engagement, and health financial services patients, consumers, care delivery systems, providers, employers, payers, and public-sector entities. The Optum Insight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The Optum Rx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and community health pharmacy services, infusion, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease\/drug therapy management. UnitedHealth Group Incorporated was founded in 1974 and is based in Minnetonka, Minnesota.","Row Color":"negative-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Darden Restaurants, Inc.","Symbol":"DRI","Current Price":"165.31","Latest MA":"154.50","Price Target":"183.63","Difference from MA":"6.99%","Difference from Open":"-1.40%","Change from Yesterday":"-1.50%","Change from Last Report":"0.00","Latest Volume":"717,890","Market Cap":"19,423,336,448","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.65879,"ROE":0.48619,"DTE":326.282,"Stock Sentiment":"Strong Buy","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.309,"Trailing PEG":1.7766,"Trailing PS":1.7013539,"Quick Ratio":"N\/A","Day High":168.8,"Day Low":164.38,"Average Volume":1210746,"Company Summary":"Darden Restaurants, Inc., together with its subsidiaries, owns and operates full-service restaurants in the United States and Canada. It operates under Olive Garden, LongHorn Steakhouse, Cheddar's Scratch Kitchen, Yard House, The Capital Grille, Seasons 52, Bahama Breeze, Eddie V's Prime Seafood, and Capital Burger brand names. Darden Restaurants, Inc. was incorporated in 1995 and is based in Orlando, Florida.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Nordson Corporation","Symbol":"NDSN","Current Price":"229.09","Latest MA":"246.65","Price Target":"283.20","Difference from MA":"-7.12%","Difference from Open":"-1.68%","Change from Yesterday":"-8.20%","Change from Last Report":"0.20","Latest Volume":"726,785","Market Cap":"13,099,709,440","Earning Date":"2024-12-11","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.115782,"ROE":0.17406,"DTE":56.526,"Stock Sentiment":"Hold","Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":0.907,"Trailing PEG":2.3313,"Trailing PS":4.9159203,"Quick Ratio":"N\/A","Day High":244.95,"Day Low":224.94,"Average Volume":214920,"Company Summary":"Nordson Corporation engineers, manufactures, and markets products and systems to dispense, apply, and control adhesives, coatings, polymers, sealants, biomaterials, and other fluids worldwide. It operates through three segments: Industrial Precision Solutions; Medical and Fluid Solutions; and Advanced Technology Solutions. The Industrial Precision Solutions segment provides dispensing, coating, and laminating systems for adhesives, lotions, liquids, and fibers to disposable products and roll goods; automated adhesive dispensing systems used in packaged goods industries; components and systems used in the thermoplastic and biopolymer melt stream; precision agriculture spraying solutions; fluid components, such as nozzles, pumps, and filters; and product assembly systems for use in paper and paperboard converting applications, and manufacturing roll goods. It also offers automated and manual dispensing products and systems for cold materials, container coating, liquid finishing, and powder coating, as well as ultraviolet equipment used primarily in curing and drying operations. The Medical and Fluid Solutions segment offers medical devices, including cannulas, catheters, and medical balloons; single-use plastic components; precision manual and semi-automated dispensers; minimally invasive interventional delivery devices; and plastic molded syringes, cartridges, tips, and fluid connection components. The Advanced Technology Solutions segment provides automated dispensing systems for the attachment, protection, and coating of fluids, as well as related gas plasma treatment systems for cleaning and conditioning surfaces; and bond testing and automated optical, acoustic microscopy, and x-ray inspection systems for use in semiconductor and printed circuit board industries. The company markets its products through direct sales force, as well as distributors and sales representatives. Nordson Corporation was founded in 1909 and is headquartered in Westlake, Ohio.","Row Color":"negative-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Commercial Metals Company","Symbol":"CMC","Current Price":"59.12","Latest MA":"55.17","Price Target":"63.86","Difference from MA":"7.16%","Difference from Open":"-1.12%","Change from Yesterday":"-4.03%","Change from Last Report":"0.17","Latest Volume":"643,528","Market Cap":"6,741,099,008","Earning Date":"2025-01-06","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":12.872434,"ROE":0.1153,"DTE":31.777,"Stock Sentiment":"Buy","Industry":"Steel","Sector":"Basic Materials","Beta":1.135,"Trailing PEG":null,"Trailing PS":0.85050756,"Quick Ratio":"N\/A","Day High":60.4369,"Day Low":58.4,"Average Volume":842798,"Company Summary":"Commercial Metals Company manufactures, recycles, and fabricates steel and metal products, and related materials and services in the United States, Poland, China, and internationally. It operates through three segments: North America Steel Group; Europe Steel Group; and Emerging Businesses Group. The company processes and sells ferrous and nonferrous scrap metals to steel mills and foundries, aluminum sheet and ingot manufacturers, brass and bronze ingot makers, copper refineries and mills, secondary lead smelters, specialty steel mills, high temperature alloy manufacturers, and other consumers. It also manufactures and sells finished long steel products, including reinforcing bar, merchant bar, light structural, and other special sections, as well as semi-finished billets for rerolling and forging applications. In addition, the company provides fabricated rebar used to reinforce concrete primarily in the construction of commercial and non-commercial buildings, hospitals, convention centers, industrial plants, power plants, highways, bridges, arenas, stadiums, and dams; sells and rents construction-related products and equipment to concrete installers and other businesses; and manufactures and sells strength bars for the truck trailer industry, special bar steels for the energy market, and armor plates for military vehicles. Further, it manufactures rebars, merchant bars, and wire rods; and sells fabricated rebars, wire meshes, welded steel mesh, wire rod, cold rolled rebar, cold rolled wire rod, assembled rebar cages and other fabricated rebar by-products to fabricators, manufacturers, distributors, and construction companies. The company was founded in 1915 and is headquartered in Irving, Texas.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Bruker Corporation","Symbol":"BRKR","Current Price":"58.83","Latest MA":"63.79","Price Target":"72.25","Difference from MA":"-7.77%","Difference from Open":"-1.19%","Change from Yesterday":"-1.36%","Change from Last Report":"0.10","Latest Volume":"602,451","Market Cap":"8,920,026,112","Earning Date":"2025-01-06","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":21.526697,"ROE":0.19725999,"DTE":132.635,"Stock Sentiment":"Strong Buy","Industry":"Medical Devices","Sector":"Healthcare","Beta":1.204,"Trailing PEG":null,"Trailing PS":2.7519903,"Quick Ratio":"N\/A","Day High":59.99,"Day Low":58.41,"Average Volume":1380358,"Company Summary":"Bruker Corporation, together with its subsidiaries, develops, manufactures, and distributes scientific instruments, and analytical and diagnostic solutions in the United States, Europe, the Asia Pacific, and internationally. The company operates through four segments: Bruker Scientific Instruments (BSI) BioSpin, BSI CALID, BSI Nano, and Bruker Energy & Supercon Technologies. It offers life science tools, and single and multiple modality systems; life science mass spectrometry; MALDI Biotyper rapid pathogen identification platform and related test kits, DNA test strips, and fluorescence-based polymerase chain reaction technology; genotype and fluorotype molecular diagnostics kits; research, analytical, and process analysis instruments and solutions; SARS-CoV 2 testing for the diagnosis of COVID-19 infection; and Fluorotyper-SARS-CoV 2 plus kits. It also provides range of portable analytical and bioanalytical detection systems, and related products; X-ray instruments; analytical tools for electron microscopes, as well as handheld, portable, and mobile X-ray fluorescence spectrometry instruments; atomic force microscopy instrumentation; non-contact nanometer resolution solution topography; and automated X-ray metrology, automated AFM defect-detection, and photomask repair and cleaning equipment. In addition, the company offers advanced optical fluorescence microscopy instruments; products and services to support the multi-omics needs of researchers in translational research, drug, and biomarker discovery; superconducting materials, such as metallic low temperature superconductors; devices and complex tools based on metallic low temperature superconductors; and non-superconducting high technology tools, such as synchrotron and beamline instrumentation. The company was incorporated in 1991 and is headquartered in Billerica, Massachusetts.","Row Color":"negative-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Lennar Corporation","Symbol":"LEN","Current Price":"155.67","Latest MA":"169.13","Price Target":"197.33","Difference from MA":"-7.96%","Difference from Open":"-0.28%","Change from Yesterday":"-1.56%","Change from Last Report":"0.01","Latest Volume":"1,572,803","Market Cap":"42,030,850,048","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.749906,"ROE":0.15878001,"DTE":14.665,"Stock Sentiment":"Buy","Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.619,"Trailing PEG":1.1158,"Trailing PS":1.1527066,"Quick Ratio":"N\/A","Day High":157.445,"Day Low":155.58,"Average Volume":1958528,"Company Summary":"Lennar Corporation, together with its subsidiaries, operates as a homebuilder primarily under the Lennar brand in the United States. It operates through Homebuilding East, Homebuilding Central, Homebuilding Texas, Homebuilding West, Financial Services, Multifamily, and Lennar Other segments. The company's homebuilding operations include the construction and sale of single-family attached and detached homes, as well as the purchase, development, and sale of residential land; and development, construction, and management of multifamily rental properties. It also offers residential mortgage financing, title, insurance, and closing services for home buyers and others, as well as originates and sells securitization commercial mortgage loans. In addition, the company is involved in the fund investment activity. It primarily serves first-time, move-up, active adult, and luxury homebuyers. Lennar Corporation was founded in 1954 and is based in Miami, Florida.","Row Color":"negative-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Cintas Corporation","Symbol":"CTAS","Current Price":"211.01","Latest MA":"194.90","Price Target":"215.17","Difference from MA":"8.27%","Difference from Open":"0.16%","Change from Yesterday":"0.02%","Change from Last Report":"0.06","Latest Volume":"603,193","Market Cap":"85,100,118,016","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":45.13573,"ROE":0.40462002,"DTE":70.573,"Stock Sentiment":"Buy","Industry":"Specialty Business Services","Sector":"Industrials","Beta":1.313,"Trailing PEG":4.4438,"Trailing PS":8.722963,"Quick Ratio":"N\/A","Day High":211.61,"Day Low":209.3433,"Average Volume":1408076,"Company Summary":"Cintas Corporation engages in the provision of corporate identity uniforms and related business services primarily in the United States, Canada, and Latin America. It operates through Uniform Rental and Facility Services, First Aid and Safety Services, and All Other segments. The company rents and services uniforms and other garments, including flame resistant clothing, mats, mops and shop towels, and other ancillary items; and provides restroom cleaning services and supplies, as well as sells uniforms. In addition, the company offers first aid and safety services, and fire protection products and services. It provides its products and services through its distribution network and local delivery routes, or local representatives to small service and manufacturing companies, as well as major corporations. The company was founded in 1968 and is based in Cincinnati, Ohio. Cintas Corporation was formerly a subsidiary of Cintas Corporation.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Adobe Inc.","Symbol":"ADBE","Current Price":"476.08","Latest MA":"519.75","Price Target":"610.33","Difference from MA":"-8.40%","Difference from Open":"-1.92%","Change from Yesterday":"-13.46%","Change from Last Report":"0.11","Latest Volume":"14,782,308","Market Cap":"209,504,387,072","Earning Date":"2024-12-11","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.633131,"ROE":0.35355,"DTE":41.788,"Stock Sentiment":"Strong Buy","Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.299,"Trailing PEG":1.7784,"Trailing PS":10.001642,"Quick Ratio":"N\/A","Day High":494.0,"Day Low":470.9001,"Average Volume":3043996,"Company Summary":"Adobe Inc., together with its subsidiaries, operates as a diversified software company worldwide. It operates through three segments: Digital Media, Digital Experience, and Publishing and Advertising. The Digital Media segment offers products, services, and solutions that enable individuals, teams, and enterprises to create, publish, and promote content; and Document Cloud, a unified cloud-based document services platform. Its flagship product is Creative Cloud, a subscription service that allows members to access its creative products. This segment serves content creators, students, workers, marketers, educators, enthusiasts, and communicators. The Digital Experience segment provides an integrated platform and set of applications and services that enable brands and businesses to create, manage, execute, measure, monetize, and optimize customer experiences from analytics to commerce. This segment serves marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers, and executives across the C-suite. The Publishing and Advertising segment offers products and services, such as e-learning solutions, technical document publishing, web conferencing, document and forms platform, web application development, and high-end printing, as well as Advertising Cloud offerings. It also provides consulting, technical support, and learning services. The company offers its products and services directly to enterprise customers through its sales force and local field offices, as well as to end users through app stores and through its website at adobe.com. It also distributes products and services through distributors, value-added resellers, systems integrators, software vendors and developers, retailers, and original equipment manufacturers. The company was formerly known as Adobe Systems Incorporated and changed its name to Adobe Inc. in October 2018. Adobe Inc. was founded in 1982 and is headquartered in San Jose, California.","Row Color":"negative-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Paychex, Inc.","Symbol":"PAYX","Current Price":"141.44","Latest MA":"130.33","Price Target":"138.92","Difference from MA":"8.53%","Difference from Open":"0.00%","Change from Yesterday":"0.14%","Change from Last Report":"0.05","Latest Volume":"754,757","Market Cap":"50,903,969,792","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":26.73451,"ROE":0.45672,"DTE":22.517,"Stock Sentiment":"Strong Sell","Industry":"Software - Application","Sector":"Technology","Beta":0.987,"Trailing PEG":4.2203,"Trailing PS":9.584991,"Quick Ratio":"N\/A","Day High":142.16,"Day Low":139.56,"Average Volume":1650406,"Company Summary":"Paychex, Inc., together with its subsidiaries, provides integrated human capital management solutions (HCM) for payroll, benefits, human resources (HR), and insurance services for small to medium-sized businesses in the United States, Europe, and India. It offers payroll processing services; payroll tax administration services; employee payment services; and regulatory compliance services, such as new-hire reporting and garnishment processing. The company also provides HR solutions, including integrated HCM technology solutions and HR advisory services through both virtual and on-site availability of a professionally trained HR representative, as well as HR support to non-payroll clients through its HR Partner Plus solution; and retirement services administration, such as plan implementation, ongoing compliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services. In addition, it offers cloud-based HR administration software products for employee benefits management and administration, time and attendance, digital communication solutions, recruiting, and onboarding solutions; plan administration outsourcing and state unemployment insurance services; various business services to small to medium-sized businesses comprising payroll funding and outsourcing services, which include payroll processing, invoicing, and tax preparation; and payment processing services, financial fitness programs, and a small-business loan resource center. Further, the company provides insurance services for property and casualty coverage, such as workers' compensation, business-owner policies, cyber security protection, and commercial auto, as well as health and benefits coverage, including health, dental, vision, and life. It markets and sells its services primarily through its direct sales force. The company was founded in 1971 and is headquartered in Rochester, New York.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Accenture plc","Symbol":"ACN","Current Price":"360.21","Latest MA":"331.39","Price Target":"388.10","Difference from MA":"8.70%","Difference from Open":"-0.30%","Change from Yesterday":"-0.99%","Change from Last Report":"-0.01","Latest Volume":"1,163,503","Market Cap":"225,098,121,216","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":25.660091,"ROE":0.26674998,"DTE":14.127,"Stock Sentiment":"Strong Buy","Industry":"Information Technology Services","Sector":"Technology","Beta":1.245,"Trailing PEG":2.2742,"Trailing PS":3.468573,"Quick Ratio":"N\/A","Day High":361.99,"Day Low":355.4,"Average Volume":2482220,"Company Summary":"Accenture plc provides strategy and consulting, industry X, song, and technology and operation services in North America, Europe, the Middle East, Africa, and internationally. It offers systems integration and application management; security; intelligent platform; infrastructure; software engineering; data and AI; and automation services. The company also operates business processes; and designs, manufactures, and assembles automation equipment, robotics, and other commercial hardware products. It serves communications, media, and technology; banking and capital markets, and insurance; health and public service; consumer goods, retail, travel services; industrial; life science; chemicals, natural resources, energy, and utilities sectors. It has collaboration agreement with Kyoto University to advance learning, research, and innovation in human-centered  AI. The company was founded in 1951 and is based in Dublin, Ireland.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"9.70","Latest MA":"10.77","Price Target":"9.94","Difference from MA":"-9.91%","Difference from Open":"-1.62%","Change from Yesterday":"-1.32%","Change from Last Report":"0.00","Latest Volume":"16,051,672","Market Cap":"8,395,431,424","Earning Date":"2025-01-02","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":6.3249087,"ROE":-0.75969005,"DTE":277.898,"Stock Sentiment":"Hold","Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PS":0.056857277,"Quick Ratio":"N\/A","Day High":10.015,"Day Low":9.56,"Average Volume":23359895,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Row Color":"negative-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Micron Technology, Inc.","Symbol":"MU","Current Price":"98.57","Latest MA":"110.53","Price Target":"147.25","Difference from MA":"-10.82%","Difference from Open":"-2.98%","Change from Yesterday":"-3.42%","Change from Last Report":"0.17","Latest Volume":"14,156,768","Market Cap":"109,810,925,568","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.6103544,"ROE":0.01743,"DTE":31.194,"Stock Sentiment":"Strong Buy","Industry":"Semiconductors","Sector":"Technology","Beta":1.179,"Trailing PEG":0.163,"Trailing PS":4.373021,"Quick Ratio":"N\/A","Day High":101.98,"Day Low":97.76,"Average Volume":21155496,"Company Summary":"Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Mainland China, rest of the Asia Pacific, Hong Kong, Japan, Europe, and internationally. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Embedded Business Unit, and Storage Business Unit. It provides memory and storage technologies comprising dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; non-volatile and re-writeable semiconductor storage devices; and non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers serves the data center, PC, graphics, networking, automotive, industrial, and consumer embedded markets, as well as for smartphone and other mobile-device markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.","Row Color":"negative-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Broadcom Inc.","Symbol":"AVGO","Current Price":"180.85","Latest MA":"161.87","Price Target":"195.62","Difference from MA":"11.72%","Difference from Open":"-0.04%","Change from Yesterday":"-1.27%","Change from Last Report":"-0.15","Latest Volume":"23,058,659","Market Cap":"844,254,543,872","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":29.206202,"ROE":0.12509,"DTE":166.032,"Stock Sentiment":"Strong Buy","Industry":"Semiconductors","Sector":"Technology","Beta":1.187,"Trailing PEG":1.3496,"Trailing PS":18.033848,"Quick Ratio":"N\/A","Day High":181.7,"Day Low":176.0,"Average Volume":21887750,"Company Summary":"Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides set-top box system-on-chips (SoCs); cable, digital subscriber line, and passive optical networking central office\/consumer premise equipment SoCs; wireless local area network access point SoCs; Ethernet switching and routing custom silicon solutions; serializer\/deserializer application specific integrated circuits; optical and copper, and physical layer devices; and fiber optic components and RF semiconductor devices. The company also offers RF front end modules and filter; Wi-Fi, Bluetooth, and global positioning system\/global navigation satellite system SoCs; custom touch controllers; inductive charging; attached small computer system interface, and redundant array of independent disks controllers and adapters; peripheral component interconnect express; fiber channel host bus adapters; read channel based SoCs; custom flash controllers; preamplifiers; optocouplers, industrial fiber optics, and motion control encoders and subsystems; light emitting diode, ethernet PHYs, switch ICs, and camera microcontrollers. Its products are used in various applications, including enterprise and data center networking, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was founded in 1961 and is headquartered in Palo Alto, California.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Costco Wholesale Corporation","Symbol":"COST","Current Price":"989.37","Latest MA":"875.57","Price Target":"979.17","Difference from MA":"13.00%","Difference from Open":"-1.23%","Change from Yesterday":"-0.54%","Change from Last Report":"-0.04","Latest Volume":"1,307,798","Market Cap":"439,238,492,160","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":49.991383,"ROE":0.30267,"DTE":42.118,"Stock Sentiment":"Strong Buy","Industry":"Discount Stores","Sector":"Consumer Defensive","Beta":0.789,"Trailing PEG":6.0357,"Trailing PS":1.7262068,"Quick Ratio":"N\/A","Day High":1002.47,"Day Low":989.0,"Average Volume":1833979,"Company Summary":"Costco Wholesale Corporation, together with its subsidiaries, engages in the operation of membership warehouses in the United States, Puerto Rico, Canada, Mexico, Japan, the United Kingdom, Korea, Australia, Taiwan, China, Spain, France, Iceland, New Zealand, and Sweden. The company offers branded and private-label products in a range of merchandise categories. It offers merchandise, such as sundries, dry groceries, candies, coolers, freezers, deli, liquor, and tobacco; appliances, electronics, health and beauty aids, hardware, lawn and garden, sporting goods, tires, toys and seasonal products, office supplies, automotive care products, postages, tickets, apparel, small appliances, furniture, domestics, housewares, special order kiosks, and jewelry; and meat, produce, service deli, and bakery products. The company also operates gasoline, pharmacies, optical, food courts, hearing-aid centers, and tire installation centers; and offers business delivery, travel, grocery, and various other services online. It also operates e-commerce websites. The company was formerly known as Costco Companies, Inc. and changed its name to Costco Wholesale Corporation in August 1999. Costco Wholesale Corporation was founded in 1976 and is based in Issaquah, Washington.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"CarMax Inc","Symbol":"KMX","Current Price":"87.41","Latest MA":"76.70","Price Target":"82.86","Difference from MA":"13.96%","Difference from Open":"0.90%","Change from Yesterday":"0.49%","Change from Last Report":"0.08","Latest Volume":"593,746","Market Cap":"13,544,230,912","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":23.518225,"ROE":0.06853,"DTE":314.637,"Stock Sentiment":"Buy","Industry":"Auto & Truck Dealerships","Sector":"Consumer Cyclical","Beta":1.686,"Trailing PEG":1.0642,"Trailing PS":0.48933122,"Quick Ratio":"N\/A","Day High":87.57,"Day Low":86.615,"Average Volume":1945028,"Company Summary":"CarMax, Inc., through its subsidiaries, operates as a retailer of used vehicles and related products in the United States. It operates in two segments: CarMax Sales Operations and CarMax Auto Finance. The CarMax Sales Operations segment offers customers a range of makes and models of used vehicles, including domestic, imported, and luxury vehicles, as well as hybrid and electric vehicles; used vehicle auctions; extended protection plans to customers at the time of sale; and reconditioning and vehicle repair services. The CarMax Auto Finance segment provides financing alternatives for retail customers across a range of credit spectrum and arrangements with various financial institutions. The company was founded in 1993 and is based in Richmond, Virginia.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Jabil Inc.","Symbol":"JBL","Current Price":"133.76","Latest MA":"117.31","Price Target":"149.25","Difference from MA":"14.03%","Difference from Open":"0.41%","Change from Yesterday":"0.05%","Change from Last Report":"0.09","Latest Volume":"526,954","Market Cap":"15,093,315,584","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.300697,"ROE":0.60295,"DTE":207.887,"Stock Sentiment":"Strong Buy","Industry":"Electronic Components","Sector":"Technology","Beta":1.245,"Trailing PEG":null,"Trailing PS":0.52256745,"Quick Ratio":"N\/A","Day High":134.17,"Day Low":132.815,"Average Volume":1340106,"Company Summary":"Jabil Inc. provides manufacturing services and solutions worldwide. It operates in two segments, Electronics Manufacturing Services and Diversified Manufacturing Services. The company offers electronics design, production, and product management services; electronic circuit design services, such as application-specific integrated circuit design, firmware development, and rapid prototyping services; and designs plastic and metal enclosures that include the electro-mechanics, such as the printed circuit board assemblies (PCBA). It also provides three-dimensional mechanical design comprising the analysis of electronic, electro-mechanical, and optical assemblies, as well as various industrial design, mechanism development, and tooling management services. In addition, the company provides computer-assisted design services consisting of PCBA design, as well as PCBA design validation and verification services; and other consulting services, such as the generation of a bill of materials, approved vendor list, and assembly equipment configuration for various PCBA designs. Further, it offers product and process validation services, such as product system, product safety, regulatory compliance, and reliability tests, as well as manufacturing test solution development services. Additionally, the company provides systems assembly, test, direct-order fulfillment, and configure-to-order services. It serves 5G, wireless and cloud, digital print and retail, industrial and semi-cap, networking and storage, automotive and transportation, connected devices, healthcare and packaging, and mobility industries. The company was formerly known as Jabil Circuit, Inc. and changed its name to Jabil Inc. in June 2017. Jabil Inc. was founded in 1966 and is headquartered in Saint Petersburg, Florida.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Oracle Corporation","Symbol":"ORCL","Current Price":"174.97","Latest MA":"152.86","Price Target":"199.21","Difference from MA":"14.46%","Difference from Open":"-1.70%","Change from Yesterday":"-2.02%","Change from Last Report":"-0.11","Latest Volume":"6,115,460","Market Cap":"489,384,083,456","Earning Date":"2024-12-09","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":24.813618,"ROE":1.55578,"DTE":749.978,"Stock Sentiment":"Strong Buy","Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.013,"Trailing PEG":1.8862,"Trailing PS":9.0938225,"Quick Ratio":"N\/A","Day High":178.1699,"Day Low":174.82,"Average Volume":8508415,"Company Summary":"Oracle Corporation offers products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning (ERP), Oracle Fusion cloud enterprise performance management, Oracle Fusion cloud supply chain and manufacturing management, Oracle Fusion cloud human capital management, Oracle Cerner healthcare, and NetSuite applications suite, as well as Oracle Fusion Sales, Service, and Marketing. The company also offers cloud-based industry solutions for various industries; Oracle application licenses; and Oracle license support services. In addition, it provides cloud and license business' infrastructure technologies, such as the Oracle Database and MySQL Database; Java, a software development language; and middleware, including development tools and others. The company's cloud and license business' infrastructure technologies also comprise cloud-based compute, storage, and networking capabilities; and Oracle autonomous database and MySQL HeatWave, as well as Internet-of-Things, digital assistant, and blockchain. Further, it provides hardware products and other hardware-related software offerings, including Oracle engineered systems, enterprise servers, storage solutions, industry-specific hardware, virtualization software, operating systems, management software, and related hardware services, as well as hardware support products; and consulting and customer services. The company markets and sells its cloud, license, hardware, support, and services offerings directly to businesses in various industries, government agencies, and educational institutions, as well as through indirect channels. Oracle Corporation was founded in 1977 and is headquartered in Austin, Texas.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Ollie's Bargain Outlet Holdings","Symbol":"OLLI","Current Price":"112.33","Latest MA":"93.52","Price Target":"119.87","Difference from MA":"20.12%","Difference from Open":"-1.13%","Change from Yesterday":"-1.03%","Change from Last Report":"0.14","Latest Volume":"868,192","Market Cap":"6,883,540,480","Earning Date":"2024-12-10","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":29.881414,"ROE":0.13548,"DTE":31.499,"Stock Sentiment":"Strong Buy","Industry":"Discount Stores","Sector":"Consumer Defensive","Beta":0.844,"Trailing PEG":null,"Trailing PS":3.1060216,"Quick Ratio":"N\/A","Day High":113.615,"Day Low":110.51,"Average Volume":1061415,"Company Summary":"Ollie's Bargain Outlet Holdings, Inc. operates as a retailer of brand name merchandise in the United States. The company offers housewares, bed and bath, food, floor coverings, health and beauty aids, books and stationery, toys, and electronics; and other products, including hardware, candy, clothing, sporting goods, pet and lawn, and garden products. It provides its products primarily under the Ollie's, Ollie's Bargain Outlet, Good Stuff Cheap, Ollie's Army, Real Brands Real Cheap!, Real Brands! Real Bargains, Sarasota Breeze, Steelton Tools, American Way, and Middleton Home names. The company was formerly known as Bargain Holdings, Inc. and changed its name to Ollie's Bargain Outlet Holdings, Inc. in March 2015. The company was founded in 1982 and is headquartered in Harrisburg, Pennsylvania.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"61.76","Latest MA":"50.22","Price Target":"78.22","Difference from MA":"22.99%","Difference from Open":"-2.89%","Change from Yesterday":"-2.71%","Change from Last Report":"0.00","Latest Volume":"4,951,856","Market Cap":"39,859,007,488","Earning Date":"2025-01-10","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":8.331625,"ROE":0.4067,"DTE":186.78,"Stock Sentiment":"Strong Buy","Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PS":0.660935,"Quick Ratio":"N\/A","Day High":63.7504,"Day Low":61.47,"Average Volume":8440385,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Jefferies Financial Group Inc.","Symbol":"JEF","Current Price":"81.42","Latest MA":"58.67","Price Target":"88.75","Difference from MA":"38.79%","Difference from Open":"1.15%","Change from Yesterday":"1.46%","Change from Last Report":"0.07","Latest Volume":"760,548","Market Cap":"16,732,756,992","Earning Date":"2025-01-06","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":18.34103,"ROE":0.056739997,"DTE":295.803,"Stock Sentiment":"Buy","Industry":"Capital Markets","Sector":"Financial Services","Beta":1.292,"Trailing PEG":null,"Trailing PS":2.6769814,"Quick Ratio":"N\/A","Day High":81.7,"Day Low":80.35,"Average Volume":1606855,"Company Summary":"Jefferies Financial Group Inc. operates as an investment banking and capital markets firm in the Americas, Europe, the Middle East, and the Asia-Pacific. The company operates in two segments, Investment Banking and Capital Markets, and Asset Management. It provides investment banking, advisory services with respect to mergers or acquisitions, debt financing, restructurings or recapitalizations, and private capital advisory transactions; underwriting and placement services related to corporate debt, municipal bonds, mortgage-backed and asset-backed securities, equity and equity-linked securities, and loan syndication services; and corporate lending services. The company also offers financing, securities lending, and other prime brokerage services; equities research, sales, and trading services; wealth management services; and online foreign exchange trading services. In addition, it provides investment grade distressed debt securities, U.S. and European government and agency securities, municipal bonds, leveraged loans, emerging markets debt, and interest rate and credit index derivative products; and manages and offers services to a diverse group of alternative asset management platforms across a spectrum of investment strategies and asset classes. The company was formerly known as Leucadia National Corporation and changed its name to Jefferies Financial Group Inc. in May 2018. Jefferies Financial Group Inc. was founded in 1962 and is headquartered in New York, New York.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Carnival Corporation","Symbol":"CCL","Current Price":"26.31","Latest MA":"18.80","Price Target":"26.25","Difference from MA":"39.91%","Difference from Open":"-0.72%","Change from Yesterday":"-1.13%","Change from Last Report":"-0.17","Latest Volume":"9,864,121","Market Cap":"35,304,071,168","Earning Date":"2024-12-20","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":15.327701,"ROE":0.20120001,"DTE":352.355,"Stock Sentiment":"Strong Buy","Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.668,"Trailing PEG":null,"Trailing PS":1.4422187,"Quick Ratio":"N\/A","Day High":26.78,"Day Low":26.28,"Average Volume":26278395,"Company Summary":"Carnival Corporation & plc engages in the provision of leisure travel services in North America, Australia, Europe, Asia, and internationally. The company operates through four segments: NAA Cruise Operations, Europe Cruise Operations, Cruise Support, and Tour and Other. It operates port destinations, private islands, and a solar park, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. The company offers its services under the Carnival Cruise Line, Princess Cruises, Holland America Line, Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises, and Cunard brand. Additionally, it sells its cruises primarily through travel agents, tour operators, vacation planners, and websites. Carnival Corporation & plc was founded in 1972 and is headquartered in Miami, Florida.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"},{"Company Name":"Ciena Corporation","Symbol":"CIEN","Current Price":"83.73","Latest MA":"57.02","Price Target":"69.93","Difference from MA":"46.84%","Difference from Open":"0.07%","Change from Yesterday":"14.31%","Change from Last Report":"-0.77","Latest Volume":"9,419,591","Market Cap":"12,087,096,320","Earning Date":"2024-12-12","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":24.524902,"ROE":0.047319997,"DTE":55.23,"Stock Sentiment":"Strong Buy","Industry":"Communication Equipment","Sector":"Technology","Beta":0.938,"Trailing PEG":null,"Trailing PS":3.0064936,"Quick Ratio":"N\/A","Day High":89.2499,"Day Low":82.0,"Average Volume":1852390,"Company Summary":"Ciena Corporation provides hardware and software services for delivery of video, data, and voice traffic metro, aggregation, and access communications network worldwide. The company's Networking Platforms segment offers convergence of coherent optical transport, open optical networking, optical transport network switching, IP routing, and switching services. Its products include 6500 Packet-Optical Platform, Waveserver stackable interconnect system, and the 6500 Reconfigurable line system, and the 5400 family of Packet-Optical platforms, as well as 8100 coherent routing platforms; 3000 family of service delivery switches and the 5000 family of service aggregation switches, as well as 8700 Packetwave Platform and 6500 Packet Transport System. This segment also sells operating system software and enhanced software features embedded in each of its products. The company's Blue Planet Automation Software and Services segment provides multi-domain service orchestration, inventory, route optimization and analysis, multi-cloud orchestration, and unified assurance and analytics services. Its Platform Software and Service segment offers MCP domain controller solution, and OneControl unified management system, as well as planning tools. The company's Global Services segment provides maintenance support and training, installation and deployment, and consulting and network design services. Ciena Corporation was incorporated in 1992 and is headquartered in Hanover, Maryland.","Row Color":"positive-row","Last Updated":"12-12-2024 22:25:10"}]