[{"Company Name":"Paychex, Inc.","Symbol":"PAYX","Current Price":"135.86","Latest MA":"130.79","Price Target":"138.92","Difference from MA":"3.87%","Difference from Open":"-2.62%","Change from Yesterday":"-3.15%","Change from Last Report":"0.00","Latest Volume":"3,954,311","Market Cap":"48,895,741,952","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":25.710608,"ROE":0.45672,"DTE":22.517,"Industry":"Software - Application","Sector":"Technology","Beta":0.987,"Trailing PEG":4.0595,"Trailing PE":28.968018,"Trailing PS":9.206851,"Quick Ratio":0.599,"Day High":141.7,"Day Low":135.84,"VS Average Volume":2.2860513275,"Company Summary":"Paychex, Inc., together with its subsidiaries, provides integrated human capital management solutions (HCM) for payroll, benefits, human resources (HR), and insurance services for small to medium-sized businesses in the United States, Europe, and India. It offers payroll processing services; payroll tax administration services; employee payment services; and regulatory compliance services, such as new-hire reporting and garnishment processing. The company also provides HR solutions, including integrated HCM technology solutions and HR advisory services through both virtual and on-site availability of a professionally trained HR representative, as well as HR support to non-payroll clients through its HR Partner Plus solution; and retirement services administration, such as plan implementation, ongoing compliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services. In addition, it offers cloud-based HR administration software products for employee benefits management and administration, time and attendance, digital communication solutions, recruiting, and onboarding solutions; plan administration outsourcing and state unemployment insurance services; various business services to small to medium-sized businesses comprising payroll funding and outsourcing services, which include payroll processing, invoicing, and tax preparation; and payment processing services, financial fitness programs, and a small-business loan resource center. Further, the company provides insurance services for property and casualty coverage, such as workers' compensation, business-owner policies, cyber security protection, and commercial auto, as well as health and benefits coverage, including health, dental, vision, and life. It markets and sells its services primarily through its direct sales force. The company was founded in 1971 and is headquartered in Rochester, New York.","Stock Sentiment":"Strong Sell","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Cintas Corporation","Symbol":"CTAS","Current Price":"204.39","Latest MA":"196.65","Price Target":"214.15","Difference from MA":"3.93%","Difference from Open":"-1.62%","Change from Yesterday":"-1.91%","Change from Last Report":"0.00","Latest Volume":"3,481,758","Market Cap":"82,430,287,872","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":43.719692,"ROE":0.40462002,"DTE":70.573,"Industry":"Specialty Business Services","Sector":"Industrials","Beta":1.313,"Trailing PEG":4.3052,"Trailing PE":51.483627,"Trailing PS":8.4493,"Quick Ratio":0.703,"Day High":210.31,"Day Low":204.31,"VS Average Volume":2.3477485132,"Company Summary":"Cintas Corporation engages in the provision of corporate identity uniforms and related business services primarily in the United States, Canada, and Latin America. It operates through Uniform Rental and Facility Services, First Aid and Safety Services, and All Other segments. The company rents and services uniforms and other garments, including flame resistant clothing, mats, mops and shop towels, and other ancillary items; and provides restroom cleaning services and supplies, as well as sells uniforms. In addition, the company offers first aid and safety services, and fire protection products and services. It provides its products and services through its distribution network and local delivery routes, or local representatives to small service and manufacturing companies, as well as major corporations. The company was founded in 1968 and is based in Cincinnati, Ohio. Cintas Corporation was formerly a subsidiary of Cintas Corporation.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"CarMax Inc","Symbol":"KMX","Current Price":"81.42","Latest MA":"76.96","Price Target":"82.86","Difference from MA":"5.79%","Difference from Open":"-3.28%","Change from Yesterday":"-2.05%","Change from Last Report":"0.00","Latest Volume":"4,126,384","Market Cap":"12,613,911,552","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":21.942425,"ROE":0.06853,"DTE":314.637,"Industry":"Auto & Truck Dealerships","Sector":"Consumer Cyclical","Beta":1.686,"Trailing PEG":0.996,"Trailing PE":30.60902,"Trailing PS":0.45572028,"Quick Ratio":0.349,"Day High":84.66,"Day Low":81.22,"VS Average Volume":2.120105163,"Company Summary":"CarMax, Inc., through its subsidiaries, operates as a retailer of used vehicles and related products in the United States. It operates in two segments: CarMax Sales Operations and CarMax Auto Finance. The CarMax Sales Operations segment offers customers a range of makes and models of used vehicles, including domestic, imported, and luxury vehicles, as well as hybrid and electric vehicles; used vehicle auctions; extended protection plans to customers at the time of sale; and reconditioning and vehicle repair services. The CarMax Auto Finance segment provides financing alternatives for retail customers across a range of credit spectrum and arrangements with various financial institutions. The company was founded in 1993 and is based in Richmond, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"ABM Industries Incorporated","Symbol":"ABM","Current Price":"50.32","Latest MA":"52.67","Price Target":"58.40","Difference from MA":"-4.46%","Difference from Open":"1.19%","Change from Yesterday":"-8.36%","Change from Last Report":"0.00","Latest Volume":"996,293","Market Cap":"3,159,658,240","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.383078,"ROE":0.08438,"DTE":79.531,"Industry":"Specialty Business Services","Sector":"Industrials","Beta":1.132,"Trailing PEG":null,"Trailing PE":39.3125,"Trailing PS":0.3818364,"Quick Ratio":1.253,"Day High":53.17,"Day Low":49.2142,"VS Average Volume":2.2704531367,"Company Summary":"ABM Industries Incorporated, through its subsidiaries, engages in the provision of integrated facility, infrastructure, and mobility solutions in the United States and internationally. It operates through Business & Industry, Manufacturing & Distribution, Education, Aviation, and Technical Solutions segments. The company offers janitorial, facilities engineering, and parking services for commercial real estate properties, including corporate offices for high tech clients, sports and entertainment venues, and traditional hospitals and non-acute healthcare facilities; provides vehicle maintenance and other services to rental car providers. It also offers integrated facility services, engineering, and other specialized services in various types of manufacturing, distribution, and data center facilities. In addition, the company delivers custodial and landscaping and grounds for public school districts, private schools, colleges, and universities. Further, it supports airlines and airports with services comprising passenger assistance, catering logistics, air cabin maintenance, and transportation services. Additionally, the company provides electric vehicle power design, installation, and maintenance, as well as microgrid systems installations. ABM Industries Incorporated was founded in 1909 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"FedEx Corporation","Symbol":"FDX","Current Price":"273.16","Latest MA":"277.15","Price Target":"311.19","Difference from MA":"-1.44%","Difference from Open":"-1.64%","Change from Yesterday":"-1.54%","Change from Last Report":"0.00","Latest Volume":"1,580,840","Market Cap":"66,739,273,728","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.784124,"ROE":0.1507,"DTE":"N\/A","Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":1.177,"Trailing PEG":1.115,"Trailing PE":16.861729,"Trailing PS":0.76194215,"Quick Ratio":1.152,"Day High":281.31,"Day Low":272.91,"VS Average Volume":0.8660461839,"Company Summary":"FedEx Corporation, together with its subsidiaries, provides transportation, e-commerce, and business services in the United States and internationally. It operates through FedEx Express, FedEx Ground, FedEx Freight, and FedEx Services segments. The FedEx Express segment offers express transportation, small-package ground delivery, and freight transportation services; and time-critical transportation services. The FedEx Ground segment provides small-package ground delivery services. The FedEx Freight segment offers less-than-truckload freight transportation services. The FedEx Services segment provides sales, marketing, information technology, communications, customer service, technical support, billing and collection, and back-office support services. In addition, the company offers supply chain management solutions; and air and ocean freight forwarding and cargo transportation, specialty transportation, customs brokerage, third party logistics and supply chain, and document and business solutions, as well as provides trade management tools and data. The company was founded in 1971 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Accenture plc","Symbol":"ACN","Current Price":"347.61","Latest MA":"332.73","Price Target":"389.33","Difference from MA":"4.47%","Difference from Open":"-2.71%","Change from Yesterday":"-2.71%","Change from Last Report":"0.00","Latest Volume":"2,661,244","Market Cap":"217,423,085,568","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":24.87639,"ROE":0.26674998,"DTE":14.127,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.245,"Trailing PEG":2.1785,"Trailing PE":30.385489,"Trailing PS":3.3503072,"Quick Ratio":0.984,"Day High":359.4,"Day Low":347.16,"VS Average Volume":1.0917238836,"Company Summary":"Accenture plc provides strategy and consulting, industry X, song, and technology and operation services in North America, Europe, the Middle East, Africa, and internationally. It offers systems integration and application management; security; intelligent platform; infrastructure; software engineering; data and AI; and automation services. The company also operates business processes; and designs, manufactures, and assembles automation equipment, robotics, and other commercial hardware products. It serves communications, media, and technology; banking and capital markets, and insurance; health and public service; consumer goods, retail, travel services; industrial; life science; chemicals, natural resources, energy, and utilities sectors. It has collaboration agreement with Kyoto University to advance learning, research, and innovation in human-centered  AI. The company was founded in 1951 and is based in Dublin, Ireland.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Lamb Weston Holdings, Inc.","Symbol":"LW","Current Price":"78.22","Latest MA":"73.36","Price Target":"83.25","Difference from MA":"6.63%","Difference from Open":"-3.48%","Change from Yesterday":"-4.98%","Change from Last Report":"0.00","Latest Volume":"4,008,403","Market Cap":"11,154,015,232","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.831508,"ROE":0.37015,"DTE":221.158,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.715,"Trailing PEG":2.6388,"Trailing PE":18.361502,"Trailing PS":1.7275906,"Quick Ratio":0.486,"Day High":81.748,"Day Low":77.89,"VS Average Volume":1.6347090343,"Company Summary":"Lamb Weston Holdings, Inc. engages in the production, distribution, and marketing of frozen potato products in the United States, Canada, Mexico, and internationally. It offers frozen potatoes, commercial ingredients, and appetizers under the Lamb Weston brand, as well as under various customer labels. The company also provides its products under its owned or licensed brands, such as Grown in Idaho and Alexia, and other licensed brands, as well as under retailers' own brands. It sells its products through a network of internal sales personnel and independent brokers, agents, and distributors to quick service and full-service restaurants and chains, wholesale, grocery, mass merchants, club retailers, and specialty retailers, as well as foodservice distributors and institutions, including businesses, educational institutions, independent restaurants, regional chain restaurants, and convenience stores. The company was incorporated in 1950 and is headquartered in Eagle, Idaho.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Nike, Inc.","Symbol":"NKE","Current Price":"76.90","Latest MA":"81.00","Price Target":"88.53","Difference from MA":"-5.06%","Difference from Open":"-1.38%","Change from Yesterday":"-1.41%","Change from Last Report":"0.00","Latest Volume":"14,184,187","Market Cap":"114,465,652,736","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.834412,"ROE":0.3798,"DTE":86.962,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.035,"Trailing PEG":3.9321,"Trailing PE":22.034384,"Trailing PS":2.2887638,"Quick Ratio":1.417,"Day High":79.0,"Day Low":76.8499,"VS Average Volume":1.1745107532,"Company Summary":"NIKE, Inc., together with its subsidiaries, engages in the design, development, marketing, and sale of athletic footwear, apparel, equipment, accessories, and services worldwide. The company provides athletic and casual footwear, apparel, and accessories under the NIKE, Jumpman, Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also sells a line of performance equipment and accessories comprising bags, sport balls, socks, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. In addition, the company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel; licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks; and operates digital platforms, including fitness and activity apps; sport, fitness, and wellness content; and digital services and features in retail stores. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was founded in 1964 and is headquartered in Beaverton, Oregon.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Darden Restaurants, Inc.","Symbol":"DRI","Current Price":"159.87","Latest MA":"154.99","Price Target":"183.37","Difference from MA":"3.15%","Difference from Open":"-3.10%","Change from Yesterday":"-3.38%","Change from Last Report":"0.00","Latest Volume":"2,656,437","Market Cap":"18,784,724,992","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.145558,"ROE":0.48619,"DTE":326.282,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.309,"Trailing PEG":1.6959,"Trailing PE":18.46074,"Trailing PS":1.6454158,"Quick Ratio":0.108,"Day High":165.99,"Day Low":159.67,"VS Average Volume":2.203720157,"Company Summary":"Darden Restaurants, Inc., together with its subsidiaries, owns and operates full-service restaurants in the United States and Canada. It operates under Olive Garden, LongHorn Steakhouse, Cheddar's Scratch Kitchen, Yard House, The Capital Grille, Seasons 52, Bahama Breeze, Eddie V's Prime Seafood, and Capital Burger brand names. Darden Restaurants, Inc. was incorporated in 1995 and is based in Orlando, Florida.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"ConAgra Brands, Inc.","Symbol":"CAG","Current Price":"27.37","Latest MA":"29.23","Price Target":"30.60","Difference from MA":"-6.37%","Difference from Open":"-0.51%","Change from Yesterday":"-1.83%","Change from Last Report":"0.00","Latest Volume":"6,563,778","Market Cap":"13,062,962,176","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.247214,"ROE":0.05605,"DTE":100.881,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.332,"Trailing PEG":0.3285,"Trailing PE":26.833334,"Trailing PS":1.0938855,"Quick Ratio":0.291,"Day High":27.75,"Day Low":27.25,"VS Average Volume":1.274433388,"Company Summary":"Conagra Brands, Inc., together with its subsidiaries, operates as a consumer packaged goods food company primarily in the United States. The company operates through four segments: Grocery & Snacks, Refrigerated & Frozen, International, and Foodservice. The Grocery & Snacks segment primarily offers shelf stable food products through various retail channels. The Refrigerated & Frozen segment provides temperature-controlled food products through various retail channels. The International segment offers food products in various temperature states through retail and foodservice channels outside of the United States. The Foodservice segment offers branded and customized food products, including meals, entrees, sauces, and various custom-manufactured culinary products packaged for restaurants and other foodservice establishments. The company sells its products under the Birds Eye, Marie Callender's, Duncan Hines, Healthy Choice, Slim Jim, Reddi-wip, Angie's, BOOMCHICKAPOP brands. The company was incorporated in 1919 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Birkenstock Holding plc","Symbol":"BIRK","Current Price":"57.16","Latest MA":"52.74","Price Target":"66.04","Difference from MA":"8.38%","Difference from Open":"-6.20%","Change from Yesterday":"1.96%","Change from Last Report":"0.00","Latest Volume":"5,585,742","Market Cap":"10,736,305,152","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":25.899529,"ROE":0.04422,"DTE":57.584,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":null,"Trailing PE":53.42056,"Trailing PS":6.2294736,"Quick Ratio":1.413,"Day High":62.4,"Day Low":56.545,"VS Average Volume":4.8538789811,"Company Summary":"Birkenstock Holding plc manufactures and sells footwear products. It also offers sandals, shoes, closed-toe silhouettes, skincare products, and accessories. The company sells its products through e-commerce sites and a network of owned retail stores, as well as business-to-business channels. It operates in the United States, Brazil, Canada, Mexico, Europe, APMA, and internationally. Birkenstock Holding plc was founded in 1774 and is based in London, the United Kingdom. Birkenstock Holding plc operates as a subsidiary of BK LC Lux MidCo S.à r.l.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"FactSet Research Systems Inc.","Symbol":"FDS","Current Price":"473.05","Latest MA":"440.10","Price Target":"475.44","Difference from MA":"7.49%","Difference from Open":"-3.13%","Change from Yesterday":"-3.22%","Change from Last Report":"0.00","Latest Volume":"616,541","Market Cap":"17,970,601,984","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":25.36355,"ROE":0.30411,"DTE":82.338,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":0.752,"Trailing PEG":2.6019,"Trailing PE":34.007908,"Trailing PS":8.157124,"Quick Ratio":1.08,"Day High":494.249,"Day Low":472.35,"VS Average Volume":2.5511161684,"Company Summary":"FactSet Research Systems Inc., together with its subsidiaries, operates as a financial digital platform and enterprise solutions provider for the investment community worldwide. The company provides workstations, portfolio analytics, and enterprise data solutions, as well as managed services for supporting data, performance, risk, and reporting workflows. It offers subscription-based financial data and market intelligence on securities, companies, industries, and people that enable clients to research investment ideas, as well as analyze, monitor, and manage their portfolios. The company provides its services through its configurable desktop and mobile platform, data feeds, cloud-based digital solutions, and application programming interfaces. It serves investment professionals, including institutional asset managers, bankers, wealth managers, asset owners, partners, hedge funds, corporate users, and private equity and venture capital professionals. The company was founded in 1978 and is headquartered in Norwalk, Connecticut.","Stock Sentiment":"Strong Sell","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Micron Technology, Inc.","Symbol":"MU","Current Price":"103.90","Latest MA":"110.04","Price Target":"146.68","Difference from MA":"-5.58%","Difference from Open":"-5.67%","Change from Yesterday":"-4.33%","Change from Last Report":"0.00","Latest Volume":"55,113,760","Market Cap":"115,748,765,696","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.095192,"ROE":0.01743,"DTE":31.194,"Industry":"Semiconductors","Sector":"Technology","Beta":1.179,"Trailing PEG":0.166,"Trailing PE":29.770775,"Trailing PS":4.6094847,"Quick Ratio":1.592,"Day High":112.03,"Day Low":102.74,"VS Average Volume":2.5428445379,"Company Summary":"Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Mainland China, rest of the Asia Pacific, Hong Kong, Japan, Europe, and internationally. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Embedded Business Unit, and Storage Business Unit. It provides memory and storage technologies comprising dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; non-volatile and re-writeable semiconductor storage devices; and non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers serves the data center, PC, graphics, networking, automotive, industrial, and consumer embedded markets, as well as for smartphone and other mobile-device markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Lennar Corporation","Symbol":"LEN","Current Price":"145.93","Latest MA":"168.79","Price Target":"192.40","Difference from MA":"-13.54%","Difference from Open":"-3.66%","Change from Yesterday":"-3.66%","Change from Last Report":"0.00","Latest Volume":"3,787,761","Market Cap":"39,369,285,632","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.957133,"ROE":0.15878001,"DTE":14.665,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.619,"Trailing PEG":1.065,"Trailing PE":10.190642,"Trailing PS":1.0797125,"Quick Ratio":3.257,"Day High":152.99,"Day Low":145.65,"VS Average Volume":1.8850058923,"Company Summary":"Lennar Corporation, together with its subsidiaries, operates as a homebuilder primarily under the Lennar brand in the United States. It operates through Homebuilding East, Homebuilding Central, Homebuilding Texas, Homebuilding West, Financial Services, Multifamily, and Lennar Other segments. The company's homebuilding operations include the construction and sale of single-family attached and detached homes, as well as the purchase, development, and sale of residential land; and development, construction, and management of multifamily rental properties. It also offers residential mortgage financing, title, insurance, and closing services for home buyers and others, as well as originates and sells securitization commercial mortgage loans. In addition, the company is involved in the fund investment activity. It primarily serves first-time, move-up, active adult, and luxury homebuyers. Lennar Corporation was founded in 1954 and is based in Miami, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"General Mills, Inc.","Symbol":"GIS","Current Price":"63.91","Latest MA":"67.73","Price Target":"73.00","Difference from MA":"-5.64%","Difference from Open":"1.28%","Change from Yesterday":"-3.06%","Change from Last Report":"0.00","Latest Volume":"9,972,385","Market Cap":"35,291,103,232","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.733896,"ROE":0.24168,"DTE":139.823,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.107,"Trailing PEG":3.2574,"Trailing PE":13.893478,"Trailing PS":1.7823249,"Quick Ratio":0.317,"Day High":64.625,"Day Low":62.81,"VS Average Volume":2.6622424923,"Company Summary":"General Mills, Inc. manufactures and markets branded consumer foods worldwide. The company operates through four segments: North America Retail; International; Pet; and North America Foodservice. It offers grain, ready-to-eat cereals, refrigerated yogurt, soup, meal kits, refrigerated and frozen dough products, dessert and baking mixes, bakery flour, frozen pizza and pizza snacks, snack bars, fruit and savory snacks, ice cream and frozen desserts, unbaked and fully baked frozen dough products, frozen hot snacks, ethnic meals, side dish mixes, frozen breakfast and entrees, nutrition bars, and frozen and shelf-stable vegetables. The company also manufactures and markets pet food products, including dog and cat food; and operates ice cream parlors. It markets its products under the Annie's, Betty Crocker, Bisquick, Blue Buffalo, Bugles, Cascadian Farm, Cheerios, Chex, Cinnamon Toast Crunch, Cocoa Puffs, Cookie Crisp, Dunkaroos, Edgard & Cooper, Fiber One, Fruit by the Foot, Fruit Gushers, Fruit Roll-Ups, Gardetto's, Gold Medal, Golden Grahams, Häagen-Dazs, Kitano, Kix, Lärabar, Latina, Lucky Charms, Muir Glen, Nature Valley, Nudges, Oatmeal Crisp, Old El Paso, Pillsbury, Progresso, Tastefuls, Total, Totino's , Trix, True Chews, True Solutions, Wanchai Ferry, Wheaties, Wilderness, and Yoki brands. The company sells its products to grocery stores, mass merchandisers, membership stores, natural food chains, drug, dollar and discount chains, e-commerce retailers, commercial and noncommercial foodservice distributors and operators, restaurants, convenience stores, and pet specialty stores. General Mills, Inc. was founded in 1866 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Heico Corporation","Symbol":"HEI","Current Price":"237.24","Latest MA":"245.42","Price Target":"275.93","Difference from MA":"-3.33%","Difference from Open":"-5.27%","Change from Yesterday":"-8.68%","Change from Last Report":"0.00","Latest Volume":"2,046,116","Market Cap":"28,488,728,576","Earning Date":"2024-12-17","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":48.347458,"ROE":0.14435,"DTE":57.539,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.237,"Trailing PEG":3.4984,"Trailing PE":64.46739,"Trailing PS":7.5358014,"Quick Ratio":1.355,"Day High":252.8322,"Day Low":232.89,"VS Average Volume":4.9584781292,"Company Summary":"HEICO Corporation, through its subsidiaries, designs, manufactures, and sells aerospace, defense, and electronic related products and services in the United States and internationally. Its Flight Support Group segment provides jet engine and aircraft component replacement parts; thermal insulation blankets and parts; renewable\/reusable insulation systems; and specialty components. This segment also distributes hydraulic, pneumatic, structural, interconnect, mechanical, and electro-mechanical components for the commercial, regional, and general aviation markets; and offers repair and overhaul services for jet engine and aircraft component parts, avionics, instruments, composites, and flight surfaces of commercial aircraft, as well as for avionics and navigation systems, and other instruments utilized on military aircraft. The company's Electronic Technologies Group segment provides electro-optical infrared simulation and test equipment; electro-optical laser products; electro-optical, microwave, and other power equipment; electromagnetic and radio frequency (RF) interference shielding and suppression filters; power conversion and interface; interconnection devices; and underwater locator beacons and emergency locator transmission beacons. This segment also offers traveling wave tube amplifiers and microwave power modules; memory products and specialty semiconductors; harsh environment connectivity products and custom molded cable assemblies; RF and microwave products; communications and electronic intercept receivers and tuners; self-sealing auxiliary fuel systems; active antenna systems and airborne antennas; nuclear radiation detectors; silicone products; power amplifiers; ceramic-to-metal feedthroughs and connectors; technical surveillance countermeasures equipment; RF receivers and sources; embedded computing solutions; test sockets and adapters; and radiation assurance services. The company was incorporated in 1957 and is headquartered in Hollywood, Florida.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Toro Company (The)","Symbol":"TTC","Current Price":"81.44","Latest MA":"87.38","Price Target":"99.50","Difference from MA":"-6.80%","Difference from Open":"0.92%","Change from Yesterday":"-4.54%","Change from Last Report":"0.00","Latest Volume":"2,414,832","Market Cap":"8,240,424,960","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":16.613628,"ROE":0.2565,"DTE":67.875,"Industry":"Tools & Accessories","Sector":"Industrials","Beta":0.694,"Trailing PEG":null,"Trailing PE":20.309227,"Trailing PS":1.8348753,"Quick Ratio":0.765,"Day High":85.1,"Day Low":80.5,"VS Average Volume":3.298612847,"Company Summary":"The Toro Company designs, manufactures, markets, and sells professional turf maintenance equipment and services. It operates through two segments: Professional and Residential. The Professional segment offers turf and landscape equipment products, including sports fields and grounds mowing and maintenance equipment, golf course mowing and maintenance equipment, landscape contractor mowing equipment, landscape creation and renovation equipment, and other maintenance equipment; rental, specialty, and underground construction equipment, such as horizontal directional drills, walk and ride trenchers, stand-on skid steers, vacuum excavators, stump grinders, turf renovation products, asset locators, pipe rehabilitation solutions, materials handling equipment, and other after-market tools; and snow and ice management equipment, such as snowplows, as well as stand-on snow and ice removal equipment, such as snowplow, snow brush, and snow thrower attachments, salt and sand spreaders, and related parts and accessories for light and medium duty trucks, utility task vehicles, skid steers, and front-end loaders. This segment also provides irrigation and lighting products that consist of sprinkler heads, electric and hydraulic valves, controllers, computer irrigation central control systems, coupling systems, and ag-irrigation drip tape and hose products, as well as professionally installed landscape lighting products offered through distributors and landscape contractors. The Residential segment provides walk power mowers, zero-turn riding mowers, snow throwers, replacement parts, and home solution products that include grass and hedge trimmers, leaf blowers, blower-vacuums, chainsaws, string trimmers, hoses, and hose-end retail irrigation products. It sells its products through a network of distributors, dealers, mass retailers, hardware retailers, equipment rental centers, home centers, and online. The company was founded in 1914 and is headquartered in Bloomington, Minnesota.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Jabil Inc.","Symbol":"JBL","Current Price":"143.69","Latest MA":"117.90","Price Target":"149.25","Difference from MA":"21.88%","Difference from Open":"-3.02%","Change from Yesterday":"7.26%","Change from Last Report":"0.00","Latest Volume":"4,728,089","Market Cap":"16,049,167,360","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":14.313606,"ROE":0.60295,"DTE":207.887,"Industry":"Electronic Components","Sector":"Technology","Beta":1.245,"Trailing PEG":null,"Trailing PE":13.581285,"Trailing PS":0.5556614,"Quick Ratio":0.58,"Day High":150.0,"Day Low":141.0184,"VS Average Volume":3.6143324542,"Company Summary":"Jabil Inc. provides manufacturing services and solutions worldwide. It operates in two segments, Electronics Manufacturing Services and Diversified Manufacturing Services. The company offers electronics design, production, and product management services; electronic circuit design services, such as application-specific integrated circuit design, firmware development, and rapid prototyping services; and designs plastic and metal enclosures that include the electro-mechanics, such as the printed circuit board assemblies (PCBA). It also provides three-dimensional mechanical design comprising the analysis of electronic, electro-mechanical, and optical assemblies, as well as various industrial design, mechanism development, and tooling management services. In addition, the company provides computer-assisted design services consisting of PCBA design, as well as PCBA design validation and verification services; and other consulting services, such as the generation of a bill of materials, approved vendor list, and assembly equipment configuration for various PCBA designs. Further, it offers product and process validation services, such as product system, product safety, regulatory compliance, and reliability tests, as well as manufacturing test solution development services. Additionally, the company provides systems assembly, test, direct-order fulfillment, and configure-to-order services. It serves 5G, wireless and cloud, digital print and retail, industrial and semi-cap, networking and storage, automotive and transportation, connected devices, healthcare and packaging, and mobility industries. The company was formerly known as Jabil Circuit, Inc. and changed its name to Jabil Inc. in June 2017. Jabil Inc. was founded in 1966 and is headquartered in Saint Petersburg, Florida.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Ciena Corporation","Symbol":"CIEN","Current Price":"83.92","Latest MA":"58.07","Price Target":"87.93","Difference from MA":"44.51%","Difference from Open":"-5.93%","Change from Yesterday":"-4.79%","Change from Last Report":"0.00","Latest Volume":"2,712,320","Market Cap":"11,971,691,520","Earning Date":"2024-12-12","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":24.699278,"ROE":0.047319997,"DTE":55.23,"Industry":"Communication Equipment","Sector":"Technology","Beta":0.938,"Trailing PEG":null,"Trailing PE":144.68965,"Trailing PS":2.9777882,"Quick Ratio":2.511,"Day High":89.7,"Day Low":83.07,"VS Average Volume":1.2598630014,"Company Summary":"Ciena Corporation provides hardware and software services for delivery of video, data, and voice traffic metro, aggregation, and access communications network worldwide. The company's Networking Platforms segment offers convergence of coherent optical transport, open optical networking, optical transport network switching, IP routing, and switching services. Its products include 6500 Packet-Optical Platform, Waveserver stackable interconnect system, and the 6500 Reconfigurable line system, and the 5400 family of Packet-Optical platforms, as well as 8100 coherent routing platforms; 3000 family of service delivery switches and the 5000 family of service aggregation switches, as well as 8700 Packetwave Platform and 6500 Packet Transport System. This segment also sells operating system software and enhanced software features embedded in each of its products. The company's Blue Planet Automation Software and Services segment provides multi-domain service orchestration, inventory, route optimization and analysis, multi-cloud orchestration, and unified assurance and analytics services. Its Platform Software and Service segment offers MCP domain controller solution, and OneControl unified management system, as well as planning tools. The company's Global Services segment provides maintenance support and training, installation and deployment, and consulting and network design services. Ciena Corporation was incorporated in 1992 and is headquartered in Hanover, Maryland.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Broadcom Inc.","Symbol":"AVGO","Current Price":"223.62","Latest MA":"164.49","Price Target":"238.81","Difference from MA":"35.94%","Difference from Open":"-6.65%","Change from Yesterday":"-6.91%","Change from Last Report":"0.00","Latest Volume":"51,500,368","Market Cap":"1,044,435,107,840","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":29.483503,"ROE":0.12509,"DTE":166.032,"Industry":"Semiconductors","Sector":"Technology","Beta":1.187,"Trailing PEG":0.6364,"Trailing PE":172.01538,"Trailing PS":22.30984,"Quick Ratio":0.841,"Day High":239.65,"Day Low":219.22,"VS Average Volume":2.0025015927,"Company Summary":"Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides set-top box system-on-chips (SoCs); cable, digital subscriber line, and passive optical networking central office\/consumer premise equipment SoCs; wireless local area network access point SoCs; Ethernet switching and routing custom silicon solutions; serializer\/deserializer application specific integrated circuits; optical and copper, and physical layer devices; and fiber optic components and RF semiconductor devices. The company also offers RF front end modules and filter; Wi-Fi, Bluetooth, and global positioning system\/global navigation satellite system SoCs; custom touch controllers; inductive charging; attached small computer system interface, and redundant array of independent disks controllers and adapters; peripheral component interconnect express; fiber channel host bus adapters; read channel based SoCs; custom flash controllers; preamplifiers; optocouplers, industrial fiber optics, and motion control encoders and subsystems; light emitting diode, ethernet PHYs, switch ICs, and camera microcontrollers. Its products are used in various applications, including enterprise and data center networking, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was founded in 1961 and is headquartered in Palo Alto, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Adobe Inc.","Symbol":"ADBE","Current Price":"441.31","Latest MA":"519.06","Price Target":"588.34","Difference from MA":"-14.98%","Difference from Open":"-2.48%","Change from Yesterday":"-3.06%","Change from Last Report":"0.00","Latest Volume":"6,316,707","Market Cap":"194,264,662,016","Earning Date":"2024-12-11","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":19.138039,"ROE":0.35355,"DTE":41.788,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.299,"Trailing PEG":1.4434,"Trailing PE":35.704693,"Trailing PS":9.274104,"Quick Ratio":0.966,"Day High":455.25,"Day Low":441.1,"VS Average Volume":1.904896417,"Company Summary":"Adobe Inc., together with its subsidiaries, operates as a diversified software company worldwide. It operates through three segments: Digital Media, Digital Experience, and Publishing and Advertising. The Digital Media segment offers products, services, and solutions that enable individuals, teams, and enterprises to create, publish, and promote content; and Document Cloud, a unified cloud-based document services platform. Its flagship product is Creative Cloud, a subscription service that allows members to access its creative products. This segment serves content creators, students, workers, marketers, educators, enthusiasts, and communicators. The Digital Experience segment provides an integrated platform and set of applications and services that enable brands and businesses to create, manage, execute, measure, monetize, and optimize customer experiences from analytics to commerce. This segment serves marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers, and executives across the C-suite. The Publishing and Advertising segment offers products and services, such as e-learning solutions, technical document publishing, web conferencing, document and forms platform, web application development, and high-end printing, as well as Advertising Cloud offerings. It also provides consulting, technical support, and learning services. The company offers its products and services directly to enterprise customers through its sales force and local field offices, as well as to end users through app stores and through its website at adobe.com. It also distributes products and services through distributors, value-added resellers, systems integrators, software vendors and developers, retailers, and original equipment manufacturers. The company was formerly known as Adobe Systems Incorporated and changed its name to Adobe Inc. in October 2018. Adobe Inc. was founded in 1982 and is headquartered in San Jose, California.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Costco Wholesale Corporation","Symbol":"COST","Current Price":"964.74","Latest MA":"880.97","Price Target":"1,033.60","Difference from MA":"9.51%","Difference from Open":"-1.76%","Change from Yesterday":"-1.77%","Change from Last Report":"0.00","Latest Volume":"2,631,236","Market Cap":"428,288,606,208","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":48.264027,"ROE":0.30267,"DTE":42.118,"Industry":"Discount Stores","Sector":"Consumer Defensive","Beta":0.789,"Trailing PEG":5.8863,"Trailing PE":56.816254,"Trailing PS":1.6831737,"Quick Ratio":0.391,"Day High":985.6,"Day Low":964.03,"VS Average Volume":1.382379318,"Company Summary":"Costco Wholesale Corporation, together with its subsidiaries, engages in the operation of membership warehouses in the United States, Puerto Rico, Canada, Mexico, Japan, the United Kingdom, Korea, Australia, Taiwan, China, Spain, France, Iceland, New Zealand, and Sweden. The company offers branded and private-label products in a range of merchandise categories. It offers merchandise, such as sundries, dry groceries, candies, coolers, freezers, deli, liquor, and tobacco; appliances, electronics, health and beauty aids, hardware, lawn and garden, sporting goods, tires, toys and seasonal products, office supplies, automotive care products, postages, tickets, apparel, small appliances, furniture, domestics, housewares, special order kiosks, and jewelry; and meat, produce, service deli, and bakery products. The company also operates gasoline, pharmacies, optical, food courts, hearing-aid centers, and tire installation centers; and offers business delivery, travel, grocery, and various other services online. It also operates e-commerce websites. The company was formerly known as Costco Companies, Inc. and changed its name to Costco Wholesale Corporation in August 1999. Costco Wholesale Corporation was founded in 1976 and is based in Issaquah, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Nordson Corporation","Symbol":"NDSN","Current Price":"212.79","Latest MA":"245.28","Price Target":"259.17","Difference from MA":"-13.24%","Difference from Open":"-5.18%","Change from Yesterday":"-5.01%","Change from Last Report":"0.00","Latest Volume":"524,620","Market Cap":"12,167,651,328","Earning Date":"2024-12-11","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":19.897255,"ROE":0.17406,"DTE":56.526,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":0.907,"Trailing PEG":1.6922,"Trailing PE":26.237978,"Trailing PS":4.5661473,"Quick Ratio":1.358,"Day High":226.47,"Day Low":212.33,"VS Average Volume":2.065099728,"Company Summary":"Nordson Corporation engineers, manufactures, and markets products and systems to dispense, apply, and control adhesives, coatings, polymers, sealants, biomaterials, and other fluids worldwide. It operates through three segments: Industrial Precision Solutions; Medical and Fluid Solutions; and Advanced Technology Solutions. The Industrial Precision Solutions segment provides dispensing, coating, and laminating systems for adhesives, lotions, liquids, and fibers to disposable products and roll goods; automated adhesive dispensing systems used in packaged goods industries; components and systems used in the thermoplastic and biopolymer melt stream; precision agriculture spraying solutions; fluid components, such as nozzles, pumps, and filters; and product assembly systems for use in paper and paperboard converting applications, and manufacturing roll goods. It also offers automated and manual dispensing products and systems for cold materials, container coating, liquid finishing, and powder coating, as well as ultraviolet equipment used primarily in curing and drying operations. The Medical and Fluid Solutions segment offers medical devices, including cannulas, catheters, and medical balloons; single-use plastic components; precision manual and semi-automated dispensers; minimally invasive interventional delivery devices; and plastic molded syringes, cartridges, tips, and fluid connection components. The Advanced Technology Solutions segment provides automated dispensing systems for the attachment, protection, and coating of fluids, as well as related gas plasma treatment systems for cleaning and conditioning surfaces; and bond testing and automated optical, acoustic microscopy, and x-ray inspection systems for use in semiconductor and printed circuit board industries. The company markets its products through direct sales force, as well as distributors and sales representatives. Nordson Corporation was founded in 1909 and is headquartered in Westlake, Ohio.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Ollie's Bargain Outlet Holdings","Symbol":"OLLI","Current Price":"114.49","Latest MA":"94.57","Price Target":"124.47","Difference from MA":"21.07%","Difference from Open":"-3.11%","Change from Yesterday":"-0.39%","Change from Last Report":"0.00","Latest Volume":"1,489,469","Market Cap":"7,015,591,936","Earning Date":"2024-12-10","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":30.38264,"ROE":0.13548,"DTE":31.499,"Industry":"Discount Stores","Sector":"Consumer Defensive","Beta":0.844,"Trailing PEG":null,"Trailing PE":34.17612,"Trailing PS":3.1656065,"Quick Ratio":1.19,"Day High":118.47,"Day Low":114.0,"VS Average Volume":1.3603164731,"Company Summary":"Ollie's Bargain Outlet Holdings, Inc. operates as a retailer of brand name merchandise in the United States. The company offers housewares, bed and bath, food, floor coverings, health and beauty aids, books and stationery, toys, and electronics; and other products, including hardware, candy, clothing, sporting goods, pet and lawn, and garden products. It provides its products primarily under the Ollie's, Ollie's Bargain Outlet, Good Stuff Cheap, Ollie's Army, Real Brands Real Cheap!, Real Brands! Real Bargains, Sarasota Breeze, Steelton Tools, American Way, and Middleton Home names. The company was formerly known as Bargain Holdings, Inc. and changed its name to Ollie's Bargain Outlet Holdings, Inc. in March 2015. The company was founded in 1982 and is headquartered in Harrisburg, Pennsylvania.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Ferguson Enterprises Inc.","Symbol":"FERG","Current Price":"177.48","Latest MA":"201.69","Price Target":"226.18","Difference from MA":"-12.01%","Difference from Open":"-4.88%","Change from Yesterday":"-4.09%","Change from Last Report":"0.00","Latest Volume":"1,390,210","Market Cap":"35,617,751,040","Earning Date":"2024-12-10","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.501509,"ROE":0.32573003,"DTE":98.237,"Industry":"Industrial Distribution","Sector":"Industrials","Beta":1.2,"Trailing PEG":1.4837,"Trailing PE":21.331732,"Trailing PS":1.2018813,"Quick Ratio":0.8,"Day High":187.07,"Day Low":177.45,"VS Average Volume":0.8139045417,"Company Summary":"Ferguson Enterprises Inc. distributes plumbing and heating products in the United States and Canada. The company provides expertise, solutions, and products, including infrastructure, plumbing, appliances, fire, and fabrication, as well as heating, ventilation, and air conditioning (HVAC) to residential and non-residential customers. It also supplies specialist water and wastewater treatment products to residential, commercial, and infrastructure contractors, as well as supplies pipe, valves, and fittings solutions to industrial customers. In addition, it offers customized solutions, such as virtual design, fabrication, valve actuation, pre-assembly, kitting, installation, and project management services, as well as after-sales support that comprises warranty, credit, project-based billing, returns and maintenance, and repair and operations support. The company sells its products through a network of distribution centers, branches, counter service and specialist sales associates, showroom consultants, and e-commerce channels. Ferguson Enterprises Inc. was founded in 1953 and is headquartered in Newport News, Virginia.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"GMS Inc.","Symbol":"GMS","Current Price":"86.29","Latest MA":"91.15","Price Target":"100.11","Difference from MA":"-5.33%","Difference from Open":"-3.57%","Change from Yesterday":"-3.06%","Change from Last Report":"0.00","Latest Volume":"621,025","Market Cap":"3,349,389,568","Earning Date":"2024-12-05","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.610592,"ROE":0.1745,"DTE":113.844,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.679,"Trailing PEG":null,"Trailing PE":15.804029,"Trailing PS":0.6044997,"Quick Ratio":1.391,"Day High":90.4,"Day Low":85.595,"VS Average Volume":1.5400954275,"Company Summary":"GMS Inc. distributes wallboard, ceilings, steel framing and complementary construction products in the United States and Canada. The company offers ceilings products, including suspended mineral fibers, soft fibers, and metal ceiling systems primarily used in offices, hotels, hospitals, retail facilities, schools, and various other commercial and institutional buildings. It also provides steel framing products, such as steel tracks, studs, and various other steel products used to frame the interior walls of a commercial or institutional building, as well as ancillary products comprising tools, fasteners, insulation, EIFS and stucco, lumber and other wood products, ready-mix joint compound, and safety products. In addition, the company distributes a wallboard, ceilings, steel framing, and construction products, as well as commercial and residential building materials. It also operates through tool sales, rental, and service centers, as well as network of distribution centers. The company serves professional contractors and homebuilders. GMS Inc. was founded in 1971 and is headquartered in Tucker, Georgia.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Oracle Corporation","Symbol":"ORCL","Current Price":"165.41","Latest MA":"154.24","Price Target":"199.38","Difference from MA":"7.24%","Difference from Open":"-2.36%","Change from Yesterday":"-2.53%","Change from Last Report":"0.00","Latest Volume":"6,489,329","Market Cap":"462,645,166,080","Earning Date":"2024-12-09","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":23.457853,"ROE":1.55578,"DTE":749.978,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.013,"Trailing PEG":1.7783,"Trailing PE":40.442543,"Trailing PS":8.596955,"Quick Ratio":0.591,"Day High":171.23,"Day Low":165.36,"VS Average Volume":0.8329679148,"Company Summary":"Oracle Corporation offers products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning (ERP), Oracle Fusion cloud enterprise performance management, Oracle Fusion cloud supply chain and manufacturing management, Oracle Fusion cloud human capital management, Oracle Cerner healthcare, and NetSuite applications suite, as well as Oracle Fusion Sales, Service, and Marketing. The company also offers cloud-based industry solutions for various industries; Oracle application licenses; and Oracle license support services. In addition, it provides cloud and license business' infrastructure technologies, such as the Oracle Database and MySQL Database; Java, a software development language; and middleware, including development tools and others. The company's cloud and license business' infrastructure technologies also comprise cloud-based compute, storage, and networking capabilities; and Oracle autonomous database and MySQL HeatWave, as well as Internet-of-Things, digital assistant, and blockchain. Further, it provides hardware products and other hardware-related software offerings, including Oracle engineered systems, enterprise servers, storage solutions, industry-specific hardware, virtualization software, operating systems, management software, and related hardware services, as well as hardware support products; and consulting and customer services. The company markets and sells its cloud, license, hardware, support, and services offerings directly to businesses in various industries, government agencies, and educational institutions, as well as through indirect channels. Oracle Corporation was founded in 1977 and is headquartered in Austin, Texas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Toll Brothers, Inc.","Symbol":"TOL","Current Price":"125.72","Latest MA":"138.32","Price Target":"161.71","Difference from MA":"-9.11%","Difference from Open":"-5.47%","Change from Yesterday":"-5.28%","Change from Last Report":"0.00","Latest Volume":"2,780,423","Market Cap":"12,545,347,584","Earning Date":"2024-12-09","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":7.8752093,"ROE":0.21799,"DTE":39.692,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.671,"Trailing PEG":1.0205,"Trailing PE":8.37575,"Trailing PS":1.1910037,"Quick Ratio":0.389,"Day High":133.4,"Day Low":125.12,"VS Average Volume":2.1807358942,"Company Summary":"Toll Brothers, Inc., together with its subsidiaries, designs, builds, markets, sells, and arranges finance for a range of detached and attached homes in luxury residential communities in the United States. It designs, builds, markets, and sells condominiums through Toll Brothers City Living. The company also develops a range of single-story living and first-floor primary bedroom suite home designs, as well as communities with recreational amenities, such as golf courses, marinas, pool complexes, country clubs, and fitness and recreation centers; and develops, operates, and rents apartments. In addition, it provides various interior fit-out options, such as flooring, wall tile, plumbing, cabinets, fixtures, appliances, lighting, and home-automation and security technologies. Further, the company owns and operates architectural, engineering, mortgage, title, land development, insurance, smart home technology, landscaping, lumber distribution, house component assembly, and component manufacturing operations. It serves luxury first-time, move-up, empty-nester, active-adult, and second-home buyers. Toll Brothers, Inc. was founded in 1967 and is headquartered in Fort Washington, Pennsylvania.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"MongoDB, Inc.","Symbol":"MDB","Current Price":"252.67","Latest MA":"272.64","Price Target":"379.52","Difference from MA":"-7.32%","Difference from Open":"-4.54%","Change from Yesterday":"-4.69%","Change from Last Report":"0.00","Latest Volume":"2,533,027","Market Cap":"18,816,485,376","Earning Date":"2024-12-09","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":75.81358,"ROE":-0.19561,"DTE":89.869,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.153,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":10.340944,"Quick Ratio":4.76,"Day High":265.1,"Day Low":249.11,"VS Average Volume":1.5021042875,"Company Summary":"MongoDB, Inc., together with its subsidiaries, provides general purpose database platform worldwide. The company provides MongoDB Atlas, a hosted multi-cloud database-as-a-service solution; MongoDB Enterprise Advanced, a commercial database server for enterprise customers to run in the cloud, on-premises, or in a hybrid environment; and Community Server, a free-to-download version of its database, which includes the functionality that developers need to get started with MongoDB. It offers professional services comprising consulting and training. The company was formerly known as 10gen, Inc. and changed its name to MongoDB, Inc. in August 2013. MongoDB, Inc. was incorporated in 2007 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"The Cooper Companies, Inc.","Symbol":"COO","Current Price":"92.39","Latest MA":"98.71","Price Target":"115.57","Difference from MA":"-6.40%","Difference from Open":"-2.16%","Change from Yesterday":"-2.22%","Change from Last Report":"0.00","Latest Volume":"1,475,720","Market Cap":"18,439,473,152","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":20.824505,"ROE":0.0465,"DTE":36.711,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":0.99,"Trailing PEG":9.6687,"Trailing PE":47.137753,"Trailing PS":4.847263,"Quick Ratio":0.875,"Day High":94.92,"Day Low":92.27,"VS Average Volume":1.1228865791,"Company Summary":"The Cooper Companies, Inc., together with its subsidiaries, develops, manufactures, and markets contact lens wearers. The company operates in two segments, CooperVision and CooperSurgical. The CooperVision segment provides spherical lense, including lenses that correct near and farsightedness; and toric and multifocal lenses comprising lenses correcting vision challenges, such as astigmatism, presbyopia, and myopia in the Americas, Europe, Middle East, Africa, and Asia Pacific. The CooperSurgical segment focuses on family and women's health care, which provides fertility products and services, medical devices, and contraception, as well as cryostorage, such as cord blood and cord tissue storage to health care professionals and patients worldwide. It offers surgical and office products, including endosee endometrial imaging products, fetal pillow cephalic elevation devices for use in cesarean sections, illuminated speculum products, lone star retractor systems, loop electrosurgical excision procedure products, mara water ablation systems, paragard contraceptive IUDs, point-of-care, and uterine positioning products, as well as cryostorage, such as cord blood and cord tissue storage; fertility products and services, such as fertility consumables and equipment, donor gamete services, and genomic services, including genetic testing. The company sells its products to distributors, group purchasing organizations, eye care and health care professionals, including independent practices, corporate retailers, hospitals and clinics, and authorized resellers. The Cooper Companies, Inc. was founded in 1958 and is headquartered in San Ramon, California.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Science Applications Internatio","Symbol":"SAIC","Current Price":"111.12","Latest MA":"128.65","Price Target":"137.11","Difference from MA":"-13.63%","Difference from Open":"-2.92%","Change from Yesterday":"-2.85%","Change from Last Report":"0.00","Latest Volume":"701,593","Market Cap":"5,431,712,256","Earning Date":"2024-12-05","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.274967,"ROE":0.16724001,"DTE":143.077,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.693,"Trailing PEG":null,"Trailing PE":18.707071,"Trailing PS":0.74437606,"Quick Ratio":0.769,"Day High":114.95,"Day Low":110.65,"VS Average Volume":1.6780908417,"Company Summary":"Science Applications International Corporation provides technical, engineering, and enterprise information technology (IT) services primarily in the United States. The company's offerings include IT modernization; digital engineering; artificial intelligence; Weapon systems support design, build, modify, integrate, and sustain weapon systems; and end-to-end services, such as design, development, integration, deployment, management and operations, sustainment, and security of its customers' IT infrastructure, as well as training and simulation and ground vehicles support which integrates, modify, upgrades, and sustains ground vehicles for nation's armed forces. It serves the U.S. army and navy; air force, other Department of Defense and Federal Government; joint commands and space force; federal civilian agencies; health services; and space industries. The company was formerly known as SAIC Gemini, Inc. and changed its name to Science Applications International Corporation in September 2013. Science Applications International Corporation was founded in 1969 and is headquartered in Reston, Virginia.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"lululemon athletica inc.","Symbol":"LULU","Current Price":"372.07","Latest MA":"294.38","Price Target":"380.90","Difference from MA":"26.39%","Difference from Open":"-3.86%","Change from Yesterday":"-4.74%","Change from Last Report":"0.00","Latest Volume":"2,065,384","Market Cap":"45,312,172,032","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.425613,"ROE":0.43159,"DTE":36.186,"Industry":"Apparel Retail","Sector":"Consumer Cyclical","Beta":1.237,"Trailing PEG":1.4958,"Trailing PE":26.88367,"Trailing PS":4.536075,"Quick Ratio":1.182,"Day High":389.67,"Day Low":371.91,"VS Average Volume":0.9920992664,"Company Summary":"Lululemon Athletica Inc., together with its subsidiaries, designs, distributes, and retails athletic apparel, footwear, and accessories under the lululemon brand for women and men. It offers pants, shorts, tops, and jackets for healthy lifestyle, such as yoga, running, training, and other activities. It also provides fitness-inspired accessories. The company sells its products through a chain of company-operated stores; outlets; interactive workout platform; yoga and fitness studios, university campus retailers, and other partners; license and supply arrangements; and temporary locations, as well as through mobile apps and lululemon.com e-commerce website. It has operations in the United States, Canada, Mainland China, Australia, South Korea, Hong Kong, Japan, New Zealand, Taiwan, Singapore, Malaysia, Macau, Thailand, the Asia Pacific, the United Kingdom, Germany, France, Ireland, Spain, the Netherlands, Sweden, Norway, Switzerland, Europe, the Middle East, and Africa. Lululemon Athletica Inc. was founded in 1998 and is based in Vancouver, Canada.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Veeva Systems Inc.","Symbol":"VEEV","Current Price":"221.54","Latest MA":"204.66","Price Target":"270.85","Difference from MA":"8.25%","Difference from Open":"-2.55%","Change from Yesterday":"-2.15%","Change from Last Report":"0.00","Latest Volume":"881,204","Market Cap":"35,967,016,960","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":31.796148,"ROE":0.13179,"DTE":1.043,"Industry":"Health Information Services","Sector":"Healthcare","Beta":0.813,"Trailing PEG":1.2357,"Trailing PE":54.70123,"Trailing PS":13.975106,"Quick Ratio":4.941,"Day High":229.14,"Day Low":220.99,"VS Average Volume":0.8463894622,"Company Summary":"Veeva Systems Inc. provides cloud-based software for the life sciences industry. It offers Veeva Commercial Cloud, a suite of software and analytics solutions, such as Veeva customer relationship management (CRM) that enable customer-facing employees at pharmaceutical and biotechnology companies; Veeva Vault PromoMats, an end-to-end content and digital asset management solution; Veeva Vault Medical that provides source of medical content across multiple channels and geographies; Veeva Crossix, an analytics platform for pharmaceutical brands; Veeva OpenData, a customer reference data solution; Veeva Link, a data application that allows link to generate real-time intelligence; and Veeva Compass includes de-identified and longitudinal patient data for the United States. The company also provides Veeva Development Cloud, a suite of applications for the clinical, regulatory, quality, and safety functions, including Veeva Vault Clinical, Veeva Vault RIM, Veeva Vault Safety, and Veeva Vault Quality; Veeva QualityOne, a quality and document management, and training solution; Veeva RegulatoryOne, a solution that helps companies to manage regulatory submission content; and Veeva Claims addresses the end-to-end product and marketing claims management process. In addition, it offers professional and support services, including implementation and deployment planning and project management; requirements analysis, solution design, and configuration; systems environment management and deployment services; services focused on advancing or transforming business and operating processes related to Veeva solutions; data migration and systems integrations technical consulting services; training on its solutions; and ongoing managed services, such as outsourced systems administration. The company was formerly known as Verticals onDemand, Inc. and changed its name to Veeva Systems Inc. in April 2009. Veeva Systems Inc. was incorporated in 2007 and is headquartered in Pleasanton, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Signet Jewelers Limited","Symbol":"SIG","Current Price":"79.42","Latest MA":"90.92","Price Target":"107.20","Difference from MA":"-12.65%","Difference from Open":"-3.50%","Change from Yesterday":"-2.60%","Change from Last Report":"0.00","Latest Volume":"1,142,940","Market Cap":"3,454,086,912","Earning Date":"2024-12-05","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":7.3235617,"ROE":0.26830998,"DTE":48.797,"Industry":"Luxury Goods","Sector":"Consumer Cyclical","Beta":2.129,"Trailing PEG":null,"Trailing PE":9.288889,"Trailing PS":0.5012243,"Quick Ratio":0.27,"Day High":83.61,"Day Low":78.44,"VS Average Volume":1.1980992934,"Company Summary":"Signet Jewelers Limited operates as a diamond jewelry retailer. It operates through three segments: North America, International, and Other. The North America segment operates jewelry stores in jewelry stores in malls, mall-based kiosks, and off-mall locations in the United States and Canada primarily under the Kay Jewelers, Kay Jewelers Outlet, Jared The Galleria Of Jewelry, Jared Vault, Zales Jewelers, Zales Outlet, Diamonds Direct, James Allen, Banter by Piercing Pagoda, and Peoples Jewellers names, as well as operates online through its digital banners, James Allen and Blue Nile. This segment also engages in jewelry subscription business. The International segment operates stores in shopping malls and off-mall locations primarily under the H.Samuel and Ernest Jones brands in the United Kingdom, Republic of Ireland, and Channel Islands. The Other segment is involved in the purchase and conversion of rough diamonds to polished stones, as well as the provision of diamond polishing services. Signet Jewelers Limited is headquartered in Hamilton, Bermuda.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Dollar General Corporation","Symbol":"DG","Current Price":"75.94","Latest MA":"102.34","Price Target":"88.96","Difference from MA":"-25.80%","Difference from Open":"0.24%","Change from Yesterday":"-0.08%","Change from Last Report":"0.00","Latest Volume":"4,478,274","Market Cap":"16,701,180,928","Earning Date":"2024-12-05","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.7207155,"ROE":0.20882,"DTE":250.873,"Industry":"Discount Stores","Sector":"Consumer Defensive","Beta":0.449,"Trailing PEG":2.1464,"Trailing PE":12.531354,"Trailing PS":0.42092878,"Quick Ratio":0.18,"Day High":78.09,"Day Low":75.61,"VS Average Volume":1.0733099159,"Company Summary":"Dollar General Corporation, a discount retailer, provides various merchandise products in the southern, southwestern, midwestern, and eastern United States. It offers consumable products, including paper and cleaning products, such as paper towels, bath tissues, paper dinnerware, trash and storage bags, disinfectants, and laundry products; packaged food comprising cereals, pasta, canned soups, fruits and vegetables, condiments, spices, sugar, and flour; and perishables that include milk, eggs, bread, refrigerated and frozen food, beer, and wine. The company's consumable products also comprise snacks, such as candies, cookies, crackers, salty snacks, and carbonated beverages; health and beauty products, including over-the-counter medicines and personal care products, such as soaps, body washes, shampoos, cosmetics, and dental hygiene and foot care products; pet supplies and pet food; and tobacco products. In addition, it offers seasonal products comprising holiday items, toys, batteries, small electronics, greeting cards, stationery, prepaid phones and accessories, gardening supplies, hardware, and automotive and home office supplies; and home products that include kitchen supplies, cookware, small appliances, light bulbs, storage containers, frames, candles, craft supplies and kitchen, and bed and bath soft goods. Further, the company provides apparel, which comprise basic items for infants, toddlers, girls, boys, women, and men, as well as socks, underwear, disposable diapers, shoes, and accessories. The company was formerly known as J.L. Turner & Son, Inc. and changed its name to Dollar General Corporation in 1968. Dollar General Corporation was founded in 1939 and is based in Goodlettsville, Tennessee.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"RH","Symbol":"RH","Current Price":"396.39","Latest MA":"298.97","Price Target":"449.53","Difference from MA":"32.59%","Difference from Open":"-4.00%","Change from Yesterday":"-3.72%","Change from Last Report":"0.00","Latest Volume":"864,449","Market Cap":"7,373,964,288","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":31.354067,"ROE":"N\/A","DTE":"N\/A","Industry":"Specialty Retail","Sector":"Consumer Cyclical","Beta":2.43,"Trailing PEG":1.3179,"Trailing PE":109.80333,"Trailing PS":2.4207888,"Quick Ratio":0.177,"Day High":426.07,"Day Low":393.8801,"VS Average Volume":1.3097116798,"Company Summary":"RH, together with its subsidiaries, operates as a retailer in the home furnishings market. The company offers products in various categories, including furniture, lighting, textiles, bathware, décor, outdoor and garden, baby, child, and teen furnishings. It provides its products through rh.com, rhbabyandchild.com, rhteen.com, rhmodern.com, and waterworks.com online channels, as well as operates RH Galleries, RH outlet stores, RH Guesthouse, and Waterworks showrooms in the United States, Canada, the United Kingdom, and Germany. The company was formerly known as Restoration Hardware Holdings, Inc. and changed its name to RH in January 2017. RH was incorporated in 2011 and is headquartered in Corte Madera, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"UiPath, Inc.","Symbol":"PATH","Current Price":"12.97","Latest MA":"13.01","Price Target":"15.81","Difference from MA":"-0.32%","Difference from Open":"-7.36%","Change from Yesterday":"-6.76%","Change from Last Report":"0.00","Latest Volume":"9,766,926","Market Cap":"7,128,299,008","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":25.579836,"ROE":-0.058920003,"DTE":4.505,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.87,"Trailing PEG":0.8235,"Trailing PE":"N\/A","Trailing PS":5.1559477,"Quick Ratio":3.339,"Day High":14.005,"Day Low":12.905,"VS Average Volume":1.1533627445,"Company Summary":"UiPath Inc. provides an end-to-end automation platform that offers a range of robotic process automation (RPA) solutions primarily in the United States, Romania, the United Kingdom, the Netherlands, and internationally. The company offers a suite of interrelated software to build, manage, run, engage, measure, and govern automation within the organization. Its platform's embedded AI, ML, and NLP capabilities improve decisioning and information processing; emulate human behavior allows organizations to address a myriad of use cases; emulate human behavior allows organizations to address a myriad of use cases; multi-tenant platform enterprise deployment with security and governance and Automation Cloud, which enables customers to begin automating without the need to provision infrastructure, install applications, or perform additional configurations; intuitive interface and low-code, drag-and-drop functionality; signed to enable people and automations to work together; and tracks, measures, and forecasts the performance of automations, enables customers to gain powerful insights and generate key performance indicators with actionable metric. It serves banking and financial services, healthcare, insurance, public sectors, manufacturing, retail, and telecom industries. The company was founded in 2005 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Victorias Secret & Co.","Symbol":"VSCO","Current Price":"43.35","Latest MA":"25.83","Price Target":"46.18","Difference from MA":"67.80%","Difference from Open":"-4.64%","Change from Yesterday":"-3.13%","Change from Last Report":"0.00","Latest Volume":"1,108,341","Market Cap":"3,408,246,272","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":16.11548,"ROE":0.36020002,"DTE":568.421,"Industry":"Apparel Retail","Sector":"Consumer Cyclical","Beta":2.198,"Trailing PEG":null,"Trailing PE":22.117346,"Trailing PS":0.55644834,"Quick Ratio":0.219,"Day High":45.69,"Day Low":43.14,"VS Average Volume":0.512523838,"Company Summary":"Victoria's Secret & Co. operates as a specialty retailer of women's intimate, and other apparel and beauty products worldwide. It offers bras, panties, lingerie, casual sleepwear, and athleisure and swim, as well as fragrances and body care; and loungewear, knit tops, activewear, and accessories and beauty under the Victoria's Secret, PINK, and Adore Me brands. The company provides its products through its retail stores; websites, such as VictoriasSecret.com, PINK.com, and AdoreMe.com; and other digital channels. It also operates stores under the franchise, license, and wholesale arrangements. Victoria's Secret & Co. was incorporated in 2021 and is headquartered in Reynoldsburg, Ohio.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Hewlett Packard Enterprise Comp","Symbol":"HPE","Current Price":"20.59","Latest MA":"19.85","Price Target":"24.21","Difference from MA":"3.75%","Difference from Open":"-4.98%","Change from Yesterday":"-4.41%","Change from Last Report":"0.00","Latest Volume":"10,778,597","Market Cap":"26,705,229,824","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.014057,"ROE":0.086660005,"DTE":53.696,"Industry":"Communication Equipment","Sector":"Technology","Beta":1.206,"Trailing PEG":3.5699,"Trailing PE":10.668394,"Trailing PS":0.92023534,"Quick Ratio":0.469,"Day High":21.8,"Day Low":20.55,"VS Average Volume":0.8069619334,"Company Summary":"Hewlett Packard Enterprise Company provides solutions that allow customers to capture, analyze, and act upon data seamlessly in the Americas, Europe, the Middle East, Africa, the Asia Pacific, and Japan. It operates in six segments: Compute, HPC & AI, Storage, Intelligent Edge, Financial Services, and Corporate Investments and Other. The company offers general purpose servers for multi-workload computing and workload-optimized servers; HPE ProLiant rack and tower servers; HPE Synergy; HPE Alletra, HPE GreenLake, Zerto, HPE InfoSight, and HPE CloudPhysics storage products; HPE Cray EX, HPE Cray XD, and converged edge systems; and HPE Superdome Flex, HPE Nonstop, and HPE Integrity products. It also provides HPE Aruba products that includes hardware products, such as Wi-Fi access points, switches, and gateways; HPE Aruba Networking software and services comprising cloud-based management, network management and access control, analytics and assurance, software-defined wide-area networking, network security, analytics and assurance, and location services software; and professional and support services, as well as as-a-service and consumption models. In addition, the company offers leasing, financing, IT consumption, and utility programs and asset management services for customers to facilitate technology deployment models and the acquisition of various IT solutions, including hardware, software, and services from Hewlett Packard Enterprise and others; consultative-led services; HPE Ezmeral Container Platform; HPE Ezmeral Software Container Platform and HPE Ezmeral Software Data Fabric; OpsRamp; and Hewlett Packard Labs. It serves commercial and large enterprise groups, such as business and public sector enterprises; and through various partners comprising resellers, distribution partners, original equipment manufacturers, independent software vendors, systems integrators, and advisory firms. The company was founded in 1939 and is headquartered in Spring, Texas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"DocuSign, Inc.","Symbol":"DOCU","Current Price":"92.71","Latest MA":"63.85","Price Target":"97.60","Difference from MA":"45.20%","Difference from Open":"-5.13%","Change from Yesterday":"-5.56%","Change from Last Report":"0.00","Latest Volume":"5,649,229","Market Cap":"18,729,551,872","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.860693,"ROE":0.70342004,"DTE":6.913,"Industry":"Software - Application","Sector":"Technology","Beta":0.898,"Trailing PEG":0.5641,"Trailing PE":19.23444,"Trailing PS":6.5522904,"Quick Ratio":0.785,"Day High":99.705,"Day Low":91.56,"VS Average Volume":1.4445263263,"Company Summary":"DocuSign, Inc. provides electronic signature solution in the United States and internationally. The company provides e-signature solution that enables sending and signing of agreements on various devices; Contract Lifecycle Management (CLM), which automates workflows across the entire agreement process; Document Generation streamlines the process of generating new, custom agreements; and Gen for Salesforce, which allows sales representatives to automatically generate agreements with a few clicks from within Salesforce. It also provides Identify, a signer-identification option for checking government-issued IDs; Standards-Based Signatures, which support signatures that involve digital certificates; Monitor that uses advanced analytics to track DocuSign eSignature web, mobile, and API account; Notary which enables notaries public to conduct remote online notarization transactions; and Web Forms, a web forms that quickly draft agreements using pre-populated data from completed forms or external systems via APIs. In addition, the company offers Rooms for Real Estate that provides a way for brokers and agents to manage the entire real estate transaction digitally. Signature and CLM are FedRAMP, an authorized version of DocuSign eSignature for U.S. federal government agencies; and life sciences modules that support compliance with the electronic signature practices. The company sells its products through direct and partner-assisted sales, and digital self-service purchasing. DocuSign, Inc. was incorporated in 2003 and is headquartered in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Citizens Financial Group, Inc.","Symbol":"CFG","Current Price":"42.66","Latest MA":"40.36","Price Target":"51.42","Difference from MA":"5.69%","Difference from Open":"-6.14%","Change from Yesterday":"-4.65%","Change from Last Report":"0.00","Latest Volume":"4,533,564","Market Cap":"18,800,304,128","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":11.057714,"ROE":0.05426,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.32,"Trailing PEG":null,"Trailing PE":16.729412,"Trailing PS":2.6423478,"Quick Ratio":"N\/A","Day High":45.51,"Day Low":42.63,"VS Average Volume":1.0214868592,"Company Summary":"Citizens Financial Group, Inc. operates as the bank holding company that provides retail and commercial banking products and services to individuals, small businesses, middle-market companies, corporations, and institutions in the United States. The company operates in two segments, Consumer Banking and Commercial Banking. The Consumer Banking segment offers deposit products, mortgage and home equity lending products, credit cards, business loans, wealth management, and investment services; and auto, education, and point-of-sale finance loans, as well as digital deposit products. This segment serves its customers through telephone service centers, as well as through its online and mobile platforms. The Commercial Banking segment provides various financial products and solutions, including lending and leasing, deposit and treasury management services, foreign exchange, and interest rate and commodity risk management solutions, as well as syndicated loans, corporate finance, mergers and acquisitions, and debt and equity capital markets services. This segment serves corporate banking, healthcare, technology, asset finance, franchise finance, leasing, asset-based lending, commercial real estate, mid-corporate, and private equity sponsor industries. The company was formerly known as RBS Citizens Financial Group, Inc. and changed its name to Citizens Financial Group, Inc. in April 2014. Citizens Financial Group, Inc. was founded in 1828 and is headquartered in Providence, Rhode Island.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Fastenal Company","Symbol":"FAST","Current Price":"74.65","Latest MA":"70.82","Price Target":"78.82","Difference from MA":"5.41%","Difference from Open":"-3.69%","Change from Yesterday":"-3.85%","Change from Last Report":"0.00","Latest Volume":"3,546,642","Market Cap":"42,765,942,784","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":34.143353,"ROE":0.32698002,"DTE":14.644,"Industry":"Industrial Distribution","Sector":"Industrials","Beta":0.979,"Trailing PEG":4.0882,"Trailing PE":37.139305,"Trailing PS":5.7172956,"Quick Ratio":2.013,"Day High":77.815,"Day Low":74.6,"VS Average Volume":1.3197396721,"Company Summary":"Fastenal Company, together with its subsidiaries, engages in the wholesale distribution of industrial and construction supplies in the United States, Canada, Mexico, North America, and internationally. It offers fasteners, and related industrial and construction supplies under the Fastenal name. The company's fastener products include threaded fasteners, bolts, nuts, screws, studs, and related washers that are used in manufactured products and construction projects, as well as in the maintenance and repair of machines. It also offers miscellaneous supplies and hardware, including pins, machinery keys, concrete anchors, metal framing systems, wire ropes, strut products, rivets, and related accessories. The company serves the manufacturing market comprising original equipment manufacturers; maintenance, repair, and operations customers; non-residential construction market; farmers, truckers, railroads, mining companies, schools, and retail trades; and oil exploration, production, and refinement companies, as well as federal, state, and local governmental entities. Fastenal Company was founded in 1967 and is headquartered in Winona, Minnesota.","Stock Sentiment":"Sell","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Samsara Inc.","Symbol":"IOT","Current Price":"43.64","Latest MA":"42.68","Price Target":"55.00","Difference from MA":"2.25%","Difference from Open":"-6.59%","Change from Yesterday":"-6.71%","Change from Last Report":"0.00","Latest Volume":"3,489,548","Market Cap":"24,490,680,320","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":154.80118,"ROE":-0.27858,"DTE":9.091,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.521,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":22.371311,"Quick Ratio":1.323,"Day High":46.903,"Day Low":43.34,"VS Average Volume":1.1506752107,"Company Summary":"Samsara Inc. provides solutions that connects physical operations data to its connected operations cloud in the United States and internationally. The company's Connected Operations Cloud includes Data Platform, which ingests, aggregates, and enriches data from its IoT devices and has embedded capabilities for AI, workflows and analytics, alerts, API connections, and data security and privacy. Its applications include video-based safety that enables customers to build a safety program and protect their teams with AI-enabled video; vehicle telematics which provides visibility into real-time vehicle location and diagnostics with GPS tracking, routing and dispatch, fuel efficiency management, electric vehicle usage and charge planning, preventative maintenance, and insights to manage fuel and energy costs; and mobile apps and workflows that improves productivity for frontline workers and enables regulatory compliance for workers to see upcoming jobs, capture electronic documents, perform maintenance inspections, maintain compliance logs, and message with back-office administration. The company also provides equipment monitoring which offers visibility and management of unpowered and powered assets, ranging from generators and compressors to heavy construction equipment and trailers to improve operating efficiency, prevent unplanned downtime, and avoid critical safety and compliance issues; and site visibility that provides remote visibility into sites to improve onsite security, safety, and incident response times. It serves transportation, wholesale and retail trade, construction, field services, logistics, utilities and energy, healthcare and education, manufacturing, food and beverage, and other industries, as well as government. Samsara Inc. was incorporated in 2015 and is headquartered in San Francisco, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"State Street Corporation","Symbol":"STT","Current Price":"94.74","Latest MA":"84.60","Price Target":"105.07","Difference from MA":"11.99%","Difference from Open":"-3.97%","Change from Yesterday":"-4.01%","Change from Last Report":"0.00","Latest Volume":"2,556,432","Market Cap":"27,773,126,656","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":10.018399,"ROE":0.0855,"DTE":"N\/A","Industry":"Asset Management","Sector":"Financial Services","Beta":1.48,"Trailing PEG":0.6288,"Trailing PE":14.849529,"Trailing PS":2.213351,"Quick Ratio":"N\/A","Day High":99.27,"Day Low":94.7,"VS Average Volume":1.1684164052,"Company Summary":"State Street Corporation, through its subsidiaries, provides a range of financial products and services to institutional investors worldwide. The company offers investment servicing products and services, including custody, accounting, regulatory reporting, investor, and performance and analytics; middle office products, such as IBOR, transaction management, loans, cash, derivatives and collateral, record keeping, and client reporting and investment analytics; finance leasing; foreign exchange, and brokerage and other trading services; securities finance and enhanced custody products; deposit and short-term investment facilities; investment manager and alternative investment manager operations outsourcing; performance, risk, and compliance analytics; and financial data management to support institutional investors. It also engages in the provision of portfolio management and risk analytics, as well as trading and post-trade settlement services with integrated compliance and managed data. In addition, the company offers investment management strategies and products, such as core and enhanced indexing, multi-asset strategies, active quantitative and fundamental active capabilities, and alternative investment strategies. Further, it provides services and solutions, including environmental, social, and governance investing; defined benefit and defined contribution; and global fiduciary solutions, as well as exchange-traded funds under the SPDR ETF brand. The company provides its products and services to mutual funds, collective investment funds, UCITS, hedge funds and other investment pools, corporate and public retirement plans, insurance companies, foundations, endowments, and investment managers. State Street Corporation was founded in 1792 and is headquartered in Boston, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Ally Financial Inc.","Symbol":"ALLY","Current Price":"34.61","Latest MA":"38.15","Price Target":"40.38","Difference from MA":"-9.28%","Difference from Open":"-6.21%","Change from Yesterday":"-5.41%","Change from Last Report":"0.00","Latest Volume":"2,842,250","Market Cap":"10,546,186,240","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":7.7940974,"ROE":0.06425,"DTE":"N\/A","Industry":"Credit Services","Sector":"Financial Services","Beta":1.389,"Trailing PEG":0.5533,"Trailing PE":13.844,"Trailing PS":1.559164,"Quick Ratio":"N\/A","Day High":37.12,"Day Low":34.54,"VS Average Volume":0.8371451209,"Company Summary":"Ally Financial Inc., a digital financial-services company, provides various digital financial products and services in the United States, Canada, and Bermuda. The company operates through Automotive Finance Operations, Insurance Operations, Mortgage Finance Operations, and Corporate Finance Operations segments. The Automotive Finance Operations segment offers automotive financing services, including providing retail installment sales contracts, loans and operating leases, term loans to dealers, financing dealer floorplans and other lines of credit to dealers, warehouse lines to automotive retailers, and fleet financing. It also provides financing services to companies and municipalities for the purchase or lease of vehicles, and vehicle-remarketing services. The Insurance Operations segment offers consumer finance protection and insurance products through the automotive dealer channel, and commercial insurance products directly to dealers. This segment provides vehicle service and maintenance contract, and guaranteed asset protection products; and underwrites commercial insurance coverages, which primarily insure dealers' vehicle inventory. The Mortgage Finance Operations segment manages consumer mortgage loan portfolio that includes bulk purchases of jumbo and low-to-moderate income mortgage loans originated by third parties, as well as direct-to-consumer mortgage offerings. The Corporate Finance Operations segment provides senior secured leveraged cash flow and asset-based loans to middle market companies; leveraged loans; and commercial real estate product to serve companies in the nursing facilities, senior housing, and medical office buildings. It also offers commercial banking products and services. In addition, it provides securities brokerage and investment advisory services. The company was formerly known as GMAC Inc. and changed its name to Ally Financial Inc. in May 2010. Ally Financial Inc. was founded in 1919 and is based in Detroit, Michigan.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"The Travelers Companies, Inc.","Symbol":"TRV","Current Price":"236.03","Latest MA":"228.42","Price Target":"269.75","Difference from MA":"3.33%","Difference from Open":"-2.70%","Change from Yesterday":"-3.12%","Change from Last Report":"0.00","Latest Volume":"1,570,254","Market Cap":"53,583,294,464","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":11.127827,"ROE":0.19059,"DTE":29.004,"Industry":"Insurance - Property & Casualty","Sector":"Financial Services","Beta":0.63,"Trailing PEG":0.8117,"Trailing PE":12.122753,"Trailing PS":1.1817585,"Quick Ratio":0.198,"Day High":244.97,"Day Low":235.445,"VS Average Volume":1.2656826568,"Company Summary":"The Travelers Companies, Inc., through its subsidiaries, provides a range of commercial and personal property, and casualty insurance products and services to businesses, government units, associations, and individuals in the United States and internationally. The company operates through three segments: Business Insurance, Bond & Specialty Insurance, and Personal Insurance. The Business Insurance segment offers workers' compensation, commercial automobile and property, general liability, commercial multi-peril, employers' liability, public and product liability, professional indemnity, marine, aviation, onshore and offshore energy, construction, terrorism, personal accident, and kidnap and ransom insurance products. This segment operates through select accounts, which serve small businesses; commercial accounts that serve mid-sized businesses; national accounts, which serve large companies; and national property and other that serve large and mid-sized customers, commercial trucking industry, and agricultural businesses, as well as markets and distributes its products through brokers, wholesale agents, and program managers. The Bond & Specialty Insurance segment provides surety, fidelity, management and professional liability, and other property and casualty coverages and related risk management services through independent agencies and brokers. The Personal Insurance segment offers property and casualty insurance covering personal risks, primarily automobile and homeowners' insurance to individuals through independent agencies and brokers. The Travelers Companies, Inc. was founded in 1853 and is based in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"43.11","Latest MA":"41.65","Price Target":"50.24","Difference from MA":"3.50%","Difference from Open":"-4.71%","Change from Yesterday":"-4.48%","Change from Last Report":"0.00","Latest Volume":"6,609,736","Market Cap":"57,229,389,824","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":10.935518,"ROE":-0.09505,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.035,"Trailing PEG":1.9441,"Trailing PE":"N\/A","Trailing PS":3.9476712,"Quick Ratio":"N\/A","Day High":45.44,"Day Low":43.07,"VS Average Volume":0.8154158991,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"37.33","Latest MA":"43.61","Price Target":"56.30","Difference from MA":"-14.41%","Difference from Open":"-4.21%","Change from Yesterday":"-4.11%","Change from Last Report":"0.00","Latest Volume":"15,633,887","Market Cap":"52,715,560,960","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":10.380864,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.679,"Trailing PE":12.003217,"Trailing PS":1.4645245,"Quick Ratio":1.003,"Day High":39.209,"Day Low":37.28,"VS Average Volume":1.2870529066,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"John Bean Technologies Corporat","Symbol":"JBT","Current Price":"122.92","Latest MA":"100.79","Price Target":"129.00","Difference from MA":"21.96%","Difference from Open":"1.09%","Change from Yesterday":"1.59%","Change from Last Report":"0.00","Latest Volume":"696,752","Market Cap":"3,914,092,288","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":21.542236,"ROE":0.09749,"DTE":41.102,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.226,"Trailing PEG":null,"Trailing PE":27.498882,"Trailing PS":2.311927,"Quick Ratio":1.838,"Day High":126.24,"Day Low":120.67,"VS Average Volume":1.8204554065,"Company Summary":"John Bean Technologies Corporation provides technology solutions to food and beverage industry in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. It offers value-added processing that includes chilling, mixing\/grinding, injecting, blending, marinating, tumbling, flattening, forming, portioning, coating, cooking, frying, freezing, extracting, pasteurizing, sterilizing, concentrating, high pressure processing, weighing, inspecting, filling, closing, sealing, end of line material handling, and packaging solutions to the food, beverage, and health market. In addition, it offers automated guided vehicle systems for material movement in the manufacturing, warehouse, and medical facilities. It serves baby food, bakery and confectionery, citrus processing, fruits and nuts, juices, non-food, pet food, pharmaceutical, plant- based beverages and protein, poultry, meat, and seafood, ready meals, oils, soups, sauces, seasoning and dressings, automotive, building material, tissue, paper, and packaging, hospitals, pharma and life sciences, fast moving consumer goods, manufacturing, warehousing, and other industries. The company markets and sells its products and solutions through direct sales force, independent distributors, sales representatives, and technical service teams. John Bean Technologies Corporation was incorporated in 1994 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"15.91","Latest MA":"14.61","Price Target":"18.97","Difference from MA":"8.91%","Difference from Open":"-5.80%","Change from Yesterday":"-5.21%","Change from Last Report":"0.00","Latest Volume":"21,221,872","Market Cap":"23,114,207,232","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":11.849436,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.7206,"Trailing PE":15.446602,"Trailing PS":3.4550385,"Quick Ratio":"N\/A","Day High":16.91,"Day Low":15.875,"VS Average Volume":1.573436915,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Regions Financial Corporation","Symbol":"RF","Current Price":"23.29","Latest MA":"22.11","Price Target":"28.28","Difference from MA":"5.36%","Difference from Open":"-5.67%","Change from Yesterday":"-5.36%","Change from Last Report":"0.00","Latest Volume":"6,639,272","Market Cap":"21,167,443,968","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":10.3491335,"ROE":0.10042,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.182,"Trailing PEG":4.3666,"Trailing PE":13.158193,"Trailing PS":3.228713,"Quick Ratio":"N\/A","Day High":24.77,"Day Low":23.24,"VS Average Volume":0.8730185467,"Company Summary":"Regions Financial Corporation, a financial holding company, provides banking and bank-related services to individual and corporate customers. It operates through three segments: Corporate Bank, Consumer Bank, and Wealth Management. The Corporate Bank segment offers commercial banking services, such as commercial and industrial, commercial real estate, and investor real estate lending; equipment lease financing; deposit products; and securities underwriting and placement, loan syndication and placement, foreign exchange, derivatives, merger and acquisition, and other advisory services. It serves corporate, middle market, and commercial real estate developers and investors. The Consumer Bank segment provides consumer banking products and services related to residential first mortgages, home equity lines and loans, consumer credit cards, and other consumer loans, as well as deposits. The Wealth Management segment offers credit related products, and retirement and savings solutions; and trust and investment management, asset management, and estate planning services to individuals, businesses, governmental institutions, and non-profit entities. It also provides investment and insurance products; low-income housing tax credit corporate fund syndication services; and other specialty financing services. The company was founded in 1971 and is headquartered in Birmingham, Alabama.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Commerce Bancshares, Inc.","Symbol":"CBSH","Current Price":"63.87","Latest MA":"58.59","Price Target":"70.01","Difference from MA":"9.02%","Difference from Open":"-4.71%","Change from Yesterday":"-4.26%","Change from Last Report":"0.00","Latest Volume":"665,095","Market Cap":"8,599,393,280","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":17.44815,"ROE":0.16806,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.741,"Trailing PEG":null,"Trailing PE":17.450819,"Trailing PS":5.320784,"Quick Ratio":"N\/A","Day High":67.315,"Day Low":63.795,"VS Average Volume":1.1216656295,"Company Summary":"Commerce Bancshares, Inc. operates as the bank holding company for Commerce Bank that provides retail, mortgage banking, corporate, investment, trust, and asset management products and services to individuals and businesses in the United States. It operates through three segments: Consumer, Commercial, and Wealth. The Consumer segment offers various banking products and services, including consumer deposits; consumer loans, such as automobile, motorcycle, marine, tractor\/trailer, recreational vehicle, fixed rate and revolving home equity, and other consumer loans; patient health care financing; real estate loans; indirect and other consumer financing; retail branch network; personal mortgage banking; consumer installment lending; and consumer debit and credit bank cards. The Commercial segment provides corporate lending, leasing, international, merchant and commercial bank card, and securities safekeeping and bond accounting services; and business products, government deposits, and related commercial cash management services, as well as sells fixed income securities to correspondent banks, corporations, public institutions, municipalities, and individuals. The Wealth segment provides traditional trust and estate planning, advisory and discretionary investment portfolio management, and brokerage services, as well as private banking accounts. The company also offers private equity investment, securities brokerage, insurance agency, specialty lending, and leasing services, as well as online and mobile banking services. Commerce Bancshares, Inc. was founded in 1865 and is headquartered in Kansas City, Missouri.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"M&T Bank Corporation","Symbol":"MTB","Current Price":"186.15","Latest MA":"173.40","Price Target":"230.14","Difference from MA":"7.35%","Difference from Open":"-5.71%","Change from Yesterday":"-5.10%","Change from Last Report":"0.00","Latest Volume":"1,498,386","Market Cap":"30,886,191,104","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.466244,"ROE":0.08676,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.732,"Trailing PEG":null,"Trailing PE":13.778682,"Trailing PS":3.634097,"Quick Ratio":"N\/A","Day High":197.73,"Day Low":185.795,"VS Average Volume":1.3212965829,"Company Summary":"M&T Bank Corporation operates as a bank holding company for Manufacturers and Traders Trust Company and Wilmington Trust, National Association that engages in the provision of retail and commercial banking products and services in the United States. The company operates through three segments: Commercial Bank, Retail Bank, and Institutional Services and Wealth Management. It offers a range of credit products and banking services, such as commercial lending and leasing, letters of credits, commercial real estate loans, and credit facilities secured by various commercial real estate to middle-market and large commercial customers. The company also provides customers deposit products, including demand, savings and time accounts, and other services; automobile and recreational finance loans, home equity loans and lines of credit, credit cards, and other loan products, as well as residential mortgage and real estate loans; business loans, cash management, payroll, and direct deposit services to consumers and small businesses through branch network, telephone banking, internet banking, and automated teller machines. In addition, it offers trustee, agency, investment management, security brokerage, and administrative services; personal trust, planning, fiduciary, asset management, family office, and other services; and investment products, including mutual funds and annuities, and other services for corporations and institutions, investment bankers, corporate tax, finance and legal executives, and other institutional clients. The company was founded in 1856 and is headquartered in Buffalo, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"F.N.B. Corporation","Symbol":"FNB","Current Price":"14.58","Latest MA":"14.37","Price Target":"18.88","Difference from MA":"1.49%","Difference from Open":"-6.36%","Change from Yesterday":"-5.39%","Change from Last Report":"0.00","Latest Volume":"3,446,113","Market Cap":"5,242,763,776","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":10.368,"ROE":0.06687,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.976,"Trailing PEG":null,"Trailing PE":13.376146,"Trailing PS":3.5120337,"Quick Ratio":"N\/A","Day High":15.56,"Day Low":14.535,"VS Average Volume":1.4470954061,"Company Summary":"F.N.B. Corporation, a bank and financial holding company, provides a range of financial products and services primarily to consumers, corporations, governments, and small- to medium-sized businesses in the United States. The company operates through three segments: Community Banking, Wealth Management, and Insurance. The Community Banking segment offers commercial and consumer banking services, including corporate and small business banking, investment real estate financing, business credit, capital market, and lease financing services. It also provides consumer banking products and services, such as deposit products, mortgage and consumer lending services, and mobile and online banking services. The Wealth Management segment provides personal and corporate fiduciary services comprising administration of decedent and trust estates; and securities brokerage and investment advisory services, mutual funds, and annuities. The Insurance segment comprises commercial and personal insurance, and reinsurance products, as well as mezzanine financing options for small- to medium-sized businesses. The company operates community banking branches in Pennsylvania, Ohio, Maryland, West Virginia, North Carolina, South Carolina, Washington, D.C., and Virginia. F.N.B. Corporation was founded in 1864 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Bank OZK","Symbol":"OZK","Current Price":"43.79","Latest MA":"43.23","Price Target":"52.25","Difference from MA":"1.30%","Difference from Open":"-6.15%","Change from Yesterday":"-5.67%","Change from Last Report":"0.00","Latest Volume":"1,245,103","Market Cap":"4,967,844,352","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":7.495592,"ROE":0.13515,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.152,"Trailing PEG":null,"Trailing PE":7.202303,"Trailing PS":3.404417,"Quick Ratio":"N\/A","Day High":46.88,"Day Low":43.67,"VS Average Volume":1.0425492365,"Company Summary":"Bank OZK provides various retail and commercial banking services for individuals and businesses in the United States. The company offers deposit services, including non-interest bearing checking, interest bearing transaction, business sweep, savings, money market, individual retirement, and other accounts, as well as time and reciprocal deposits. It also provides trust and wealth services, such as personal trusts, custodial accounts, investment management accounts, and retirement accounts, as well as corporate trust services, including trustee, paying agent and registered transfer agent services, and other related services. In addition, the company offers treasury management services comprising automated clearing house, wire transfer, transaction reporting, wholesale lockbox, remote deposit capture, automated credit line transfer, reconciliation, positive pay, commercial card, and other services, as well as zero balance and investment sweep accounts. Further, it provides real estate, consumer, small business, indirect recreational vehicle and marine, equipment, agricultural, commercial and industrial, government guaranteed, lines of credit, homebuilder, and affordable housing loans; lender and structured, business aviation, and subscription financing services; and mortgage and other lending products. Additionally, the company offers ATMs; telephone, online, and mobile banking services; credit and debit cards; safe deposit boxes; and other products and services. The company was formerly known as Bank of the Ozarks and changed its name to Bank OZK in July 2018. Bank OZK was founded in 1903 and is headquartered in Little Rock, Arkansas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"Goldman Sachs Group, Inc. (The)","Symbol":"GS","Current Price":"550.25","Latest MA":"503.62","Price Target":"606.84","Difference from MA":"9.26%","Difference from Open":"-4.72%","Change from Yesterday":"-4.25%","Change from Last Report":"0.00","Latest Volume":"2,432,006","Market Cap":"172,728,991,744","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.839731,"ROE":0.1017,"DTE":609.793,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.342,"Trailing PEG":3.7097,"Trailing PE":16.126905,"Trailing PS":3.4974587,"Quick Ratio":1.458,"Day High":579.4679,"Day Low":544.49,"VS Average Volume":1.2084561911,"Company Summary":"The Goldman Sachs Group, Inc., a financial institution, provides a range of financial services for corporations, financial institutions, governments, and individuals worldwide. It operates through Global Banking & Markets, Asset & Wealth Management, and Platform Solutions segments. The Global Banking & Markets segment provides financial advisory services, including strategic advisory assignments related to mergers and acquisitions, divestitures, corporate defense activities, restructurings, and spin-offs; and relationship lending, and acquisition financing, as well as secured lending, through structured credit and asset-backed lending and involved in financing under securities to resale agreements. This segment also offers client execution activities for cash and derivative instruments; credit and interest rate products; and provision of mortgages, currencies, commodities, and equities related products, as well as underwriting services. The Asset & Wealth Management segment manages assets across various classes, including equity, fixed income, hedge funds, credit funds, private equity, real estate, currencies, and commodities; and provides customized investment advisory solutions, wealth advisory services, personalized financial planning, and private banking services, as well as invests in corporate equity, credit, real estate, and infrastructure assets. The Platform Solutions segment offers credit cards and point-of-sale financing for purchase of goods or services. This segment also provides cash management services, such as deposit-taking and payment solutions for corporate and institutional clients. The Goldman Sachs Group, Inc. was founded in 1869 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"U.S. Bancorp","Symbol":"USB","Current Price":"47.61","Latest MA":"44.70","Price Target":"57.29","Difference from MA":"6.52%","Difference from Open":"-5.01%","Change from Yesterday":"-4.74%","Change from Last Report":"0.00","Latest Volume":"8,843,384","Market Cap":"74,273,030,144","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":10.958381,"ROE":0.09779,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.04,"Trailing PEG":1.1641,"Trailing PE":14.649231,"Trailing PS":2.983212,"Quick Ratio":"N\/A","Day High":50.25,"Day Low":47.58,"VS Average Volume":1.1448282754,"Company Summary":"U.S. Bancorp, a financial services holding company, provides various financial services to individuals, businesses, institutional organizations, governmental entities, and other financial institutions in the United States. It operates through Wealth, Corporate, Commercial and Institutional Banking; Consumer and Business Banking; Payment Services; and Treasury and Corporate Support segments. The company offers depository services, including checking accounts, savings accounts, and time certificate contracts; and lending services, such as traditional credit products and credit card services, lease financing and import\/export trade, asset-backed lending, agricultural finance, and other products. It also provides ancillary services comprising capital markets, treasury management, and receivable lock-box collection services to corporate and governmental entity customers. In addition, the company offers asset management and fiduciary services for individuals, estates, foundations, business corporations, and charitable organizations. Further, it provides investment and insurance products to its customers principally within its domestic markets, as well as fund administration services to mutual and other funds. Additionally, the company provides corporate and purchasing card, and corporate trust services. Furthermore, it offers trust and investment management, merchant and ATM processing, mortgage banking, insurance, and brokerage and leasing services. U.S. Bancorp was founded in 1863 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:05:18"},{"Company Name":"J.B. Hunt Transport Services, I","Symbol":"JBHT","Current Price":"170.29","Latest MA":"170.21","Price Target":"194.00","Difference from MA":"0.05%","Difference from Open":"-3.90%","Change from Yesterday":"-3.96%","Change from Last Report":"0.00","Latest Volume":"946,023","Market Cap":"17,170,339,840","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":23.597147,"ROE":0.14192,"DTE":47.555,"Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":1.141,"Trailing PEG":2.4714,"Trailing PE":30.961817,"Trailing PS":1.4022835,"Quick Ratio":0.677,"Day High":179.09,"Day Low":169.94,"VS Average Volume":1.1128163686,"Company Summary":"J.B. Hunt Transport Services, Inc. provides surface transportation, delivery, and logistic services in the United States. It operates through five segments: Intermodal (JBI), Dedicated Contract Services (DCS), Integrated Capacity Solutions (ICS), Final Mile Services (FMS), and Truckload (JBT). The JBI segment offers intermodal freight solutions. It operates 118,171 pieces of company-owned trailing equipment; owns and maintains its chassis fleet of 100,825 units; and manages a fleet of 5,944 company-owned tractors, 436 independent contractor trucks, and 7,567 company drivers. The DCS segment designs, develops, and executes supply chain solutions that support various transportation networks. As of December 31, 2023, it operated 12,574 company-owned trucks, 674 customer-owned trucks, and 4 contractor trucks. The company also operates 27,194 owned pieces of trailing equipment and 5,406 customer-owned trailers. The ICS segment provides freight brokerage and transportation logistics solutions; flatbed, refrigerated, expedited, and less-than-truckload, as well as dry-van and intermodal solutions; online multimodal marketplace; and logistics management for customers to outsource their transportation functions. The FMS segment offers delivery services through 1,166 company-owned trucks, 225 customer-owned trucks, and 20 independent contractor trucks; and 1,212 owned pieces of trailing equipment and 102 customer-owned trailers. The JBT segment provides dry-van freight services by utilizing tractors and trailers operating over roads and highways through 27 company-owned tractors and 13,561 company-owned trailers. It also transports or arranges for the transportation of freight, such as general merchandise, specialty consumer items, appliances, forest and paper products, food and beverages, building materials, soaps and cosmetics, automotive parts, agricultural products, electronics, and chemicals. The company was incorporated in 1961 and is headquartered in Lowell, Arkansas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Prologis, Inc.","Symbol":"PLD","Current Price":"103.91","Latest MA":"116.75","Price Target":"130.81","Difference from MA":"-10.99%","Difference from Open":"-4.22%","Change from Yesterday":"-4.56%","Change from Last Report":"0.00","Latest Volume":"4,010,357","Market Cap":"96,238,845,952","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":38.900414,"ROE":0.05662,"DTE":57.079,"Industry":"REIT - Industrial","Sector":"Real Estate","Beta":1.094,"Trailing PEG":0.472,"Trailing PE":31.392752,"Trailing PS":11.680592,"Quick Ratio":0.417,"Day High":109.12,"Day Low":103.86,"VS Average Volume":1.0585332622,"Company Summary":"Prologis, Inc. is the global leader in logistics real estate with a focus on high-barrier, high-growth markets. At September 30, 2024, the company owned or had investments in, on a wholly owned basis or through co-investment ventures, properties and development projects expected to total approximately 1.2 billion square feet (116 million square meters) in 20 countries. Prologis leases modern logistics facilities to a diverse base of approximately 6,700 customers principally across two major categories: business-to-business and retail\/online fulfilment.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Morgan Stanley","Symbol":"MS","Current Price":"121.04","Latest MA":"107.43","Price Target":"127.08","Difference from MA":"12.67%","Difference from Open":"-5.56%","Change from Yesterday":"-5.25%","Change from Last Report":"0.00","Latest Volume":"7,593,048","Market Cap":"195,000,287,232","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.074489,"ROE":0.11079001,"DTE":405.772,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.336,"Trailing PEG":3.5043,"Trailing PE":18.395138,"Trailing PS":3.3458064,"Quick Ratio":1.83,"Day High":128.39,"Day Low":120.29,"VS Average Volume":1.1779889205,"Company Summary":"Morgan Stanley, a financial holding company, provides various financial products and services to corporations, governments, financial institutions, and individuals in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Institutional Securities, Wealth Management, and Investment Management segments. The Institutional Securities segment offers capital raising and financial advisory services, including services related to the underwriting of debt, equity, and other securities, as well as advice on mergers and acquisitions, restructurings, real estate, and project finance. This segment also provides equity and fixed income products comprising sales, financing, prime brokerage, and market-making services; foreign exchange and commodities; corporate and commercial real estate loans, commercial mortgage and secured lending facilities, and financing for sales and trading customers, and asset-backed and mortgage lending; and wealth management services, investment, and research services. The Wealth Management segment offers financial advisor-led brokerage, custody, administrative, and investment advisory services; self-directed brokerage services; financial and wealth planning services; workplace services, including stock plan administration; annuity and insurance products; securities-based lending, residential real estate loans, and other lending products; banking; and retirement plan services to individual investors and small to medium-sized businesses and institutions. The Investment Management segment provides equity, fixed income, alternatives and solutions, and liquidity and overlay services to benefit\/defined contribution plans, foundations, endowments, government entities, sovereign wealth funds, insurance companies, third-party fund sponsors, corporations, and individuals through institutional and intermediary channels. The company was founded in 1924 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"68.12","Latest MA":"63.12","Price Target":"82.14","Difference from MA":"7.93%","Difference from Open":"-4.30%","Change from Yesterday":"-4.22%","Change from Last Report":"0.00","Latest Volume":"17,532,834","Market Cap":"128,832,634,880","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.3597145,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.7515,"Trailing PE":19.407408,"Trailing PS":1.8588423,"Quick Ratio":"N\/A","Day High":71.47,"Day Low":67.916,"VS Average Volume":1.300516896,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"The Bank of New York Mellon Cor","Symbol":"BK","Current Price":"75.82","Latest MA":"68.29","Price Target":"85.61","Difference from MA":"11.03%","Difference from Open":"-3.09%","Change from Yesterday":"-3.35%","Change from Last Report":"0.00","Latest Volume":"3,516,687","Market Cap":"55,127,056,384","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.486643,"ROE":0.08563,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.06,"Trailing PEG":0.6842,"Trailing PE":16.96197,"Trailing PS":3.0968516,"Quick Ratio":"N\/A","Day High":78.495,"Day Low":75.78,"VS Average Volume":0.9023293562,"Company Summary":"The Bank of New York Mellon Corporation provides a range of financial products and services in the United States and internationally. The company operates through Securities Services, Market and Wealth Services, Investment and Wealth Management, and other segments. The Securities Services segment offers custody, trust and depositary, accounting, exchange-traded funds, middle-office solutions, transfer agency, services for private equity and real estate funds, foreign exchange, securities lending, liquidity\/lending services, and data analytics. This segment also provides trustee, paying agency, fiduciary, escrow and other financial, issuer, and support services for brokers and investors. The Market and Wealth Services segment offers clearing and custody, investment, wealth and retirement solutions, technology and enterprise data management, trading, and prime brokerage services. This segment also provides integrated cash management solutions, including payments, foreign exchange, liquidity management, receivables processing and payables management, and trade finance and processing services. The Investment and Wealth Management segment offers investment management strategies and distribution of investment products, investment management, custody, wealth and estate planning, private banking, investment, and information management services. The Other segment engages in the provision of leasing, corporate treasury, derivative and other trading, corporate and bank-owned life insurance, renewable energy investment, and business exit services. It serves central banks and sovereigns, financial institutions, asset managers, insurance companies, corporations, local authorities and high net-worth individuals, and family offices. The Bank of New York Mellon Corporation was founded in 1784 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"First Horizon Corporation","Symbol":"FHN","Current Price":"19.11","Latest MA":"16.56","Price Target":"21.67","Difference from MA":"15.39%","Difference from Open":"-4.97%","Change from Yesterday":"-4.21%","Change from Last Report":"0.00","Latest Volume":"6,687,178","Market Cap":"10,130,936,832","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.951295,"ROE":0.08979,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.882,"Trailing PEG":null,"Trailing PE":13.948906,"Trailing PS":3.298905,"Quick Ratio":"N\/A","Day High":20.18,"Day Low":19.09,"VS Average Volume":1.0104849186,"Company Summary":"First Horizon Corporation operates as the bank holding company for First Horizon Bank that provides various financial services. The company operates through Regional Banking and Specialty Banking segments. It offers general banking services for consumers, businesses, financial institutions, and governments. The company also accepts deposits; provides underwriting services for bank-eligible securities and other fixed-income securities by financial subsidiaries; sells loans and derivatives; financial planning; and offers investment and financial advisory services. In addition, it offers mortgage banking; loan syndications; brokerage services; commercial and business banking for business enterprises, consumer banking, and private client and wealth management services; capital markets, professional commercial real estate, mortgage warehouse and asset-based lending, franchise and equipment finance, tax credit finance, energy and healthcare finance, asset management, and corporate and correspondent banking services. Further, the company provides transaction processing services including check clearing services and remittance processing, credit cards, investment, and sale of mutual fund and retail insurances, as well as trust, fiduciary, and agency services. First Horizon Corporation was founded in 1864 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"PPG Industries, Inc.","Symbol":"PPG","Current Price":"121.25","Latest MA":"126.49","Price Target":"147.64","Difference from MA":"-4.14%","Difference from Open":"-0.63%","Change from Yesterday":"-0.66%","Change from Last Report":"0.00","Latest Volume":"3,561,267","Market Cap":"28,130,000,896","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":13.817616,"ROE":0.19149,"DTE":91.282,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":1.254,"Trailing PEG":1.0506,"Trailing PE":19.21553,"Trailing PS":1.5601776,"Quick Ratio":0.998,"Day High":124.65,"Day Low":121.25,"VS Average Volume":2.1406566232,"Company Summary":"PPG Industries, Inc. manufactures and distributes paints, coatings, and specialty materials in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. It operates through two segments, Performance Coatings and Industrial Coatings. The Performance Coatings segment offers coatings, solvents, adhesives, sealants, sundries, and software for automotive and commercial transport\/fleet repair and refurbishing, light industrial coatings, and specialty coatings for signs; wood stains; paints, thermoplastics, pavement marking products, and other advanced technologies for pavement marking for government, commercial infrastructure, painting, and maintenance contractors; and coatings, sealants, transparencies, transparent armor, adhesives, engineered materials, and packaging and chemical management services for commercial, military, regional jet, and general aviation aircraft. The Industrial Coatings segment offers coatings, adhesives and sealants, and metal pretreatments, as well as services and coatings applications for appliances, agricultural and construction equipment, consumer electronics, automotive parts and accessories, building products, kitchenware, and transportation vehicles and other finished products; and on-site coatings services. It also provides coatings for metal cans, closures, plastic and aluminum tubes for food, beverage and personal care, promotional, and specialty packaging; amorphous precipitated silica for tire, battery separator, and other end-uses; TESLIN substrates for labels, e-passports, drivers' licenses, breathable membranes, and loyalty and identification cards; and organic light emitting diode materials, displays and lighting lens materials, optical lenses, color-change products, and photochromic dyes. PPG Industries, Inc. was incorporated in 1883 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Synovus Financial Corp.","Symbol":"SNV","Current Price":"50.41","Latest MA":"45.43","Price Target":"61.76","Difference from MA":"10.97%","Difference from Open":"-6.00%","Change from Yesterday":"-5.53%","Change from Last Report":"0.00","Latest Volume":"1,710,016","Market Cap":"7,141,332,480","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.025858,"ROE":0.07237,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.392,"Trailing PEG":null,"Trailing PE":22.913635,"Trailing PS":4.0791483,"Quick Ratio":"N\/A","Day High":54.04,"Day Low":50.305,"VS Average Volume":1.2147338017,"Company Summary":"Synovus Financial Corp. operates as the bank holding company for Synovus Bank that provides commercial and consumer banking products and services. It operates through four segments: Community Banking, Wholesale Banking, Consumer Banking, and Financial Management Services. The company's commercial banking services include treasury and asset management, capital market, and institutional trust services, as well as commercial, financial, and real estate lending services. Its consumer banking services comprise accepting customary types of demand and savings deposits accounts; mortgage, installment, and other consumer loans; investment and brokerage services; safe deposit services; automated banking services; automated fund transfers; internet-based banking services; and bank credit and debit card services, including Visa and MasterCard services. The company also offers various other financial services, including portfolio management for fixed-income securities, investment banking, execution of securities transactions as a broker\/dealer, trust management, and financial planning services, as well as provides individual investment advice on equity and other securities. The company was founded in 1888 and is headquartered in Columbus, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"43.50","Latest MA":"41.05","Price Target":"50.10","Difference from MA":"5.98%","Difference from Open":"-3.63%","Change from Yesterday":"-3.44%","Change from Last Report":"0.00","Latest Volume":"31,396,039","Market Cap":"333,770,293,248","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.811729,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":1.9273,"Trailing PE":15.76087,"Trailing PS":3.527258,"Quick Ratio":"N\/A","Day High":45.43,"Day Low":43.35,"VS Average Volume":0.9056245282,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"PNC Financial Services Group, I","Symbol":"PNC","Current Price":"191.96","Latest MA":"177.89","Price Target":"219.25","Difference from MA":"7.91%","Difference from Open":"-3.51%","Change from Yesterday":"-3.20%","Change from Last Report":"0.00","Latest Volume":"3,505,364","Market Cap":"76,166,471,680","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.738989,"ROE":0.099020004,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.121,"Trailing PEG":1.894,"Trailing PE":16.240273,"Trailing PS":3.71834,"Quick Ratio":"N\/A","Day High":200.36,"Day Low":191.29,"VS Average Volume":1.9236513202,"Company Summary":"The PNC Financial Services Group, Inc. operates as a diversified financial services company in the United States. It operates through three segments: Retail Banking, Corporate & Institutional Banking, and Asset Management Group segments. The company's Retail Banking segment offers checking, savings, and money market accounts, as well as time deposit; residential mortgages, home equity loans and lines of credit, auto loans, credit cards, education loans, and personal and small business loans and lines of credit; and brokerage, insurance, and investment and cash management services. This segment serves consumer and small business customers through a network of branches, digital channels, ATMs, and through phone-based customer contact centers. Its Corporate & Institutional Banking segment provides secured and unsecured loans, letters of credit, and equipment leases; cash and investment management services, receivables and disbursement management services, funds transfer services, international payment services, and access to online\/mobile information management and reporting; securities underwriting, loan syndications, customer-related trading, and mergers and acquisitions and equity capital markets advisory related services; and commercial loan servicing and technology solutions. It serves mid-sized and large corporations, and government and not-for-profit entities. The company's Asset Management Group segment offers investment and retirement planning, customized investment management, credit and cash management solutions, and trust management and administration services for high net worth and ultra high net worth individuals, and their families; and multi-generational family planning services for ultra high net worth individuals and their families. It also provides outsourced chief investment officer, custody, private real estate, cash and fixed income client solutions, and retirement plan fiduciary investment services for institutional clients. The company was founded in 1852 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"68.76","Latest MA":"60.83","Price Target":"76.14","Difference from MA":"13.04%","Difference from Open":"-2.62%","Change from Yesterday":"-2.90%","Change from Last Report":"0.00","Latest Volume":"20,534,635","Market Cap":"228,935,729,152","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.549301,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.2056,"Trailing PE":14.295218,"Trailing PS":2.9397845,"Quick Ratio":"N\/A","Day High":71.49,"Day Low":68.62,"VS Average Volume":1.1462803031,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Devon Energy Corporation","Symbol":"DVN","Current Price":"31.10","Latest MA":"42.08","Price Target":"50.04","Difference from MA":"-26.09%","Difference from Open":"-3.12%","Change from Yesterday":"-3.33%","Change from Last Report":"0.00","Latest Volume":"13,723,536","Market Cap":"20,429,588,480","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.6231513,"ROE":0.26279,"DTE":64.021,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":2.071,"Trailing PEG":14.898,"Trailing PE":5.759259,"Trailing PS":1.4061248,"Quick Ratio":0.834,"Day High":32.3599,"Day Low":31.065,"VS Average Volume":1.5037118526,"Company Summary":"Devon Energy Corporation, an independent energy company, engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. It operates in Delaware, Eagle Ford, Anadarko, Williston, and Powder River Basins. The company was founded in 1971 and is headquartered in Oklahoma City, Oklahoma.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"73.97","Latest MA":"70.46","Price Target":"82.63","Difference from MA":"4.98%","Difference from Open":"-3.63%","Change from Yesterday":"-3.63%","Change from Last Report":"0.00","Latest Volume":"13,743,728","Market Cap":"135,406,526,464","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.16083,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":1.1905,"Trailing PE":28.894533,"Trailing PS":7.227077,"Quick Ratio":0.481,"Day High":77.165,"Day Low":73.51,"VS Average Volume":1.7410576476,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"25.83","Latest MA":"22.31","Price Target":"26.87","Difference from MA":"15.77%","Difference from Open":"-2.86%","Change from Yesterday":"-2.93%","Change from Last Report":"0.00","Latest Volume":"12,483,752","Market Cap":"57,384,960,000","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.318104,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":1.8913,"Trailing PE":22.858408,"Trailing PS":3.7875361,"Quick Ratio":0.291,"Day High":26.723,"Day Low":25.78,"VS Average Volume":0.9005021315,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Pinnacle Financial Partners, In","Symbol":"PNFP","Current Price":"111.05","Latest MA":"96.69","Price Target":"127.00","Difference from MA":"14.85%","Difference from Open":"-6.18%","Change from Yesterday":"-5.11%","Change from Last Report":"0.00","Latest Volume":"536,347","Market Cap":"8,578,079,744","Earning Date":"2025-01-14","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":14.550673,"ROE":0.06875,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.037,"Trailing PEG":null,"Trailing PE":21.23327,"Trailing PS":5.532382,"Quick Ratio":"N\/A","Day High":119.12,"Day Low":110.51,"VS Average Volume":1.0108387549,"Company Summary":"Pinnacle Financial Partners, Inc., together with its subsidiaries, operates as the bank holding company for Pinnacle Bank that provides various banking products and services to individuals, businesses, and professional entities in the United States. The company accepts various deposits, including savings, noninterest-bearing and interest-bearing checking, money market, and certificate of deposit accounts; and provides treasury management services, which includes online wire origination, enhanced ACH origination services, positive pay, zero balance and sweep accounts, automated bill pay services, electronic receivables processing, lockbox processing, and merchant card acceptance services. It offers equipment and working capital loans; commercial real estate loans comprising investment properties and business loans; secured and unsecured loans, such as installment and term, lines of credit, and residential first mortgage, as well as home equity loans and home equity lines of credit; and credit cards for consumers and businesses. The company also provides investment products; brokerage and investment advisory programs; and fiduciary and investment services, such as personal trust, investment management, estate administration, endowments, foundations, individual retirement accounts, escrow services, and custody. In addition, it offers insurance agency services primarily in the property and casualty area; merger and acquisition advisory services; and private debt, equity and mezzanine, and other middle-market advisory services. Further, the company provides telephone and online banking, mobile banking, debit and credit cards, direct deposit and remote deposit capture, mobile deposit option, automated teller machine, and cash management services. Pinnacle Financial Partners, Inc. was incorporated in 2000 and is headquartered in Nashville, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"UnitedHealth Group Incorporated","Symbol":"UNH","Current Price":"499.72","Latest MA":"553.26","Price Target":"639.52","Difference from MA":"-9.68%","Difference from Open":"2.31%","Change from Yesterday":"2.92%","Change from Last Report":"0.00","Latest Volume":"10,017,661","Market Cap":"459,884,331,008","Earning Date":"2025-01-10","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":16.716951,"ROE":0.15252,"DTE":74.683,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.591,"Trailing PEG":1.3818,"Trailing PE":32.470436,"Trailing PS":1.1675214,"Quick Ratio":0.833,"Day High":506.535,"Day Low":486.35,"VS Average Volume":2.4229062605,"Company Summary":"UnitedHealth Group Incorporated operates as a diversified health care company in the United States. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage, and health and well-being services to individuals age 50 and older addressing their needs; Medicaid plans, children's health insurance and health care programs; and health and dental benefits, and hospital and clinical services, as well as health care benefits products and services to state programs caring for the economically disadvantaged, medically underserved, and those without the benefit of employer-funded health care coverage. The Optum Health segment provides care delivery, care management, wellness and consumer engagement, and health financial services patients, consumers, care delivery systems, providers, employers, payers, and public-sector entities. The Optum Insight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The Optum Rx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and community health pharmacy services, infusion, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease\/drug therapy management. UnitedHealth Group Incorporated was founded in 1974 and is based in Minnetonka, Minnesota.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Wintrust Financial Corporation","Symbol":"WTFC","Current Price":"124.65","Latest MA":"109.33","Price Target":"142.42","Difference from MA":"14.01%","Difference from Open":"-4.93%","Change from Yesterday":"-4.30%","Change from Last Report":"0.00","Latest Volume":"819,437","Market Cap":"8,288,252,928","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.164216,"ROE":0.11093,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.15,"Trailing PEG":null,"Trailing PE":13.066038,"Trailing PS":3.676191,"Quick Ratio":"N\/A","Day High":132.35,"Day Low":124.42,"VS Average Volume":2.0282642218,"Company Summary":"Wintrust Financial Corporation operates as a financial holding company. It operates in three segments: Community Banking, Specialty Finance, and Wealth Management. The Community Banking segment offers non-interest bearing deposits, non-brokered interest-bearing transaction accounts, and savings and domestic time deposits; home equity, consumer, and real estate loans; safe deposit facilities; and automatic teller machine (ATM), online and mobile banking, and other services. It also engages in the retail origination and purchase of residential mortgages; and provision of lending, deposits, and treasury management services to condominium, homeowner, and community associations, as well as asset-based lending for middle-market companies. In addition, this segment offers loan and deposit services to mortgage brokerage companies; lending to restaurant franchisees; direct leasing; small business administration loans; commercial mortgages and construction loans; and financial solutions. It provides personal and commercial banking services primarily to individuals, small to mid-sized businesses, local governmental units, and institutional clients. The Specialty Finance segment offers commercial and life insurance premiums financing for businesses and individuals; accounts receivable financing, value-added, and out-sourced administrative services; other specialty finance services; equipment financing through structured loan and lease products; and property and casualty premium financing; as well as data processing of payrolls, billing, and cash management services to temporary staffing industry. The Wealth Management segment provides wealth management services, such as trust and investment, asset management, tax-deferred exchange, securities brokerage, and retirement plan services. Wintrust Financial Corporation was founded in 1991 and is headquartered in Rosemont, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Alcoa Corporation","Symbol":"AA","Current Price":"37.31","Latest MA":"38.34","Price Target":"50.08","Difference from MA":"-2.69%","Difference from Open":"-2.99%","Change from Yesterday":"-2.94%","Change from Last Report":"0.00","Latest Volume":"4,298,015","Market Cap":"9,639,225,344","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.634181,"ROE":-0.07142,"DTE":56.095,"Industry":"Aluminum","Sector":"Basic Materials","Beta":2.419,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.87597466,"Quick Ratio":0.671,"Day High":39.31,"Day Low":36.92,"VS Average Volume":0.8794058118,"Company Summary":"Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through two segments, Alumina and Aluminum. It engages in bauxite mining operations; and processes bauxite into alumina and sells it to customers who process it into industrial chemical products, as well as aluminum smelting and casting businesses. The company offers primary aluminum in the form of alloy ingot or value-add ingot to customers that produce products for the transportation, building and construction, packaging, wire, and other industrial markets; and flat-rolled aluminum in the form of sheet, which is sold primarily to customers that produce beverage and food cans. In addition, it owns hydro power plants that generates and sells electricity in the wholesale market to traders, large industrial consumers, distribution companies, and other generation companies. The company was formerly known as Alcoa Upstream Corporation and changed its name to Alcoa Corporation in October 2016. The company was founded in 1886 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"230.37","Latest MA":"215.09","Price Target":"250.33","Difference from MA":"7.11%","Difference from Open":"-3.61%","Change from Yesterday":"-3.35%","Change from Last Report":"0.00","Latest Volume":"10,611,432","Market Cap":"648,569,880,576","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.567035,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":4.5573,"Trailing PE":12.805448,"Trailing PS":3.9998634,"Quick Ratio":"N\/A","Day High":239.07,"Day Low":229.6,"VS Average Volume":1.2465373317,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Interactive Brokers Group, Inc.","Symbol":"IBKR","Current Price":"173.79","Latest MA":"139.67","Price Target":"199.00","Difference from MA":"24.43%","Difference from Open":"-3.21%","Change from Yesterday":"-2.86%","Change from Last Report":"0.00","Latest Volume":"929,881","Market Cap":"73,430,089,728","Earning Date":"2025-01-14","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":25.075315,"ROE":0.21709,"DTE":107.179,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.792,"Trailing PEG":13.1864,"Trailing PE":27.112324,"Trailing PS":14.855369,"Quick Ratio":1.113,"Day High":179.56,"Day Low":172.33,"VS Average Volume":0.882241712,"Company Summary":"Interactive Brokers Group, Inc. operates as an automated electronic broker worldwide. The company engages in the execution, clearance, and settlement of trades in stocks, options, futures, foreign exchange instruments, bonds, mutual funds, exchange traded funds (ETFs), precious metals, and cryptocurrencies. It also custodies and services accounts for hedge and mutual funds, ETFs, registered investment advisors, proprietary trading groups, introducing brokers, and individual investors. In addition, the company offers custody, prime brokerage, securities, and margin lending services. It serves institutional and individual customers through electronic exchanges and market centers. The company was founded in 1977 and is headquartered in Greenwich, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Discover Financial Services","Symbol":"DFS","Current Price":"168.26","Latest MA":"142.19","Price Target":"176.08","Difference from MA":"18.33%","Difference from Open":"-3.25%","Change from Yesterday":"-3.23%","Change from Last Report":"0.00","Latest Volume":"1,746,399","Market Cap":"42,245,373,952","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.202144,"ROE":0.20263,"DTE":105.313,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.402,"Trailing PEG":4.2714,"Trailing PE":13.547503,"Trailing PS":3.6150415,"Quick Ratio":1.174,"Day High":175.51,"Day Low":167.3,"VS Average Volume":1.1217285575,"Company Summary":"Discover Financial Services, through its subsidiaries, provides digital banking products and services, and payment services in the United States. It operates in two segments, Digital Banking and Payment Services. The Digital Banking segment offers Discover-branded credit cards to individuals; personal loans, home loans, and other consumer lending; and direct-to-consumer deposit products comprising savings accounts, certificates of deposit, money market accounts, IRA certificates of deposit, IRA savings accounts and checking accounts, and sweep accounts. The Payment Services segment operates the PULSE to access automated teller machines, debit, and electronic funds transfer network; and Diners Club International, a payments network that issues Diners Club branded charge cards and\/or provides card acceptance services, as well as offers payment transaction processing and settlement services. The company was incorporated in 1960 and is based in Riverwoods, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"58.88","Latest MA":"50.43","Price Target":"78.22","Difference from MA":"16.76%","Difference from Open":"-3.44%","Change from Yesterday":"-3.17%","Change from Last Report":"0.00","Latest Volume":"7,985,337","Market Cap":"37,994,147,840","Earning Date":"2025-01-10","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":7.94692,"ROE":0.4067,"DTE":186.78,"Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PE":8.166435,"Trailing PS":0.6300122,"Quick Ratio":0.268,"Day High":61.98,"Day Low":58.31,"VS Average Volume":0.9557966591,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Hancock Whitney Corporation","Symbol":"HWC","Current Price":"53.69","Latest MA":"51.04","Price Target":"65.59","Difference from MA":"5.20%","Difference from Open":"-6.25%","Change from Yesterday":"-5.76%","Change from Last Report":"0.00","Latest Volume":"607,571","Market Cap":"4,620,582,912","Earning Date":"2025-01-14","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":10.45014,"ROE":0.10145,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.268,"Trailing PEG":null,"Trailing PE":12.038116,"Trailing PS":3.4838116,"Quick Ratio":"N\/A","Day High":57.53,"Day Low":53.3992,"VS Average Volume":1.1796762143,"Company Summary":"Hancock Whitney Corporation operates as the financial holding company for Hancock Whitney Bank that provides traditional and online banking services to commercial, small business, and retail customers. It offers various transaction and savings deposit products consisting of brokered deposits, time deposits, and money market accounts; treasury management services, secured and unsecured loan products including revolving credit facilities, and letters of credit and similar financial guarantees; and trust and investment management services to retirement plans, corporations, and individuals, and investment advisory and brokerage products. The company also provides commercial and industrial loans including real and non-real estate loans; construction and land development loans; and residential mortgages, as well as consumer loans. In addition, it offers commercial finance products to middle market and corporate clients, including leases and related structures; facilitates investments in new market tax credit activities and holding certain foreclosed assets; provides customers access to fixed annuity and life insurance products; and underwriting transactions products, as well as debt and mortgage-related securities. The company was founded in 1899 and is headquartered in Gulfport, Mississippi.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Bruker Corporation","Symbol":"BRKR","Current Price":"55.38","Latest MA":"63.29","Price Target":"72.42","Difference from MA":"-12.50%","Difference from Open":"-3.59%","Change from Yesterday":"-4.20%","Change from Last Report":"0.00","Latest Volume":"1,604,252","Market Cap":"8,395,497,472","Earning Date":"2025-01-06","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":20.260853,"ROE":0.19725999,"DTE":132.635,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.204,"Trailing PEG":null,"Trailing PE":26.753624,"Trailing PS":2.5901637,"Quick Ratio":0.658,"Day High":57.97,"Day Low":55.18,"VS Average Volume":1.1362676637,"Company Summary":"Bruker Corporation, together with its subsidiaries, develops, manufactures, and distributes scientific instruments, and analytical and diagnostic solutions in the United States, Europe, the Asia Pacific, and internationally. The company operates through four segments: Bruker Scientific Instruments (BSI) BioSpin, BSI CALID, BSI Nano, and Bruker Energy & Supercon Technologies. It offers life science tools, and single and multiple modality systems; life science mass spectrometry; MALDI Biotyper rapid pathogen identification platform and related test kits, DNA test strips, and fluorescence-based polymerase chain reaction technology; genotype and fluorotype molecular diagnostics kits; research, analytical, and process analysis instruments and solutions; SARS-CoV 2 testing for the diagnosis of COVID-19 infection; and Fluorotyper-SARS-CoV 2 plus kits. It also provides range of portable analytical and bioanalytical detection systems, and related products; X-ray instruments; analytical tools for electron microscopes, as well as handheld, portable, and mobile X-ray fluorescence spectrometry instruments; atomic force microscopy instrumentation; non-contact nanometer resolution solution topography; and automated X-ray metrology, automated AFM defect-detection, and photomask repair and cleaning equipment. In addition, the company offers advanced optical fluorescence microscopy instruments; products and services to support the multi-omics needs of researchers in translational research, drug, and biomarker discovery; superconducting materials, such as metallic low temperature superconductors; devices and complex tools based on metallic low temperature superconductors; and non-superconducting high technology tools, such as synchrotron and beamline instrumentation. The company was incorporated in 1991 and is headquartered in Billerica, Massachusetts.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"MSC Industrial Direct Company, ","Symbol":"MSM","Current Price":"78.31","Latest MA":"82.67","Price Target":"78.60","Difference from MA":"-5.28%","Difference from Open":"-3.77%","Change from Yesterday":"-3.73%","Change from Last Report":"0.00","Latest Volume":"628,861","Market Cap":"4,376,150,528","Earning Date":"2025-01-07","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.352385,"ROE":0.1769,"DTE":40.547,"Industry":"Industrial Distribution","Sector":"Industrials","Beta":0.826,"Trailing PEG":1.2886,"Trailing PE":17.098253,"Trailing PS":1.145304,"Quick Ratio":0.73,"Day High":81.98,"Day Low":77.945,"VS Average Volume":0.9824771082,"Company Summary":"MSC Industrial Direct Co., Inc., together with its subsidiaries, engages in the distribution of metalworking and maintenance, repair, and operations (MRO) products and services in the United States, Canada, Mexico, the United Kingdom, and internationally. The company's MRO products include cutting tools, measuring instruments, tooling components, metalworking products, fasteners, flat stock products, raw materials, abrasives, machinery hand and power tools, safety and janitorial supplies, plumbing supplies, materials handling products, power transmission components, and electrical supplies. It offers stock-keeping units through its catalogs and brochures; e-commerce channels, including its website, mscdirect.com; inventory management solutions; and customer care centers, customer fulfillment centers, regional inventory centers, and warehouses. The company serves individual machine shops, manufacturing companies, and government agencies. MSC Industrial Direct Co., Inc. was founded in 1941 and is headquartered in Melville, New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"TD SYNNEX Corporation","Symbol":"SNX","Current Price":"116.49","Latest MA":"119.30","Price Target":"138.27","Difference from MA":"-2.36%","Difference from Open":"-3.83%","Change from Yesterday":"-2.99%","Change from Last Report":"0.00","Latest Volume":"647,536","Market Cap":"9,911,901,184","Earning Date":"2025-01-07","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.103164,"ROE":0.08249,"DTE":49.61,"Industry":"Electronics & Computer Distribution","Sector":"Technology","Beta":1.405,"Trailing PEG":0.9231,"Trailing PE":15.108949,"Trailing PS":0.1738467,"Quick Ratio":0.735,"Day High":121.85,"Day Low":116.215,"VS Average Volume":1.0544952383,"Company Summary":"TD SYNNEX Corporation operates as a distributor and solutions aggregator for the information technology (IT) ecosystem. The company offers personal computing devices and peripherals, mobile phones and accessories, printers, supplies, and endpoint technology software; and data center technologies, such as hybrid cloud, security, storage, networking, servers, technology software, and converged and hyper-converged infrastructure, as well as computing components. It also provides systems design and rack integration, build-to-order, and configure-to-order assembly; and thermal testing, power-draw testing, burn-in, and quality and logistics support. In addition, the company offers outsourced fulfillment, virtual distribution, and direct ship to end-users; shipping documents generation, multi-level serial number tracking, and configured products and online order and shipment tracking, as well as turn-key logistics solutions. Further, it provides public cloud solutions in productivity and collaboration, IaaS, or Infrastructure as a Service, PaaS, or Platform as a Service, SaaS, or Software as a Service, security, mobility, IoT, and other hybrid solutions. Additionally, the company offers online services; provides net terms, third party leasing, floor plan financing, and letters-of-credit backed financing and arrangement; and leases products and provides device-as-a-service, as well as offers direct mail, external media advertising, reseller product training, targeted telemarketing campaigns, national and regional trade shows, trade groups, database analysis, print on demand services, and web-based marketing. It serves value-added resellers, corporate resellers, government resellers, system integrators, direct marketers, retailers, and managed service providers. The company was formerly known as SYNNEX Corporation and changed its name to TD SYNNEX Corporation in September 2021. TD SYNNEX Corporation was founded in 1974 and is headquartered in Fremont, California.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"KB Home","Symbol":"KBH","Current Price":"67.26","Latest MA":"77.87","Price Target":"81.62","Difference from MA":"-13.63%","Difference from Open":"-4.68%","Change from Yesterday":"-4.51%","Change from Last Report":"0.00","Latest Volume":"1,040,730","Market Cap":"4,932,478,464","Earning Date":"2025-01-08","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.352041,"ROE":0.15727,"DTE":42.959,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.815,"Trailing PEG":null,"Trailing PE":8.634147,"Trailing PS":0.7468728,"Quick Ratio":0.788,"Day High":70.99,"Day Low":66.74,"VS Average Volume":0.9747939616,"Company Summary":"KB Home operates as a homebuilding company in the United States. It operates through four segments: West Coast, Southwest, Central, and Southeast. It builds and sells various homes, including attached and detached single-family residential homes, townhomes, and condominiums primarily for first-time, first move-up, second move-up, and active adult homebuyers. The company also provides financial services, such as insurance products and title services, as well as mortgage banking services, including residential consumer mortgage loans to homebuyers. It has operations in Arizona, California, Colorado, Florida, Idaho, Nevada, North Carolina, Texas, and Washington. The company was formerly known as Kaufman and Broad Home Corporation and changed its name to KB Home in January 2001. KB Home was founded in 1957 and is based in Los Angeles, California.","Stock Sentiment":"Sell","Row Color":"negative-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Constellation Brands, Inc.","Symbol":"STZ","Current Price":"228.31","Latest MA":"244.65","Price Target":"289.00","Difference from MA":"-6.68%","Difference from Open":"-1.66%","Change from Yesterday":"-2.05%","Change from Last Report":"0.00","Latest Volume":"2,289,546","Market Cap":"41,458,130,944","Earning Date":"2025-01-03","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":15.058487,"ROE":0.07111,"DTE":149.155,"Industry":"Beverages - Brewers","Sector":"Consumer Defensive","Beta":0.893,"Trailing PEG":1.1995,"Trailing PE":72.94249,"Trailing PS":4.068192,"Quick Ratio":0.321,"Day High":234.12,"Day Low":228.14,"VS Average Volume":1.6975896861,"Company Summary":"Constellation Brands, Inc., together with its subsidiaries, produces, imports, markets, and sells beer, wine, and spirits in the United States, Canada, Mexico, New Zealand, and Italy. The company provides beer primarily under the Corona Extra, Corona Familiar, Corona Hard Seltzer, Corona Light, Corona Non-Alcoholic, Corona Premier, Corona Refresca, Modelo Especial, Modelo Chelada, Modelo Negra, Modelo Oro, Victoria, Vicky Chamoy, and Pacifico brands. It also offers wine under the Cook's California Champagne, Kim Crawford, Meiomi, Mount Veeder, Ruffino, SIMI, My Favorite Neighbor, Robert Mondavi Winery, Schrader, and The Prisoner Wine Company brands; and spirits under the Casa Noble, Copper & Kings, High West, Mi CAMPO, Nelson's Green Brier, and SVEDKA brands. The company provides its products to wholesale distributors, retailers, on-premise locations, and state alcohol beverage control agencies. Constellation Brands, Inc. was founded in 1945 and is headquartered in Victor, New York.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Commercial Metals Company","Symbol":"CMC","Current Price":"51.24","Latest MA":"55.10","Price Target":"63.86","Difference from MA":"-7.00%","Difference from Open":"-5.91%","Change from Yesterday":"-5.39%","Change from Last Report":"0.00","Latest Volume":"1,556,291","Market Cap":"5,842,589,696","Earning Date":"2025-01-06","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":10.915575,"ROE":0.1153,"DTE":31.777,"Industry":"Steel","Sector":"Basic Materials","Beta":1.135,"Trailing PEG":null,"Trailing PE":12.376812,"Trailing PS":0.7371449,"Quick Ratio":2.416,"Day High":54.6,"Day Low":50.9,"VS Average Volume":1.78338553,"Company Summary":"Commercial Metals Company manufactures, recycles, and fabricates steel and metal products, and related materials and services in the United States, Poland, China, and internationally. It operates through three segments: North America Steel Group; Europe Steel Group; and Emerging Businesses Group. The company processes and sells ferrous and nonferrous scrap metals to steel mills and foundries, aluminum sheet and ingot manufacturers, brass and bronze ingot makers, copper refineries and mills, secondary lead smelters, specialty steel mills, high temperature alloy manufacturers, and other consumers. It also manufactures and sells finished long steel products, including reinforcing bar, merchant bar, light structural, and other special sections, as well as semi-finished billets for rerolling and forging applications. In addition, the company provides fabricated rebar used to reinforce concrete primarily in the construction of commercial and non-commercial buildings, hospitals, convention centers, industrial plants, power plants, highways, bridges, arenas, stadiums, and dams; sells and rents construction-related products and equipment to concrete installers and other businesses; and manufactures and sells strength bars for the truck trailer industry, special bar steels for the energy market, and armor plates for military vehicles. Further, it manufactures rebars, merchant bars, and wire rods; and sells fabricated rebars, wire meshes, welded steel mesh, wire rod, cold rolled rebar, cold rolled wire rod, assembled rebar cages and other fabricated rebar by-products to fabricators, manufacturers, distributors, and construction companies. The company was founded in 1915 and is headquartered in Irving, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Jefferies Financial Group Inc.","Symbol":"JEF","Current Price":"75.76","Latest MA":"59.57","Price Target":"88.75","Difference from MA":"27.19%","Difference from Open":"-4.80%","Change from Yesterday":"-4.33%","Change from Last Report":"0.00","Latest Volume":"2,007,781","Market Cap":"15,568,605,184","Earning Date":"2025-01-06","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":17.064985,"ROE":0.056739997,"DTE":295.803,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.292,"Trailing PEG":null,"Trailing PE":32.376072,"Trailing PS":2.4907353,"Quick Ratio":1.511,"Day High":80.11,"Day Low":75.65,"VS Average Volume":1.2823486657,"Company Summary":"Jefferies Financial Group Inc. operates as an investment banking and capital markets firm in the Americas, Europe, the Middle East, and the Asia-Pacific. The company operates in two segments, Investment Banking and Capital Markets, and Asset Management. It provides investment banking, advisory services with respect to mergers or acquisitions, debt financing, restructurings or recapitalizations, and private capital advisory transactions; underwriting and placement services related to corporate debt, municipal bonds, mortgage-backed and asset-backed securities, equity and equity-linked securities, and loan syndication services; and corporate lending services. The company also offers financing, securities lending, and other prime brokerage services; equities research, sales, and trading services; wealth management services; and online foreign exchange trading services. In addition, it provides investment grade distressed debt securities, U.S. and European government and agency securities, municipal bonds, leveraged loans, emerging markets debt, and interest rate and credit index derivative products; and manages and offers services to a diverse group of alternative asset management platforms across a spectrum of investment strategies and asset classes. The company was formerly known as Leucadia National Corporation and changed its name to Jefferies Financial Group Inc. in May 2018. Jefferies Financial Group Inc. was founded in 1962 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"The Simply Good Foods Company","Symbol":"SMPL","Current Price":"39.06","Latest MA":"35.43","Price Target":"39.90","Difference from MA":"10.26%","Difference from Open":"-1.19%","Change from Yesterday":"-1.71%","Change from Last Report":"0.00","Latest Volume":"934,773","Market Cap":"3,946,114,816","Earning Date":"2025-01-02","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":18.322546,"ROE":0.08447,"DTE":25.315,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.644,"Trailing PEG":null,"Trailing PE":28.304348,"Trailing PS":2.9640596,"Quick Ratio":2.608,"Day High":39.845,"Day Low":38.8,"VS Average Volume":1.0761376732,"Company Summary":"The Simply Good Foods Company, a consumer-packaged food and beverage company, engages in the development, marketing, and sale of snacks and meal replacements, and other products in North America and internationally. The company offers protein bars, ready-to-drink shakes, sweet and salty snacks, cookies, muffins, protein chips and crackers, protein powders, and recipes under the Quest, Atkins, and OWYN brand names. It also provides confectionery products, such as full-size and mini peanut butter cups, brownies, caramel candy bites, chocolatey coated peanut candies, and caramel candy bars. In addition, the company licenses certain products that contain its brands and logos; and distributes its products to various retail channels, such as mass merchandise, grocery and drug stores, club and convenience stores, gas stations, and other channels. It also sells its products through e-commerce channels, including questnutrition.com, atkins.com, liveowyn.com, amazon.com and others. The company was incorporated in 2017 and is headquartered in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Cal-Maine Foods, Inc.","Symbol":"CALM","Current Price":"103.53","Latest MA":"75.39","Price Target":"86.33","Difference from MA":"37.32%","Difference from Open":"-2.44%","Change from Yesterday":"-2.93%","Change from Last Report":"0.00","Latest Volume":"589,561","Market Cap":"5,076,759,040","Earning Date":"2024-12-30","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":29.664757,"ROE":0.24239999,"DTE":"N\/A","Industry":"Farm Products","Sector":"Consumer Defensive","Beta":-0.132,"Trailing PEG":null,"Trailing PE":11.859107,"Trailing PS":1.9136134,"Quick Ratio":3.184,"Day High":107.63,"Day Low":103.17,"VS Average Volume":1.0058845408,"Company Summary":"Cal-Maine Foods, Inc., together with its subsidiaries, engages in the production, grading, packaging, marketing, and distribution of shell eggs and egg products. The company offers specialty eggs, such as nutritionally enhanced, cage free, organic, free-range, pasture-raised, and brown eggs, as well as conventional eggs under the Egg-Land's Best, Land O' Lakes, Farmhouse Eggs, Sunups, Sunny Meadow, and 4-Grain brand names. It sells its products to various customers, including national and regional grocery store chains, club stores, independent supermarkets, foodservice distributors, and egg product consumers primarily in the southwestern, southeastern, mid-western, northeastern, and mid-Atlantic regions of the United States. The company was founded in 1957 and is headquartered in Ridgeland, Mississippi.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"9.70","Latest MA":"10.59","Price Target":"9.94","Difference from MA":"-8.40%","Difference from Open":"-2.02%","Change from Yesterday":"-2.71%","Change from Last Report":"0.00","Latest Volume":"25,436,450","Market Cap":"8,375,833,600","Earning Date":"2025-01-02","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":6.049154,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.056724552,"Quick Ratio":0.332,"Day High":10.145,"Day Low":9.63,"VS Average Volume":1.0491468512,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"RPM International Inc.","Symbol":"RPM","Current Price":"126.49","Latest MA":"120.73","Price Target":"135.43","Difference from MA":"4.77%","Difference from Open":"-3.82%","Change from Yesterday":"-3.75%","Change from Last Report":"0.00","Latest Volume":"647,671","Market Cap":"16,279,516,160","Earning Date":"2025-01-02","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":20.48222,"ROE":0.24995,"DTE":89.316,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":0.981,"Trailing PEG":2.2783,"Trailing PE":26.517818,"Trailing PS":2.2324533,"Quick Ratio":1.29,"Day High":132.33,"Day Low":126.38,"VS Average Volume":1.0430576469,"Company Summary":"RPM International Inc. manufactures and sells specialty chemicals for the industrial, specialty, and consumer markets worldwide. It offers waterproofing, coating, and traditional roofing systems; sealants, air barriers, tapes, and foams; residential home weatherization systems; roofing and building maintenance services; sealing and bonding, subfloor preparation, flooring, and glazing solutions; resin flooring systems, polyurethane, MMA waterproof, epoxy floor paint and coatings, concrete repair, and protection products; fire stopping and intumescent steel coating, and manufacturing industry solutions; rolled asphalt roofing materials and chemical admixtures; concrete and masonry admixtures, concrete fibers, curing and sealing compounds, structural grouts and mortars, epoxy adhesives, injection resins, polyurethane foams, floor hardeners and toppings, joint fillers, industrial and architectural coatings, decorative color\/stains\/stamps, and restoration materials; insulated building cladding materials; and concrete form wall systems. It also provides flooring systems; fiberglass reinforced plastic gratings and shapes; corrosion-control coating, containment and railcar lining, fire and sound proofing, and heat and cryogenic insulation products; specialty construction products; amine curing agents, reactive diluents, and epoxy resins; fluorescent colorants and pigments; shellac-based-specialty and marine coatings; fire and water damage restoration, carpet cleaning, and disinfecting products; fuel additives; wood treatments, coatings, and touch-up products; and nail enamels, polishes, and coating components. In addition, it offers solutions for the paint contractors and DIYers, concrete restoration and flooring, metallic and faux finish coatings, cleaners, and hobby paints and cements; and caulks, adhesives, insulating foams, and patches, as well as spackling, glazing, and repair products. The company was incorporated in 1947 and is headquartered in Medina, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"},{"Company Name":"Carnival Corporation","Symbol":"CCL","Current Price":"24.82","Latest MA":"19.10","Price Target":"27.52","Difference from MA":"29.97%","Difference from Open":"-4.94%","Change from Yesterday":"-3.50%","Change from Last Report":"0.00","Latest Volume":"21,458,539","Market Cap":"33,304,715,264","Earning Date":"2024-12-20","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":14.380236,"ROE":0.20120001,"DTE":352.355,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.668,"Trailing PEG":null,"Trailing PE":21.213676,"Trailing PS":1.3605423,"Quick Ratio":0.202,"Day High":26.188,"Day Low":24.545,"VS Average Volume":0.8389891346,"Company Summary":"Carnival Corporation & plc engages in the provision of leisure travel services in North America, Australia, Europe, Asia, and internationally. The company operates through four segments: NAA Cruise Operations, Europe Cruise Operations, Cruise Support, and Tour and Other. It operates port destinations, private islands, and a solar park, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. The company offers its services under the Carnival Cruise Line, Princess Cruises, Holland America Line, Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises, and Cunard brand. Additionally, it sells its cruises primarily through travel agents, tour operators, vacation planners, and websites. Carnival Corporation & plc was founded in 1972 and is headquartered in Miami, Florida.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 12:06:25"}]