[{"Company Name":"Alcoa Corporation","Symbol":"AA","Current Price":"39.12","Latest MA":"38.50","Price Target":"50.08","Difference from MA":"1.62%","Difference from Open":"0.31%","Change from Yesterday":"-1.26%","Change from Last Report":"0.00","Latest Volume":"3,599,766","Market Cap":"10,106,847,232","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":10.160563,"ROE":-0.07142,"DTE":56.095,"Stock Sentiment":"Strong Buy","Industry":"Aluminum","Sector":"Basic Materials","Beta":2.419,"Trailing PEG":null,"Trailing PS":0.91847026,"Quick Ratio":"N\/A","Day High":39.5,"Day Low":38.51,"VS Average Volume":0.7245463894,"Company Summary":"Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through two segments, Alumina and Aluminum. It engages in bauxite mining operations; and processes bauxite into alumina and sells it to customers who process it into industrial chemical products, as well as aluminum smelting and casting businesses. The company offers primary aluminum in the form of alloy ingot or value-add ingot to customers that produce products for the transportation, building and construction, packaging, wire, and other industrial markets; and flat-rolled aluminum in the form of sheet, which is sold primarily to customers that produce beverage and food cans. In addition, it owns hydro power plants that generates and sells electricity in the wholesale market to traders, large industrial consumers, distribution companies, and other generation companies. The company was formerly known as Alcoa Upstream Corporation and changed its name to Alcoa Corporation in October 2016. The company was founded in 1886 and is headquartered in Pittsburgh, Pennsylvania.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Thor Industries, Inc.","Symbol":"THO","Current Price":"104.61","Latest MA":"102.91","Price Target":"106.30","Difference from MA":"1.65%","Difference from Open":"-0.11%","Change from Yesterday":"-0.49%","Change from Last Report":"0.00","Latest Volume":"547,091","Market Cap":"5,567,323,136","Earning Date":"2024-12-04","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":17.182053,"ROE":0.06588,"DTE":28.965,"Stock Sentiment":"Hold","Industry":"Recreational Vehicles","Sector":"Consumer Cyclical","Beta":1.663,"Trailing PEG":0.9057,"Trailing PS":0.55432606,"Quick Ratio":"N\/A","Day High":105.06,"Day Low":103.26,"VS Average Volume":0.9392507159,"Company Summary":"THOR Industries, Inc. designs, manufactures, and sells recreational vehicles (RVs), and related parts and accessories in the United States, Germany, Canada, rest of Europe, and internationally. The company offers travel trailers; gasoline and diesel Class A, Class B, and Class C motorhomes; conventional travel trailers and fifth wheels; luxury fifth wheels; and motorcaravans, caravans, campervans, and urban vehicles. It also provides aluminum extrusion and specialized component products to RV and other manufacturers. The company provides its products through independent and non-franchise dealers. THOR Industries, Inc. was founded in 1980 and is based in Elkhart, Indiana.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Constellation Brands, Inc.","Symbol":"STZ","Current Price":"239.66","Latest MA":"246.37","Price Target":"289.00","Difference from MA":"-2.72%","Difference from Open":"0.11%","Change from Yesterday":"0.09%","Change from Last Report":"0.00","Latest Volume":"880,501","Market Cap":"43,519,143,936","Earning Date":"2025-01-03","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":15.931324,"ROE":0.07111,"DTE":149.155,"Stock Sentiment":"Strong Buy","Industry":"Beverages—Brewers","Sector":"Consumer Defensive","Beta":0.893,"Trailing PEG":1.2591,"Trailing PS":4.2704344,"Quick Ratio":"N\/A","Day High":241.69,"Day Low":237.89,"VS Average Volume":0.672902503,"Company Summary":"Constellation Brands, Inc., together with its subsidiaries, produces, imports, markets, and sells beer, wine, and spirits in the United States, Canada, Mexico, New Zealand, and Italy. The company provides beer primarily under the Corona Extra, Corona Familiar, Corona Hard Seltzer, Corona Light, Corona Non-Alcoholic, Corona Premier, Corona Refresca, Modelo Especial, Modelo Chelada, Modelo Negra, Modelo Oro, Victoria, Vicky Chamoy, and Pacifico brands. It also offers wine under the Cook's California Champagne, Kim Crawford, Meiomi, Mount Veeder, Ruffino, SIMI, My Favorite Neighbor, Robert Mondavi Winery, Schrader, and The Prisoner Wine Company brands; and spirits under the Casa Noble, Copper & Kings, High West, Mi CAMPO, Nelson's Green Brier, and SVEDKA brands. The company provides its products to wholesale distributors, retailers, on-premise locations, and state alcohol beverage control agencies. Constellation Brands, Inc. was founded in 1945 and is headquartered in Victor, New York.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"MongoDB, Inc.","Symbol":"MDB","Current Price":"267.19","Latest MA":"274.72","Price Target":"386.52","Difference from MA":"-2.74%","Difference from Open":"-7.42%","Change from Yesterday":"-7.42%","Change from Last Report":"0.00","Latest Volume":"5,096,596","Market Cap":"19,898,546,176","Earning Date":"2024-12-09","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":-85.16226,"ROE":-0.19561,"DTE":89.869,"Stock Sentiment":"Strong Buy","Industry":"Software—Infrastructure","Sector":"Technology","Beta":1.153,"Trailing PEG":null,"Trailing PS":10.935611,"Quick Ratio":"N\/A","Day High":290.635,"Day Low":265.2615,"VS Average Volume":3.1115148607,"Company Summary":"MongoDB, Inc., together with its subsidiaries, provides general purpose database platform worldwide. The company provides MongoDB Atlas, a hosted multi-cloud database-as-a-service solution; MongoDB Enterprise Advanced, a commercial database server for enterprise customers to run in the cloud, on-premises, or in a hybrid environment; and Community Server, a free-to-download version of its database, which includes the functionality that developers need to get started with MongoDB. It offers professional services comprising consulting and training. The company was formerly known as 10gen, Inc. and changed its name to MongoDB, Inc. in August 2013. MongoDB, Inc. was incorporated in 2007 and is headquartered in New York, New York.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"TD SYNNEX Corporation","Symbol":"SNX","Current Price":"123.24","Latest MA":"119.74","Price Target":"138.55","Difference from MA":"2.92%","Difference from Open":"-0.63%","Change from Yesterday":"-1.01%","Change from Last Report":"0.00","Latest Volume":"552,244","Market Cap":"10,486,245,376","Earning Date":"2025-01-07","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.997663,"ROE":0.08249,"DTE":49.61,"Stock Sentiment":"Strong Buy","Industry":"Electronics & Computer Distribution","Sector":"Technology","Beta":1.405,"Trailing PEG":0.9765,"Trailing PS":0.18392025,"Quick Ratio":"N\/A","Day High":124.2,"Day Low":122.58,"VS Average Volume":0.9178168933,"Company Summary":"TD SYNNEX Corporation operates as a distributor and solutions aggregator for the information technology (IT) ecosystem. The company offers personal computing devices and peripherals, mobile phones and accessories, printers, supplies, and endpoint technology software; and data center technologies, such as hybrid cloud, security, storage, networking, servers, technology software, and converged and hyper-converged infrastructure, as well as computing components. It also provides systems design and rack integration, build-to-order, and configure-to-order assembly; and thermal testing, power-draw testing, burn-in, and quality and logistics support. In addition, the company offers outsourced fulfillment, virtual distribution, and direct ship to end-users; shipping documents generation, multi-level serial number tracking, and configured products and online order and shipment tracking, as well as turn-key logistics solutions. Further, it provides public cloud solutions in productivity and collaboration, IaaS, or Infrastructure as a Service, PaaS, or Platform as a Service, SaaS, or Software as a Service, security, mobility, IoT, and other hybrid solutions. Additionally, the company offers online services; provides net terms, third party leasing, floor plan financing, and letters-of-credit backed financing and arrangement; and leases products and provides device-as-a-service, as well as offers direct mail, external media advertising, reseller product training, targeted telemarketing campaigns, national and regional trade shows, trade groups, database analysis, print on demand services, and web-based marketing. It serves value-added resellers, corporate resellers, government resellers, system integrators, direct marketers, retailers, and managed service providers. The company was formerly known as SYNNEX Corporation and changed its name to TD SYNNEX Corporation in September 2021. TD SYNNEX Corporation was founded in 1974 and is headquartered in Fremont, California.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Okta, Inc.","Symbol":"OKTA","Current Price":"81.99","Latest MA":"84.69","Price Target":"104.18","Difference from MA":"-3.19%","Difference from Open":"-2.38%","Change from Yesterday":"-2.29%","Change from Last Report":"0.00","Latest Volume":"1,879,478","Market Cap":"14,049,396,736","Earning Date":"2024-12-03","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":-391.11768,"ROE":-0.0231,"DTE":19.892,"Stock Sentiment":"Strong Buy","Industry":"Software—Infrastructure","Sector":"Technology","Beta":1.013,"Trailing PEG":1.1193,"Trailing PS":5.72977,"Quick Ratio":"N\/A","Day High":84.07,"Day Low":81.94,"VS Average Volume":0.691066623,"Company Summary":"Okta, Inc. operates as an identity partner in the United States and internationally. The company offers Okta's suite of products and services used to manage and secure identities, such as Single Sign-On that enables users to access applications in the cloud or on-premises from various devices; Adaptive Multi-Factor Authentication provides a layer of security for cloud, mobile, web applications, and data; API Access Management enables organizations to secure APIs; Access Gateway enables organizations to extend Workforce Identity Cloud; and Okta Device Access enables end users to securely log in to devices with Okta credentials. It also provides Universal Directory, a cloud-based system of record to store and secure user, application, and device profiles for an organization; Lifecycle Management enables IT organizations or developers to manage a user's identity throughout its lifecycle; Okta Identity Governance provides identity access management and identity governance solutions; Advanced Server Access offers access management to secure cloud infrastructure; Okta Privileged Access enables organizations to reduce risk with unified access and governance management for on-premises and cloud resources; and Okta Workforce Identity Workflows. In addition, the company offers Universal Login, which allows customers to provide login experience across different applications and devices; and Attack Protection, a suite of security capabilities that protects customers from different types of malicious traffic. Further, it provides Adaptive Multi-Factor Authentication, Passwordless, Machine to Machine, Private Cloud, Organizations, Actions and Extensibility, and Enterprise Connections. The company sells its products directly to customers through sales force and channel partners. The company was formerly known as Saasure, Inc. Okta, Inc. was incorporated in 2009 and is headquartered in San Francisco, California.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Toll Brothers, Inc.","Symbol":"TOL","Current Price":"133.85","Latest MA":"138.48","Price Target":"160.92","Difference from MA":"-3.34%","Difference from Open":"-1.49%","Change from Yesterday":"-3.33%","Change from Last Report":"0.00","Latest Volume":"2,304,955","Market Cap":"13,356,624,896","Earning Date":"2024-12-09","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":8.381629,"ROE":0.21799,"DTE":39.692,"Stock Sentiment":"Strong Buy","Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.671,"Trailing PEG":1.0865,"Trailing PS":1.268023,"Quick Ratio":"N\/A","Day High":136.795,"Day Low":132.305,"VS Average Volume":1.8024090978,"Company Summary":"Toll Brothers, Inc., together with its subsidiaries, designs, builds, markets, sells, and arranges finance for a range of detached and attached homes in luxury residential communities in the United States. It designs, builds, markets, and sells condominiums through Toll Brothers City Living. The company also develops a range of single-story living and first-floor primary bedroom suite home designs, as well as communities with recreational amenities, such as golf courses, marinas, pool complexes, country clubs, and fitness and recreation centers; and develops, operates, and rents apartments. In addition, it provides various interior fit-out options, such as flooring, wall tile, plumbing, cabinets, fixtures, appliances, lighting, and home-automation and security technologies. Further, the company owns and operates architectural, engineering, mortgage, title, land development, insurance, smart home technology, landscaping, lumber distribution, house component assembly, and component manufacturing operations. It serves luxury first-time, move-up, empty-nester, active-adult, and second-home buyers. Toll Brothers, Inc. was founded in 1967 and is headquartered in Fort Washington, Pennsylvania.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Commercial Metals Company","Symbol":"CMC","Current Price":"57.21","Latest MA":"55.35","Price Target":"63.86","Difference from MA":"3.36%","Difference from Open":"-1.68%","Change from Yesterday":"-2.39%","Change from Last Report":"0.00","Latest Volume":"1,334,757","Market Cap":"6,523,313,152","Earning Date":"2025-01-06","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":11.094369,"ROE":0.1153,"DTE":31.777,"Stock Sentiment":"Buy","Industry":"Steel","Sector":"Basic Materials","Beta":1.135,"Trailing PEG":null,"Trailing PS":0.82303005,"Quick Ratio":"N\/A","Day High":58.475,"Day Low":56.98,"VS Average Volume":1.5517777775,"Company Summary":"Commercial Metals Company manufactures, recycles, and fabricates steel and metal products, and related materials and services in the United States, Poland, China, and internationally. It operates through three segments: North America Steel Group; Europe Steel Group; and Emerging Businesses Group. The company processes and sells ferrous and nonferrous scrap metals to steel mills and foundries, aluminum sheet and ingot manufacturers, brass and bronze ingot makers, copper refineries and mills, secondary lead smelters, specialty steel mills, high temperature alloy manufacturers, and other consumers. It also manufactures and sells finished long steel products, including reinforcing bar, merchant bar, light structural, and other special sections, as well as semi-finished billets for rerolling and forging applications. In addition, the company provides fabricated rebar used to reinforce concrete primarily in the construction of commercial and non-commercial buildings, hospitals, convention centers, industrial plants, power plants, highways, bridges, arenas, stadiums, and dams; sells and rents construction-related products and equipment to concrete installers and other businesses; and manufactures and sells strength bars for the truck trailer industry, special bar steels for the energy market, and armor plates for military vehicles. Further, it manufactures rebars, merchant bars, and wire rods; and sells fabricated rebars, wire meshes, welded steel mesh, wire rod, cold rolled rebar, cold rolled wire rod, assembled rebar cages and other fabricated rebar by-products to fabricators, manufacturers, distributors, and construction companies. The company was founded in 1915 and is headquartered in Irving, Texas.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Hormel Foods Corporation","Symbol":"HRL","Current Price":"32.94","Latest MA":"31.72","Price Target":"33.78","Difference from MA":"3.83%","Difference from Open":"-0.18%","Change from Yesterday":"-0.30%","Change from Last Report":"0.00","Latest Volume":"2,419,060","Market Cap":"18,084,487,168","Earning Date":"2024-12-04","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":17.837996,"ROE":0.10005,"DTE":36.305,"Stock Sentiment":"Sell","Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.254,"Trailing PEG":2.774,"Trailing PS":1.5094576,"Quick Ratio":"N\/A","Day High":33.11,"Day Low":32.63,"VS Average Volume":1.0330578865,"Company Summary":"Hormel Foods Corporation develops, processes, and distributes various meat, nuts, and other food products to retail, foodservice, deli, and commercial customers in the United States and internationally. It operates through three segments: Retail, Foodservice, and International segments. The company provides various perishable products that include fresh meats, frozen items, refrigerated meal solutions, sausages, hams, guacamoles, and bacons; and shelf-stable products comprising canned luncheon meats, nut butters, snack nuts, chili, shelf-stable microwaveable meals, hash, stews, tortillas, salsas, tortilla chips, nutritional food supplements, and others. It sells its products under the HORMEL, ALWAYS TENDER, APPLEGATE, AUSTIN BLUES, BACON 1, BLACK LABEL, BREAD READY, BURKE, CAFÉ H, CERATTI, CHI-CHI'S, COLUMBUS, COMPLEATS, CORN NUTS, CURE 81, DAN'S PRIZE, DI LUSSO, DINTY MOORE, DON MIGUEL, DOÑA MARIA, EMBASA, FAST \u0091N EASY, FIRE BRAISED, FONTANINI, HAPPY LITTLE PLANTS, HERDEZ, HORMEL GATHERINGS, HORMEL SQUARE TABLE, HORMEL VITAL CUISINE, HOUSE OF TSANG, JENNIE-O, JUSTIN'S, LA VICTORIA, LAYOUT, LLOYD'S, MARY KITCHEN, MR. PEANUT, NATURAL CHOICE, NUT-RITION, OLD SMOKEHOUSE, OVEN READY, PILLOW PACK, PLANTERS, ROSA GRANDE, SADLER'S SMOKEHOUSE, SKIPPY, SPAM, SPECIAL RECIPE, THICK & EASY, VALLEY FRESH, AND WHOLLY brands through sales personnel, independent brokers, and distributors. The company was formerly known as Geo. A. Hormel & Company and changed its name to Hormel Foods Corporation in January 1995. Hormel Foods Corporation was founded in 1891 and is headquartered in Austin, Minnesota.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"The Cooper Companies, Inc.","Symbol":"COO","Current Price":"94.85","Latest MA":"98.75","Price Target":"115.57","Difference from MA":"-3.95%","Difference from Open":"-1.62%","Change from Yesterday":"-1.93%","Change from Last Report":"0.00","Latest Volume":"1,779,827","Market Cap":"18,930,448,384","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":26.267616,"ROE":0.0465,"DTE":36.711,"Stock Sentiment":"Strong Buy","Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":0.99,"Trailing PEG":9.9299,"Trailing PS":4.9763274,"Quick Ratio":"N\/A","Day High":96.73,"Day Low":94.78,"VS Average Volume":1.3957664954,"Company Summary":"The Cooper Companies, Inc., together with its subsidiaries, develops, manufactures, and markets contact lens wearers. The company operates in two segments, CooperVision and CooperSurgical. The CooperVision segment provides spherical lense, including lenses that correct near and farsightedness; and toric and multifocal lenses comprising lenses correcting vision challenges, such as astigmatism, presbyopia, and myopia in the Americas, Europe, Middle East, Africa, and Asia Pacific. The CooperSurgical segment focuses on family and women's health care, which provides fertility products and services, medical devices, and contraception, as well as cryostorage, such as cord blood and cord tissue storage to health care professionals and patients worldwide. It offers surgical and office products, including endosee endometrial imaging products, fetal pillow cephalic elevation devices for use in cesarean sections, illuminated speculum products, lone star retractor systems, loop electrosurgical excision procedure products, mara water ablation systems, paragard contraceptive IUDs, point-of-care, and uterine positioning products, as well as cryostorage, such as cord blood and cord tissue storage; fertility products and services, such as fertility consumables and equipment, donor gamete services, and genomic services, including genetic testing. The company sells its products to distributors, group purchasing organizations, eye care and health care professionals, including independent practices, corporate retailers, hospitals and clinics, and authorized resellers. The Cooper Companies, Inc. was founded in 1958 and is headquartered in San Ramon, California.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Prologis, Inc.","Symbol":"PLD","Current Price":"111.13","Latest MA":"118.39","Price Target":"130.81","Difference from MA":"-6.13%","Difference from Open":"0.02%","Change from Yesterday":"-0.47%","Change from Last Report":"0.00","Latest Volume":"4,154,606","Market Cap":"102,925,819,904","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":41.47648,"ROE":0.05662,"DTE":57.079,"Stock Sentiment":"Strong Buy","Industry":"REIT—Industrial","Sector":"Real Estate","Beta":1.094,"Trailing PEG":0.5047,"Trailing PS":12.492195,"Quick Ratio":"N\/A","Day High":111.72,"Day Low":110.63,"VS Average Volume":1.1190595668,"Company Summary":"Prologis, Inc. is the global leader in logistics real estate with a focus on high-barrier, high-growth markets. At September 30, 2024, the company owned or had investments in, on a wholly owned basis or through co-investment ventures, properties and development projects expected to total approximately 1.2 billion square feet (116 million square meters) in 20 countries. Prologis leases modern logistics facilities to a diverse base of approximately 6,700 customers principally across two major categories: business-to-business and retail\/online fulfilment.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Synopsys, Inc.","Symbol":"SNPS","Current Price":"508.28","Latest MA":"543.75","Price Target":"647.33","Difference from MA":"-6.52%","Difference from Open":"0.10%","Change from Yesterday":"-0.67%","Change from Last Report":"0.00","Latest Volume":"1,215,481","Market Cap":"78,332,043,264","Earning Date":"2024-12-04","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":41.581245,"ROE":0.21819,"DTE":8.7,"Stock Sentiment":"Strong Buy","Industry":"Software—Infrastructure","Sector":"Technology","Beta":1.076,"Trailing PEG":10.7686,"Trailing PS":12.081868,"Quick Ratio":"N\/A","Day High":516.0,"Day Low":499.25,"VS Average Volume":1.1650885884,"Company Summary":"Synopsys, Inc. provides electronic design automation software products used to design and test integrated circuits. It operates in three segments: Design Automation, Design IP, and Software Integrity. The company offers Digital and Custom IC Design solution that provides digital design implementation solutions; Verification solution that offers virtual prototyping, static and formal verification, simulation, emulation, field programmable gate array (FPGA)-based prototyping, and debug solutions; and FPGA design products that are programmed to perform specific functions. It also provides intellectual property (IP) solutions for USB, PCI Express, DDR, Ethernet, MIPI, HDMI, and Bluetooth low energy applications; logic libraries and embedded memories; processor cores, software, and application-specific instruction-set processor tools for embedded applications; security IP solutions; IP solutions for automotive market; and system-on-chip (SoC) infrastructure IP, datapath and building block IP, and verification IP products, as well as mathematical and floating-point components, and Arm AMBA interconnect fabric and peripherals. In addition, the company offers HAPS FPGA-based prototyping systems; virtual prototyping solutions; and Platform Architect solutions for SoC architecture analysis and optimization, as well as optical products, and mechatronic simulations. Further, it provides security and quality testing products, managed services, programs and professional services, and training that enable its customers to detect and remediate security vulnerabilities, and defects in the software development lifecycle, as well as manufacturing solutions. Additionally, the company provides intelligent orchestration solution, software risk manager, and black duck software composition analysis tools. It serves electronics, financial services, automotive, medicine, energy, and industrial areas. The company was incorporated in 1986 and is headquartered in Sunnyvale, California.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"UnitedHealth Group Incorporated","Symbol":"UNH","Current Price":"520.48","Latest MA":"557.02","Price Target":"641.12","Difference from MA":"-6.56%","Difference from Open":"0.94%","Change from Yesterday":"0.92%","Change from Last Report":"0.00","Latest Volume":"7,778,376","Market Cap":"478,989,418,496","Earning Date":"2025-01-10","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":18.176311,"ROE":0.15252,"DTE":74.683,"Stock Sentiment":"Strong Buy","Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.591,"Trailing PEG":1.4378,"Trailing PS":1.216024,"Quick Ratio":"N\/A","Day High":527.53,"Day Low":510.7398,"VS Average Volume":2.019281152,"Company Summary":"UnitedHealth Group Incorporated operates as a diversified health care company in the United States. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage, and health and well-being services to individuals age 50 and older addressing their needs; Medicaid plans, children's health insurance and health care programs; and health and dental benefits, and hospital and clinical services, as well as health care benefits products and services to state programs caring for the economically disadvantaged, medically underserved, and those without the benefit of employer-funded health care coverage. The Optum Health segment provides care delivery, care management, wellness and consumer engagement, and health financial services patients, consumers, care delivery systems, providers, employers, payers, and public-sector entities. The Optum Insight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The Optum Rx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and community health pharmacy services, infusion, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease\/drug therapy management. UnitedHealth Group Incorporated was founded in 1974 and is based in Minnetonka, Minnesota.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"UiPath, Inc.","Symbol":"PATH","Current Price":"14.01","Latest MA":"13.14","Price Target":"15.81","Difference from MA":"6.59%","Difference from Open":"-0.64%","Change from Yesterday":"-1.55%","Change from Last Report":"0.00","Latest Volume":"7,816,302","Market Cap":"7,699,881,984","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":-75.80349,"ROE":-0.058920003,"DTE":4.505,"Stock Sentiment":"Hold","Industry":"Software—Infrastructure","Sector":"Technology","Beta":0.87,"Trailing PEG":0.8169,"Trailing PS":5.569378,"Quick Ratio":"N\/A","Day High":14.14,"Day Low":13.625,"VS Average Volume":0.9062153233,"Company Summary":"UiPath Inc. provides an end-to-end automation platform that offers a range of robotic process automation (RPA) solutions primarily in the United States, Romania, the United Kingdom, the Netherlands, and internationally. The company offers a suite of interrelated software to build, manage, run, engage, measure, and govern automation within the organization. Its platform's embedded AI, ML, and NLP capabilities improve decisioning and information processing; emulate human behavior allows organizations to address a myriad of use cases; emulate human behavior allows organizations to address a myriad of use cases; multi-tenant platform enterprise deployment with security and governance and Automation Cloud, which enables customers to begin automating without the need to provision infrastructure, install applications, or perform additional configurations; intuitive interface and low-code, drag-and-drop functionality; signed to enable people and automations to work together; and tracks, measures, and forecasts the performance of automations, enables customers to gain powerful insights and generate key performance indicators with actionable metric. It serves banking and financial services, healthcare, insurance, public sectors, manufacturing, retail, and telecom industries. The company was founded in 2005 and is headquartered in New York, New York.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Zscaler, Inc.","Symbol":"ZS","Current Price":"198.54","Latest MA":"185.81","Price Target":"226.32","Difference from MA":"6.85%","Difference from Open":"-3.79%","Change from Yesterday":"-3.79%","Change from Last Report":"0.00","Latest Volume":"1,887,950","Market Cap":"30,463,778,816","Earning Date":"2024-12-02","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":-1694.461,"ROE":-0.057729997,"DTE":97.464,"Stock Sentiment":"Strong Buy","Industry":"Software—Infrastructure","Sector":"Technology","Beta":0.814,"Trailing PEG":3.5078,"Trailing PS":14.053043,"Quick Ratio":"N\/A","Day High":206.76,"Day Low":197.46,"VS Average Volume":1.0882691508,"Company Summary":"Zscaler, Inc. operates as a cloud security company worldwide. The company offers Zscaler Internet Access solution that provides users, workloads, IoT, and OT devices secure access to externally managed applications, including software-as-a-service (SaaS) applications and internet destinations; and Zscaler Private Access solution, which is designed to provide access to managed applications hosted internally in data centers, and private or public clouds. It also provides Zscaler Digital Experience that measures end-to-end user experience across business applications, as well as provides an easy-to-understand digital experience score for each user, application, and location within an enterprise. In addition, the company offers Posture Control solutions comprising cloud applications and workload data security to protect data in public cloud environments; and Cloud Infrastructure Entitlement Management that provides deep granularity into identity and privilege access management. Further, it provides Workload Segmentation solutions that secures application-to-application communications inside public clouds and data centers; and Zero Trust Device Segmentation solutions that offers agentless segmentation for enterprise IT and OT environments, as well as Zero Trust SD-WAN solutions. Its platform modules include Zscaler Central Authority, Zscaler Enforcement Node, and Zscaler Log Servers. The company serves customers in airlines and transportation, conglomerates, consumer goods and retail, financial services, healthcare, manufacturing, media and communications, public sector and education, technology, and telecommunications services industries. The company was formerly known as SafeChannel, Inc., and changed its name to Zscaler, Inc. in August 2008. Zscaler, Inc. was incorporated in 2007 and is headquartered in San Jose, California.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"10.39","Latest MA":"11.17","Price Target":"9.94","Difference from MA":"-7.01%","Difference from Open":"7.67%","Change from Yesterday":"6.78%","Change from Last Report":"0.00","Latest Volume":"38,948,975","Market Cap":"8,971,640,832","Earning Date":"2025-01-02","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":448.03796,"ROE":-0.75969005,"DTE":277.898,"Stock Sentiment":"Hold","Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PS":0.0607596,"Quick Ratio":"N\/A","Day High":10.45,"Day Low":9.41,"VS Average Volume":1.6447670412,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Core & Main, Inc.","Symbol":"CNM","Current Price":"52.21","Latest MA":"48.66","Price Target":"61.17","Difference from MA":"7.30%","Difference from Open":"-0.72%","Change from Yesterday":"-0.36%","Change from Last Report":"0.00","Latest Volume":"1,843,963","Market Cap":"10,372,716,544","Earning Date":"2024-12-03","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":20.543633,"ROE":0.23443002,"DTE":153.547,"Stock Sentiment":"Buy","Industry":"Industrial Distribution","Sector":"Industrials","Beta":1.027,"Trailing PEG":null,"Trailing PS":1.4877677,"Quick Ratio":"N\/A","Day High":55.77,"Day Low":51.53,"VS Average Volume":0.717393165,"Company Summary":"Core & Main, Inc. distributes water, wastewater, storm drainage, and fire protection products and related services to municipalities, private water companies, and professional contractors in the municipal, non-residential, and residential end markets in the United States. Its products portfolio include pipes, valves, hydrants, fittings, and other products and services; storm drainage products, such as corrugated piping systems, retention basins, inline drains, manholes, grates, geosynthetics, erosion control, and other related products; fire protection products, including fire protection pipes, and sprinkler heads and devices, as well as fabrication services; and meter products, such as smart meter products, meter sets, meter accessories, installation, software, and other services. The company's specialty products and services are used in the maintenance, repair, replacement, and construction of water, wastewater, storm drainage, and fire protection infrastructure. Core & Main, Inc. was founded in 1874 and is headquartered in Saint Louis, Missouri.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Ferguson Enterprises Inc.","Symbol":"FERG","Current Price":"187.49","Latest MA":"203.02","Price Target":"226.46","Difference from MA":"-7.65%","Difference from Open":"-1.36%","Change from Yesterday":"-1.50%","Change from Last Report":"0.00","Latest Volume":"1,253,022","Market Cap":"37,626,617,856","Earning Date":"2024-12-10","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.158592,"ROE":0.32573003,"DTE":98.237,"Stock Sentiment":"Strong Buy","Industry":"Industrial Distribution","Sector":"Industrials","Beta":1.2,"Trailing PEG":1.5716,"Trailing PS":1.2696682,"Quick Ratio":"N\/A","Day High":190.315,"Day Low":186.63,"VS Average Volume":0.7253303726,"Company Summary":"Ferguson Enterprises Inc. distributes plumbing and heating products in the United States and Canada. The company provides expertise, solutions, and products, including infrastructure, plumbing, appliances, fire, and fabrication, as well as heating, ventilation, and air conditioning (HVAC) to residential and non-residential customers. It also supplies specialist water and wastewater treatment products to residential, commercial, and infrastructure contractors, as well as supplies pipe, valves, and fittings solutions to industrial customers. In addition, it offers customized solutions, such as virtual design, fabrication, valve actuation, pre-assembly, kitting, installation, and project management services, as well as after-sales support that comprises warranty, credit, project-based billing, returns and maintenance, and repair and operations support. The company sells its products through a network of distribution centers, branches, counter service and specialist sales associates, showroom consultants, and e-commerce channels. Ferguson Enterprises Inc. was founded in 1953 and is headquartered in Newport News, Virginia.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Five Below, Inc.","Symbol":"FIVE","Current Price":"103.95","Latest MA":"96.51","Price Target":"122.80","Difference from MA":"7.71%","Difference from Open":"-0.97%","Change from Yesterday":"0.15%","Change from Last Report":"0.00","Latest Volume":"1,901,416","Market Cap":"5,718,247,936","Earning Date":"2024-12-04","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.304518,"ROE":0.18456,"DTE":117.836,"Stock Sentiment":"Buy","Industry":"Specialty Retail","Sector":"Consumer Cyclical","Beta":1.203,"Trailing PEG":0.8191,"Trailing PS":1.5387878,"Quick Ratio":"N\/A","Day High":106.44,"Day Low":101.64,"VS Average Volume":1.0577855118,"Company Summary":"Five Below, Inc. operates as a specialty value retailer in the United States. The company offers range of accessories, which includes novelty socks, sunglasses, jewelry, scarves, gloves, hair accessories, athletic tops and bottoms, and t-shirts, as well as nail polish, lip gloss, fragrance, and branded cosmetics; and personalized living space products, such as lamps, posters, frames, fleece blankets, plush items, pillows, candles, incense, lighting, novelty décor, accent furniture, and related items, as well as provides storage options. It provides assortment of sports balls, team sports merchandise, and fitness accessories comprising hand weights, jump ropes, and gym balls; various games, such as board games, puzzles, collectibles, and toys, including remote control; and summer season sports, which includes pool, beach, and outdoor toys, as well as games and accessories. In addition, the company offers accessories for cell phones, tablets, audio, and computers, as well as cases, chargers, headphones, and other related items; and media products including books, video games, and DVDs. It also provides assortment of craft activity kits, and arts and crafts supplies, such as crayons, markers, and stickers; and school products comprising backpacks, fashion notebooks and journals, novelty pens and pencils, and locker accessories. Further, the company offers party products, which includes party goods, decorations, gag gifts, and greeting cards, as well as every day and special occasion merchandise; assortment of classic and novelty candy bars, movie-size box candy, seasonal-related candy, and gum and snack food products, as well as sells chilled drinks through coolers; and provides seasonally specific items used to celebrate and decorate for events. The company was formerly known as Cheap Holdings, Inc. and changed its name to Five Below, Inc. in August 2002. Five Below, Inc. was incorporated in 2002 and is headquartered in Philadelphia, Pennsylvania.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"The Campbell's Company","Symbol":"CPB","Current Price":"42.99","Latest MA":"46.81","Price Target":"47.94","Difference from MA":"-8.17%","Difference from Open":"0.44%","Change from Yesterday":"0.16%","Change from Last Report":"0.00","Latest Volume":"2,372,965","Market Cap":"12,815,706,112","Earning Date":"2024-12-04","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.3261,"ROE":0.15203,"DTE":198.683,"Stock Sentiment":"Buy","Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.181,"Trailing PEG":0.6887,"Trailing PS":1.329982,"Quick Ratio":"N\/A","Day High":43.26,"Day Low":42.58,"VS Average Volume":1.0219474307,"Company Summary":"The Campbell's Company, together with its subsidiaries, manufactures and markets food and beverage products in the United States and internationally. The company operates through Meals & Beverages and Snacks segments. The Meals & Beverages segment engages in the retail and foodservice businesses in the United States and Canada. This segment provides Campbell's condensed and ready-to-serve soups; Swanson broth and stocks; Pacific Foods broth, soups, and non-dairy beverages; Prego pasta sauces; Pace Mexican sauces; Campbell's gravies, pasta, beans, and dinner sauces; Swanson canned poultry; V8 juices and beverages; Campbell's tomato juice; Rao's pasta sauces, dry pasta, frozen entrées, frozen pizza and soups; Michael Angelo's frozen entrées and pasta sauces; and noosa yogurts, as well as snacking products in foodservice in Canada. The Snacks segment retails Pepperidge Farm cookies, crackers, fresh bakery, and frozen products, that includes Goldfish crackers, Snyder's of Hanover pretzels, Lance sandwich crackers, Cape Cod and Kettle Brand potato chips, Late July snacks, Snack Factory pretzel crisps, and other snacking products. This segment is also involved in the retail business in Latin America. It sells its products through retail food chains, mass discounters and merchandisers, club stores, convenience stores, drug stores, and dollar stores, as well as e-commerce and other retail, commercial, and non-commercial establishments, and independent contractor distributors. The company was formerly known as Campbell Soup Company and changed its name to The Campbell's Company in November 2024. The company was founded in 1869 and is headquartered in Camden, New Jersey.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Nordson Corporation","Symbol":"NDSN","Current Price":"226.46","Latest MA":"246.68","Price Target":"261.00","Difference from MA":"-8.20%","Difference from Open":"0.09%","Change from Yesterday":"-1.16%","Change from Last Report":"0.00","Latest Volume":"720,284","Market Cap":"12,949,322,752","Earning Date":"2024-12-11","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":22.24995,"ROE":0.17406,"DTE":56.526,"Stock Sentiment":"Hold","Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":0.907,"Trailing PEG":1.9656,"Trailing PS":4.8594847,"Quick Ratio":"N\/A","Day High":229.56,"Day Low":223.83,"VS Average Volume":3.0204639616,"Company Summary":"Nordson Corporation engineers, manufactures, and markets products and systems to dispense, apply, and control adhesives, coatings, polymers, sealants, biomaterials, and other fluids worldwide. It operates through three segments: Industrial Precision Solutions; Medical and Fluid Solutions; and Advanced Technology Solutions. The Industrial Precision Solutions segment provides dispensing, coating, and laminating systems for adhesives, lotions, liquids, and fibers to disposable products and roll goods; automated adhesive dispensing systems used in packaged goods industries; components and systems used in the thermoplastic and biopolymer melt stream; precision agriculture spraying solutions; fluid components, such as nozzles, pumps, and filters; and product assembly systems for use in paper and paperboard converting applications, and manufacturing roll goods. It also offers automated and manual dispensing products and systems for cold materials, container coating, liquid finishing, and powder coating, as well as ultraviolet equipment used primarily in curing and drying operations. The Medical and Fluid Solutions segment offers medical devices, including cannulas, catheters, and medical balloons; single-use plastic components; precision manual and semi-automated dispensers; minimally invasive interventional delivery devices; and plastic molded syringes, cartridges, tips, and fluid connection components. The Advanced Technology Solutions segment provides automated dispensing systems for the attachment, protection, and coating of fluids, as well as related gas plasma treatment systems for cleaning and conditioning surfaces; and bond testing and automated optical, acoustic microscopy, and x-ray inspection systems for use in semiconductor and printed circuit board industries. The company markets its products through direct sales force, as well as distributors and sales representatives. Nordson Corporation was founded in 1909 and is headquartered in Westlake, Ohio.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Signet Jewelers Limited","Symbol":"SIG","Current Price":"84.07","Latest MA":"91.62","Price Target":"107.20","Difference from MA":"-8.24%","Difference from Open":"-1.06%","Change from Yesterday":"-1.19%","Change from Last Report":"0.00","Latest Volume":"642,853","Market Cap":"3,656,322,048","Earning Date":"2024-12-05","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":7.747573,"ROE":0.26830998,"DTE":48.797,"Stock Sentiment":"Hold","Industry":"Luxury Goods","Sector":"Consumer Cyclical","Beta":2.129,"Trailing PEG":null,"Trailing PS":0.53057075,"Quick Ratio":"N\/A","Day High":84.97,"Day Low":83.05,"VS Average Volume":0.6721071352,"Company Summary":"Signet Jewelers Limited operates as a diamond jewelry retailer. It operates through three segments: North America, International, and Other. The North America segment operates jewelry stores in jewelry stores in malls, mall-based kiosks, and off-mall locations in the United States and Canada primarily under the Kay Jewelers, Kay Jewelers Outlet, Jared The Galleria Of Jewelry, Jared Vault, Zales Jewelers, Zales Outlet, Diamonds Direct, James Allen, Banter by Piercing Pagoda, and Peoples Jewellers names, as well as operates online through its digital banners, James Allen and Blue Nile. This segment also engages in jewelry subscription business. The International segment operates stores in shopping malls and off-mall locations primarily under the H.Samuel and Ernest Jones brands in the United Kingdom, Republic of Ireland, and Channel Islands. The Other segment is involved in the purchase and conversion of rough diamonds to polished stones, as well as the provision of diamond polishing services. Signet Jewelers Limited is headquartered in Hamilton, Bermuda.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Samsara Inc.","Symbol":"IOT","Current Price":"46.08","Latest MA":"42.57","Price Target":"55.00","Difference from MA":"8.25%","Difference from Open":"-0.30%","Change from Yesterday":"-0.75%","Change from Last Report":"0.00","Latest Volume":"3,923,109","Market Cap":"25,860,005,888","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":-132.29974,"ROE":-0.27858,"DTE":9.091,"Stock Sentiment":"Strong Buy","Industry":"Software—Infrastructure","Sector":"Technology","Beta":1.521,"Trailing PEG":null,"Trailing PS":23.622139,"Quick Ratio":"N\/A","Day High":46.39,"Day Low":45.0,"VS Average Volume":1.2762552205,"Company Summary":"Samsara Inc. provides solutions that connects physical operations data to its connected operations cloud in the United States and internationally. The company's Connected Operations Cloud includes Data Platform, which ingests, aggregates, and enriches data from its IoT devices and has embedded capabilities for AI, workflows and analytics, alerts, API connections, and data security and privacy. Its applications include video-based safety that enables customers to build a safety program and protect their teams with AI-enabled video; vehicle telematics which provides visibility into real-time vehicle location and diagnostics with GPS tracking, routing and dispatch, fuel efficiency management, electric vehicle usage and charge planning, preventative maintenance, and insights to manage fuel and energy costs; and mobile apps and workflows that improves productivity for frontline workers and enables regulatory compliance for workers to see upcoming jobs, capture electronic documents, perform maintenance inspections, maintain compliance logs, and message with back-office administration. The company also provides equipment monitoring which offers visibility and management of unpowered and powered assets, ranging from generators and compressors to heavy construction equipment and trailers to improve operating efficiency, prevent unplanned downtime, and avoid critical safety and compliance issues; and site visibility that provides remote visibility into sites to improve onsite security, safety, and incident response times. It serves transportation, wholesale and retail trade, construction, field services, logistics, utilities and energy, healthcare and education, manufacturing, food and beverage, and other industries, as well as government. Samsara Inc. was incorporated in 2015 and is headquartered in San Francisco, California.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"KB Home","Symbol":"KBH","Current Price":"71.42","Latest MA":"78.00","Price Target":"83.69","Difference from MA":"-8.44%","Difference from Open":"-1.69%","Change from Yesterday":"-2.87%","Change from Last Report":"0.00","Latest Volume":"1,381,885","Market Cap":"5,237,549,568","Earning Date":"2025-01-08","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.931968,"ROE":0.15727,"DTE":42.959,"Stock Sentiment":"Sell","Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.815,"Trailing PEG":null,"Trailing PS":0.79306644,"Quick Ratio":"N\/A","Day High":73.1,"Day Low":70.87,"VS Average Volume":1.3023786882,"Company Summary":"KB Home operates as a homebuilding company in the United States. It operates through four segments: West Coast, Southwest, Central, and Southeast. It builds and sells various homes, including attached and detached single-family residential homes, townhomes, and condominiums primarily for first-time, first move-up, second move-up, and active adult homebuyers. The company also provides financial services, such as insurance products and title services, as well as mortgage banking services, including residential consumer mortgage loans to homebuyers. It has operations in Arizona, California, Colorado, Florida, Idaho, Nevada, North Carolina, Texas, and Washington. The company was formerly known as Kaufman and Broad Home Corporation and changed its name to KB Home in January 2001. KB Home was founded in 1957 and is based in Los Angeles, California.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Bruker Corporation","Symbol":"BRKR","Current Price":"57.73","Latest MA":"63.75","Price Target":"72.42","Difference from MA":"-9.44%","Difference from Open":"-1.43%","Change from Yesterday":"-1.35%","Change from Last Report":"0.00","Latest Volume":"1,529,330","Market Cap":"8,751,752,192","Earning Date":"2025-01-06","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":31.603956,"ROE":0.19725999,"DTE":132.635,"Stock Sentiment":"Strong Buy","Industry":"Medical Devices","Sector":"Healthcare","Beta":1.204,"Trailing PEG":null,"Trailing PS":2.7000747,"Quick Ratio":"N\/A","Day High":59.45,"Day Low":56.31,"VS Average Volume":1.0988997566,"Company Summary":"Bruker Corporation, together with its subsidiaries, develops, manufactures, and distributes scientific instruments, and analytical and diagnostic solutions in the United States, Europe, the Asia Pacific, and internationally. The company operates through four segments: Bruker Scientific Instruments (BSI) BioSpin, BSI CALID, BSI Nano, and Bruker Energy & Supercon Technologies. It offers life science tools, and single and multiple modality systems; life science mass spectrometry; MALDI Biotyper rapid pathogen identification platform and related test kits, DNA test strips, and fluorescence-based polymerase chain reaction technology; genotype and fluorotype molecular diagnostics kits; research, analytical, and process analysis instruments and solutions; SARS-CoV 2 testing for the diagnosis of COVID-19 infection; and Fluorotyper-SARS-CoV 2 plus kits. It also provides range of portable analytical and bioanalytical detection systems, and related products; X-ray instruments; analytical tools for electron microscopes, as well as handheld, portable, and mobile X-ray fluorescence spectrometry instruments; atomic force microscopy instrumentation; non-contact nanometer resolution solution topography; and automated X-ray metrology, automated AFM defect-detection, and photomask repair and cleaning equipment. In addition, the company offers advanced optical fluorescence microscopy instruments; products and services to support the multi-omics needs of researchers in translational research, drug, and biomarker discovery; superconducting materials, such as metallic low temperature superconductors; devices and complex tools based on metallic low temperature superconductors; and non-superconducting high technology tools, such as synchrotron and beamline instrumentation. The company was incorporated in 1991 and is headquartered in Billerica, Massachusetts.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Hewlett Packard Enterprise Comp","Symbol":"HPE","Current Price":"21.83","Latest MA":"19.87","Price Target":"23.93","Difference from MA":"9.88%","Difference from Open":"0.47%","Change from Yesterday":"0.00%","Change from Last Report":"0.00","Latest Volume":"8,031,187","Market Cap":"28,313,507,840","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.148733,"ROE":0.086660005,"DTE":53.696,"Stock Sentiment":"Strong Buy","Industry":"Communication Equipment","Sector":"Technology","Beta":1.206,"Trailing PEG":3.7849,"Trailing PS":0.97565496,"Quick Ratio":"N\/A","Day High":22.07,"Day Low":21.71,"VS Average Volume":0.5910227421,"Company Summary":"Hewlett Packard Enterprise Company provides solutions that allow customers to capture, analyze, and act upon data seamlessly in the Americas, Europe, the Middle East, Africa, the Asia Pacific, and Japan. It operates in six segments: Compute, HPC & AI, Storage, Intelligent Edge, Financial Services, and Corporate Investments and Other. The company offers general purpose servers for multi-workload computing and workload-optimized servers; HPE ProLiant rack and tower servers; HPE Synergy; HPE Alletra, HPE GreenLake, Zerto, HPE InfoSight, and HPE CloudPhysics storage products; HPE Cray EX, HPE Cray XD, and converged edge systems; and HPE Superdome Flex, HPE Nonstop, and HPE Integrity products. It also provides HPE Aruba products that includes hardware products, such as Wi-Fi access points, switches, and gateways; HPE Aruba Networking software and services comprising cloud-based management, network management and access control, analytics and assurance, software-defined wide-area networking, network security, analytics and assurance, and location services software; and professional and support services, as well as as-a-service and consumption models. In addition, the company offers leasing, financing, IT consumption, and utility programs and asset management services for customers to facilitate technology deployment models and the acquisition of various IT solutions, including hardware, software, and services from Hewlett Packard Enterprise and others; consultative-led services; HPE Ezmeral Container Platform; HPE Ezmeral Software Container Platform and HPE Ezmeral Software Data Fabric; OpsRamp; and Hewlett Packard Labs. It serves commercial and large enterprise groups, such as business and public sector enterprises; and through various partners comprising resellers, distribution partners, original equipment manufacturers, independent software vendors, systems integrators, and advisory firms. The company was founded in 1939 and is headquartered in Spring, Texas.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Adobe Inc.","Symbol":"ADBE","Current Price":"465.69","Latest MA":"519.63","Price Target":"588.34","Difference from MA":"-10.38%","Difference from Open":"-1.70%","Change from Yesterday":"-1.88%","Change from Last Report":"0.00","Latest Volume":"11,395,512","Market Cap":"204,996,739,072","Earning Date":"2024-12-11","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":25.47619,"ROE":0.35355,"DTE":41.788,"Stock Sentiment":"Strong Buy","Industry":"Software—Infrastructure","Sector":"Technology","Beta":1.299,"Trailing PEG":1.5231,"Trailing PS":9.7864485,"Quick Ratio":"N\/A","Day High":474.91,"Day Low":456.8,"VS Average Volume":3.501957105,"Company Summary":"Adobe Inc., together with its subsidiaries, operates as a diversified software company worldwide. It operates through three segments: Digital Media, Digital Experience, and Publishing and Advertising. The Digital Media segment offers products, services, and solutions that enable individuals, teams, and enterprises to create, publish, and promote content; and Document Cloud, a unified cloud-based document services platform. Its flagship product is Creative Cloud, a subscription service that allows members to access its creative products. This segment serves content creators, students, workers, marketers, educators, enthusiasts, and communicators. The Digital Experience segment provides an integrated platform and set of applications and services that enable brands and businesses to create, manage, execute, measure, monetize, and optimize customer experiences from analytics to commerce. This segment serves marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers, and executives across the C-suite. The Publishing and Advertising segment offers products and services, such as e-learning solutions, technical document publishing, web conferencing, document and forms platform, web application development, and high-end printing, as well as Advertising Cloud offerings. It also provides consulting, technical support, and learning services. The company offers its products and services directly to enterprise customers through its sales force and local field offices, as well as to end users through app stores and through its website at adobe.com. It also distributes products and services through distributors, value-added resellers, systems integrators, software vendors and developers, retailers, and original equipment manufacturers. The company was formerly known as Adobe Systems Incorporated and changed its name to Adobe Inc. in October 2018. Adobe Inc. was founded in 1982 and is headquartered in San Jose, California.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"239.94","Latest MA":"215.43","Price Target":"250.11","Difference from MA":"11.38%","Difference from Open":"-0.88%","Change from Yesterday":"-0.66%","Change from Last Report":"0.00","Latest Volume":"5,129,926","Market Cap":"675,512,713,216","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.172534,"ROE":0.16216,"DTE":"N\/A","Stock Sentiment":"Strong Buy","Industry":"Banks—Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":4.7749,"Trailing PS":4.166025,"Quick Ratio":"N\/A","Day High":242.69,"Day Low":239.1437,"VS Average Volume":0.6005598047,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"71.01","Latest MA":"63.63","Price Target":"82.14","Difference from MA":"11.60%","Difference from Open":"-0.98%","Change from Yesterday":"-0.59%","Change from Last Report":"0.00","Latest Volume":"7,497,738","Market Cap":"134,298,378,240","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.765026,"ROE":0.03874,"DTE":"N\/A","Stock Sentiment":"Strong Buy","Industry":"Banks—Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.7833,"Trailing PS":1.9377038,"Quick Ratio":"N\/A","Day High":71.91,"Day Low":70.77,"VS Average Volume":0.5508504611,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Pure Storage, Inc.","Symbol":"PSTG","Current Price":"63.70","Latest MA":"57.00","Price Target":"73.00","Difference from MA":"11.75%","Difference from Open":"0.03%","Change from Yesterday":"1.89%","Change from Last Report":"0.00","Latest Volume":"3,643,885","Market Cap":"20,781,295,616","Earning Date":"2024-12-03","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":115.27743,"ROE":0.111899994,"DTE":19.292,"Stock Sentiment":"Strong Buy","Industry":"Computer Hardware","Sector":"Technology","Beta":1.103,"Trailing PEG":1.8588,"Trailing PS":6.9043303,"Quick Ratio":"N\/A","Day High":64.26,"Day Low":62.1418,"VS Average Volume":1.2010069133,"Company Summary":"Pure Storage, Inc. engages in the provision of data storage and management technologies, products, and services in the United States and internationally. Its Purity software is shared across its products and provides enterprise-class data services, such as always-on data reduction, data protection, and encryption, as well as storage protocols, including block, file, and object. The company also provides FlashArray integrated hardware systems, including FlashArray\/\/X, FlashArray\/\/C, FlashArray\/\/XL, FlashArray\/\/E, and FlashArray File Services for block-oriented storage, addressing databases, applications, virtual machines, and other traditional workloads; and FlashBlade integrated hardware systems comprising FlashBlade\/\/S and FlashBlade\/\/E for managing and processing unstructured data workloads of various types from real-time log analytics and commercial high-performance computing (HPC) to data protection and recovery. In addition, it offers cloud-native storage solutions, such as Portworx by Pure Storage, a cloud-native Kubernetes data management solution; and Portworx Data Services, a Database-as-a-Service platform for Kubernetes. Further, the company provides Pure Fusion, a Software-as-a-Service (SaaS) management plane, which enables storage administrators to unify storage arrays and optimize storage pools; Evergreen Architecture comprising Pure1, an AI-driven cloud-based management platform, as well as Evergreen\/\/One and Evergreen\/\/Flex data storage solutions; and Cloud Block Store, a virtual block storage array, that provides customers the flexibility to operate a hybrid cloud model with seamless data mobility across on-premises and public cloud environments. It sells its products and subscription services through direct sales force and channel partners. The company was formerly known as OS76, Inc. and changed its name to Pure Storage, Inc. in January 2010. Pure Storage, Inc. was incorporated in 2009 and is headquartered in Santa Clara, California.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Veeva Systems Inc.","Symbol":"VEEV","Current Price":"228.78","Latest MA":"204.31","Price Target":"270.00","Difference from MA":"11.98%","Difference from Open":"-1.41%","Change from Yesterday":"-1.59%","Change from Last Report":"0.00","Latest Volume":"694,578","Market Cap":"37,142,433,792","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":49.152115,"ROE":0.13179,"DTE":1.043,"Stock Sentiment":"Strong Buy","Industry":"Health Information Services","Sector":"Healthcare","Beta":0.813,"Trailing PEG":1.2761,"Trailing PS":14.431819,"Quick Ratio":"N\/A","Day High":232.595,"Day Low":227.465,"VS Average Volume":0.6812774209,"Company Summary":"Veeva Systems Inc. provides cloud-based software for the life sciences industry. It offers Veeva Commercial Cloud, a suite of software and analytics solutions, such as Veeva customer relationship management (CRM) that enable customer-facing employees at pharmaceutical and biotechnology companies; Veeva Vault PromoMats, an end-to-end content and digital asset management solution; Veeva Vault Medical that provides source of medical content across multiple channels and geographies; Veeva Crossix, an analytics platform for pharmaceutical brands; Veeva OpenData, a customer reference data solution; Veeva Link, a data application that allows link to generate real-time intelligence; and Veeva Compass includes de-identified and longitudinal patient data for the United States. The company also provides Veeva Development Cloud, a suite of applications for the clinical, regulatory, quality, and safety functions, including Veeva Vault Clinical, Veeva Vault RIM, Veeva Vault Safety, and Veeva Vault Quality; Veeva QualityOne, a quality and document management, and training solution; Veeva RegulatoryOne, a solution that helps companies to manage regulatory submission content; and Veeva Claims addresses the end-to-end product and marketing claims management process. In addition, it offers professional and support services, including implementation and deployment planning and project management; requirements analysis, solution design, and configuration; systems environment management and deployment services; services focused on advancing or transforming business and operating processes related to Veeva solutions; data migration and systems integrations technical consulting services; training on its solutions; and ongoing managed services, such as outsourced systems administration. The company was formerly known as Verticals onDemand, Inc. and changed its name to Veeva Systems Inc. in April 2009. Veeva Systems Inc. was incorporated in 2007 and is headquartered in Pleasanton, California.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"The Simply Good Foods Company","Symbol":"SMPL","Current Price":"39.67","Latest MA":"35.39","Price Target":"39.90","Difference from MA":"12.10%","Difference from Open":"0.28%","Change from Yesterday":"0.15%","Change from Last Report":"0.00","Latest Volume":"944,050","Market Cap":"4,007,740,928","Earning Date":"2025-01-02","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":21.630316,"ROE":0.08447,"DTE":25.315,"Stock Sentiment":"Buy","Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.644,"Trailing PEG":null,"Trailing PS":3.0103493,"Quick Ratio":"N\/A","Day High":39.67,"Day Low":39.21,"VS Average Volume":1.0831615168,"Company Summary":"The Simply Good Foods Company, a consumer-packaged food and beverage company, engages in the development, marketing, and sale of snacks and meal replacements, and other products in North America and internationally. The company offers protein bars, ready-to-drink shakes, sweet and salty snacks, cookies, muffins, protein chips and crackers, protein powders, and recipes under the Quest, Atkins, and OWYN brand names. It also provides confectionery products, such as full-size and mini peanut butter cups, brownies, caramel candy bites, chocolatey coated peanut candies, and caramel candy bars. In addition, the company licenses certain products that contain its brands and logos; and distributes its products to various retail channels, such as mass merchandise, grocery and drug stores, club and convenience stores, gas stations, and other channels. It also sells its products through e-commerce channels, including questnutrition.com, atkins.com, liveowyn.com, amazon.com and others. The company was incorporated in 2017 and is headquartered in Denver, Colorado.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"79.54","Latest MA":"70.77","Price Target":"82.63","Difference from MA":"12.39%","Difference from Open":"-4.21%","Change from Yesterday":"-4.00%","Change from Last Report":"0.00","Latest Volume":"10,918,103","Market Cap":"145,602,740,224","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.875689,"ROE":0.12111,"DTE":144.242,"Stock Sentiment":"Strong Buy","Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":1.2802,"Trailing PS":7.7712817,"Quick Ratio":"N\/A","Day High":83.08,"Day Low":78.7128,"VS Average Volume":1.3882192689,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Costco Wholesale Corporation","Symbol":"COST","Current Price":"989.35","Latest MA":"878.25","Price Target":"1,017.47","Difference from MA":"12.65%","Difference from Open":"0.88%","Change from Yesterday":"0.10%","Change from Last Report":"0.00","Latest Volume":"2,951,921","Market Cap":"439,214,014,464","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":49.688686,"ROE":0.30267,"DTE":42.118,"Stock Sentiment":"Strong Buy","Industry":"Discount Stores","Sector":"Consumer Defensive","Beta":0.789,"Trailing PEG":6.0033,"Trailing PS":1.7261106,"Quick Ratio":"N\/A","Day High":1006.6799,"Day Low":965.73,"VS Average Volume":1.5780095913,"Company Summary":"Costco Wholesale Corporation, together with its subsidiaries, engages in the operation of membership warehouses in the United States, Puerto Rico, Canada, Mexico, Japan, the United Kingdom, Korea, Australia, Taiwan, China, Spain, France, Iceland, New Zealand, and Sweden. The company offers branded and private-label products in a range of merchandise categories. It offers merchandise, such as sundries, dry groceries, candies, coolers, freezers, deli, liquor, and tobacco; appliances, electronics, health and beauty aids, hardware, lawn and garden, sporting goods, tires, toys and seasonal products, office supplies, automotive care products, postages, tickets, apparel, small appliances, furniture, domestics, housewares, special order kiosks, and jewelry; and meat, produce, service deli, and bakery products. The company also operates gasoline, pharmacies, optical, food courts, hearing-aid centers, and tire installation centers; and offers business delivery, travel, grocery, and various other services online. It also operates e-commerce websites. The company was formerly known as Costco Companies, Inc. and changed its name to Costco Wholesale Corporation in August 1999. Costco Wholesale Corporation was founded in 1976 and is based in Issaquah, Washington.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Oracle Corporation","Symbol":"ORCL","Current Price":"173.39","Latest MA":"153.56","Price Target":"199.21","Difference from MA":"12.91%","Difference from Open":"-0.92%","Change from Yesterday":"-1.10%","Change from Last Report":"0.00","Latest Volume":"8,147,589","Market Cap":"484,964,892,672","Earning Date":"2024-12-09","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":32.898643,"ROE":1.55578,"DTE":749.978,"Stock Sentiment":"Strong Buy","Industry":"Software—Infrastructure","Sector":"Technology","Beta":1.013,"Trailing PEG":1.8641,"Trailing PS":9.011704,"Quick Ratio":"N\/A","Day High":176.14,"Day Low":171.64,"VS Average Volume":1.0277636322,"Company Summary":"Oracle Corporation offers products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning (ERP), Oracle Fusion cloud enterprise performance management, Oracle Fusion cloud supply chain and manufacturing management, Oracle Fusion cloud human capital management, Oracle Cerner healthcare, and NetSuite applications suite, as well as Oracle Fusion Sales, Service, and Marketing. The company also offers cloud-based industry solutions for various industries; Oracle application licenses; and Oracle license support services. In addition, it provides cloud and license business' infrastructure technologies, such as the Oracle Database and MySQL Database; Java, a software development language; and middleware, including development tools and others. The company's cloud and license business' infrastructure technologies also comprise cloud-based compute, storage, and networking capabilities; and Oracle autonomous database and MySQL HeatWave, as well as Internet-of-Things, digital assistant, and blockchain. Further, it provides hardware products and other hardware-related software offerings, including Oracle engineered systems, enterprise servers, storage solutions, industry-specific hardware, virtualization software, operating systems, management software, and related hardware services, as well as hardware support products; and consulting and customer services. The company markets and sells its cloud, license, hardware, support, and services offerings directly to businesses in various industries, government agencies, and educational institutions, as well as through indirect channels. Oracle Corporation was founded in 1977 and is headquartered in Austin, Texas.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"GameStop Corporation","Symbol":"GME","Current Price":"27.99","Latest MA":"24.34","Price Target":"10.00","Difference from MA":"15.00%","Difference from Open":"-2.47%","Change from Yesterday":"-2.64%","Change from Last Report":"0.00","Latest Volume":"6,531,461","Market Cap":"12,505,931,776","Earning Date":"2024-12-04","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":155.5,"ROE":0.015039999,"DTE":12.171,"Stock Sentiment":"Sell","Industry":"Specialty Retail","Sector":"Consumer Cyclical","Beta":-0.098,"Trailing PEG":null,"Trailing PS":2.7473488,"Quick Ratio":"N\/A","Day High":28.86,"Day Low":27.922,"VS Average Volume":0.6049436458,"Company Summary":"GameStop Corp., a specialty retailer, provides games and entertainment products through its stores and ecommerce platforms in the United States, Canada, Australia, and Europe. The company sells new and pre-owned gaming platforms; accessories, such as controllers, gaming headsets, and virtual reality products; new and pre-owned gaming software; and in-game digital currency, digital downloadable content, and full-game downloads. It sells collectibles comprising apparel, toys, trading cards, gadgets, and other retail products for pop culture and technology enthusiasts, as well as engages in the digital asset wallet and NFT marketplace activities. The company operates stores and ecommerce sites under the GameStop, EB Games, and Micromania brands; and pop culture themed stores that sell collectibles, apparel, gadgets, electronics, toys, and other retail products under the Zing Pop Culture brand, as well as offers Game Informer magazine, a print and digital gaming publication. The company was formerly known as GSC Holdings Corp. GameStop Corp. was founded in 1996 and is headquartered in Grapevine, Texas.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"70.44","Latest MA":"61.10","Price Target":"75.95","Difference from MA":"15.29%","Difference from Open":"-0.58%","Change from Yesterday":"-0.51%","Change from Last Report":"0.00","Latest Volume":"11,472,639","Market Cap":"234,529,275,904","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.687046,"ROE":0.099139996,"DTE":"N\/A","Stock Sentiment":"Strong Buy","Industry":"Banks—Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.2839,"Trailing PS":3.0116117,"Quick Ratio":"N\/A","Day High":71.05,"Day Low":70.0202,"VS Average Volume":0.640832211,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"The Bank of New York Mellon Cor","Symbol":"BK","Current Price":"78.83","Latest MA":"68.32","Price Target":"85.61","Difference from MA":"15.38%","Difference from Open":"-1.57%","Change from Yesterday":"-0.93%","Change from Last Report":"0.00","Latest Volume":"2,964,827","Market Cap":"57,315,561,472","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.160113,"ROE":0.08563,"DTE":"N\/A","Stock Sentiment":"Strong Buy","Industry":"Banks—Diversified","Sector":"Financial Services","Beta":1.06,"Trailing PEG":0.7147,"Trailing PS":3.2197943,"Quick Ratio":"N\/A","Day High":79.98,"Day Low":78.55,"VS Average Volume":0.7654654999,"Company Summary":"The Bank of New York Mellon Corporation provides a range of financial products and services in the United States and internationally. The company operates through Securities Services, Market and Wealth Services, Investment and Wealth Management, and other segments. The Securities Services segment offers custody, trust and depositary, accounting, exchange-traded funds, middle-office solutions, transfer agency, services for private equity and real estate funds, foreign exchange, securities lending, liquidity\/lending services, and data analytics. This segment also provides trustee, paying agency, fiduciary, escrow and other financial, issuer, and support services for brokers and investors. The Market and Wealth Services segment offers clearing and custody, investment, wealth and retirement solutions, technology and enterprise data management, trading, and prime brokerage services. This segment also provides integrated cash management solutions, including payments, foreign exchange, liquidity management, receivables processing and payables management, and trade finance and processing services. The Investment and Wealth Management segment offers investment management strategies and distribution of investment products, investment management, custody, wealth and estate planning, private banking, investment, and information management services. The Other segment engages in the provision of leasing, corporate treasury, derivative and other trading, corporate and bank-owned life insurance, renewable energy investment, and business exit services. It serves central banks and sovereigns, financial institutions, asset managers, insurance companies, corporations, local authorities and high net-worth individuals, and family offices. The Bank of New York Mellon Corporation was founded in 1784 and is headquartered in New York, New York.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Synovus Financial Corp.","Symbol":"SNV","Current Price":"54.16","Latest MA":"45.43","Price Target":"60.53","Difference from MA":"19.22%","Difference from Open":"-1.08%","Change from Yesterday":"-0.97%","Change from Last Report":"0.00","Latest Volume":"1,127,380","Market Cap":"7,672,576,000","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.786212,"ROE":0.07237,"DTE":"N\/A","Stock Sentiment":"Strong Buy","Industry":"Banks—Regional","Sector":"Financial Services","Beta":1.392,"Trailing PEG":null,"Trailing PS":4.382596,"Quick Ratio":"N\/A","Day High":54.98,"Day Low":54.11,"VS Average Volume":0.7918645954,"Company Summary":"Synovus Financial Corp. operates as the bank holding company for Synovus Bank that provides commercial and consumer banking products and services. It operates through four segments: Community Banking, Wholesale Banking, Consumer Banking, and Financial Management Services. The company's commercial banking services include treasury and asset management, capital market, and institutional trust services, as well as commercial, financial, and real estate lending services. Its consumer banking services comprise accepting customary types of demand and savings deposits accounts; mortgage, installment, and other consumer loans; investment and brokerage services; safe deposit services; automated banking services; automated fund transfers; internet-based banking services; and bank credit and debit card services, including Visa and MasterCard services. The company also offers various other financial services, including portfolio management for fixed-income securities, investment banking, execution of securities transactions as a broker\/dealer, trust management, and financial planning services, as well as provides individual investment advice on equity and other securities. The company was founded in 1888 and is headquartered in Columbus, Georgia.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"26.88","Latest MA":"22.45","Price Target":"26.47","Difference from MA":"19.72%","Difference from Open":"0.04%","Change from Yesterday":"-0.07%","Change from Last Report":"0.00","Latest Volume":"6,300,839","Market Cap":"59,717,681,152","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.789827,"ROE":0.083500005,"DTE":101.433,"Stock Sentiment":"Buy","Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":1.9682,"Trailing PS":3.9415011,"Quick Ratio":"N\/A","Day High":26.99,"Day Low":26.7,"VS Average Volume":0.4584390483,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Chewy, Inc.","Symbol":"CHWY","Current Price":"32.26","Latest MA":"26.94","Price Target":"36.30","Difference from MA":"19.75%","Difference from Open":"1.07%","Change from Yesterday":"1.22%","Change from Last Report":"0.00","Latest Volume":"4,931,991","Market Cap":"13,133,593,600","Earning Date":"2024-12-04","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":65.501205,"ROE":0.85163003,"DTE":112.679,"Stock Sentiment":"Strong Buy","Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":1.064,"Trailing PEG":0.6792,"Trailing PS":1.1614331,"Quick Ratio":"N\/A","Day High":32.52,"Day Low":31.73,"VS Average Volume":0.8544617816,"Company Summary":"Chewy, Inc., together with its subsidiaries, engages in the pure play e-commerce business in the United States. It provides pet food and treats, pet supplies and pet medications, and other pet-health products, as well as pet services for dogs, cats, fish, birds, small pets, horses, and reptiles through its retail websites and mobile applications. The company was founded in 2010 and is based in Plantation, Florida.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Ollie's Bargain Outlet Holdings","Symbol":"OLLI","Current Price":"112.77","Latest MA":"93.74","Price Target":"119.87","Difference from MA":"20.30%","Difference from Open":"1.25%","Change from Yesterday":"1.42%","Change from Last Report":"0.00","Latest Volume":"1,719,538","Market Cap":"6,910,195,712","Earning Date":"2024-12-10","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":29.508427,"ROE":0.13548,"DTE":31.499,"Stock Sentiment":"Strong Buy","Industry":"Discount Stores","Sector":"Consumer Defensive","Beta":0.844,"Trailing PEG":null,"Trailing PS":3.1180491,"Quick Ratio":"N\/A","Day High":113.4725,"Day Low":111.01,"VS Average Volume":1.5982396052,"Company Summary":"Ollie's Bargain Outlet Holdings, Inc. operates as a retailer of brand name merchandise in the United States. The company offers housewares, bed and bath, food, floor coverings, health and beauty aids, books and stationery, toys, and electronics; and other products, including hardware, candy, clothing, sporting goods, pet and lawn, and garden products. It provides its products primarily under the Ollie's, Ollie's Bargain Outlet, Good Stuff Cheap, Ollie's Army, Real Brands Real Cheap!, Real Brands! Real Bargains, Sarasota Breeze, Steelton Tools, American Way, and Middleton Home names. The company was formerly known as Bargain Holdings, Inc. and changed its name to Ollie's Bargain Outlet Holdings, Inc. in March 2015. The company was founded in 1982 and is headquartered in Harrisburg, Pennsylvania.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Devon Energy Corporation","Symbol":"DVN","Current Price":"33.88","Latest MA":"43.03","Price Target":"51.00","Difference from MA":"-21.26%","Difference from Open":"-0.35%","Change from Yesterday":"-0.73%","Change from Last Report":"0.00","Latest Volume":"8,456,367","Market Cap":"22,255,771,648","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.167307,"ROE":0.26279,"DTE":64.021,"Stock Sentiment":"Strong Buy","Industry":"Oil & Gas E&P","Sector":"Energy","Beta":2.071,"Trailing PEG":14.898,"Trailing PS":1.5318171,"Quick Ratio":"N\/A","Day High":34.25,"Day Low":33.39,"VS Average Volume":0.9578215489,"Company Summary":"Devon Energy Corporation, an independent energy company, engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. It operates in Delaware, Eagle Ford, Anadarko, Williston, and Powder River Basins. The company was founded in 1971 and is headquartered in Oklahoma City, Oklahoma.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"61.52","Latest MA":"50.43","Price Target":"78.22","Difference from MA":"21.99%","Difference from Open":"-1.24%","Change from Yesterday":"-0.18%","Change from Last Report":"0.00","Latest Volume":"5,750,099","Market Cap":"39,697,690,624","Earning Date":"2025-01-10","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":8.398302,"ROE":0.4067,"DTE":186.78,"Stock Sentiment":"Strong Buy","Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PS":0.65826005,"Quick Ratio":"N\/A","Day High":62.29,"Day Low":60.94,"VS Average Volume":0.6845566209,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Pinnacle Financial Partners, In","Symbol":"PNFP","Current Price":"117.70","Latest MA":"96.27","Price Target":"122.40","Difference from MA":"22.25%","Difference from Open":"-0.72%","Change from Yesterday":"-0.59%","Change from Last Report":"0.00","Latest Volume":"553,859","Market Cap":"9,091,760,128","Earning Date":"2025-01-14","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":15.615608,"ROE":0.06875,"DTE":"N\/A","Stock Sentiment":"Buy","Industry":"Banks—Regional","Sector":"Financial Services","Beta":1.037,"Trailing PEG":null,"Trailing PS":5.863677,"Quick Ratio":"N\/A","Day High":118.86,"Day Low":117.38,"VS Average Volume":1.0354149725,"Company Summary":"Pinnacle Financial Partners, Inc., together with its subsidiaries, operates as the bank holding company for Pinnacle Bank that provides various banking products and services to individuals, businesses, and professional entities in the United States. The company accepts various deposits, including savings, noninterest-bearing and interest-bearing checking, money market, and certificate of deposit accounts; and provides treasury management services, which includes online wire origination, enhanced ACH origination services, positive pay, zero balance and sweep accounts, automated bill pay services, electronic receivables processing, lockbox processing, and merchant card acceptance services. It offers equipment and working capital loans; commercial real estate loans comprising investment properties and business loans; secured and unsecured loans, such as installment and term, lines of credit, and residential first mortgage, as well as home equity loans and home equity lines of credit; and credit cards for consumers and businesses. The company also provides investment products; brokerage and investment advisory programs; and fiduciary and investment services, such as personal trust, investment management, estate administration, endowments, foundations, individual retirement accounts, escrow services, and custody. In addition, it offers insurance agency services primarily in the property and casualty area; merger and acquisition advisory services; and private debt, equity and mezzanine, and other middle-market advisory services. Further, the company provides telephone and online banking, mobile banking, debit and credit cards, direct deposit and remote deposit capture, mobile deposit option, automated teller machine, and cash management services. Pinnacle Financial Partners, Inc. was incorporated in 2000 and is headquartered in Nashville, Tennessee.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Discover Financial Services","Symbol":"DFS","Current Price":"176.00","Latest MA":"142.04","Price Target":"176.08","Difference from MA":"23.90%","Difference from Open":"-0.62%","Change from Yesterday":"0.20%","Change from Last Report":"0.00","Latest Volume":"1,032,687","Market Cap":"44,188,672,000","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.539847,"ROE":0.20263,"DTE":105.313,"Stock Sentiment":"Buy","Industry":"Credit Services","Sector":"Financial Services","Beta":1.402,"Trailing PEG":4.4679,"Trailing PS":3.7813344,"Quick Ratio":"N\/A","Day High":177.37,"Day Low":175.465,"VS Average Volume":0.6616446308,"Company Summary":"Discover Financial Services, through its subsidiaries, provides digital banking products and services, and payment services in the United States. It operates in two segments, Digital Banking and Payment Services. The Digital Banking segment offers Discover-branded credit cards to individuals; personal loans, home loans, and other consumer lending; and direct-to-consumer deposit products comprising savings accounts, certificates of deposit, money market accounts, IRA certificates of deposit, IRA savings accounts and checking accounts, and sweep accounts. The Payment Services segment operates the PULSE to access automated teller machines, debit, and electronic funds transfer network; and Diners Club International, a payments network that issues Diners Club branded charge cards and\/or provides card acceptance services, as well as offers payment transaction processing and settlement services. The company was incorporated in 1960 and is based in Riverwoods, Illinois.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Dollar General Corporation","Symbol":"DG","Current Price":"76.94","Latest MA":"104.29","Price Target":"88.80","Difference from MA":"-26.23%","Difference from Open":"-1.99%","Change from Yesterday":"-1.89%","Change from Last Report":"0.00","Latest Volume":"3,770,459","Market Cap":"16,921,107,456","Earning Date":"2024-12-05","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.822009,"ROE":0.20882,"DTE":250.873,"Stock Sentiment":"Strong Buy","Industry":"Discount Stores","Sector":"Consumer Defensive","Beta":0.449,"Trailing PEG":2.1746,"Trailing PS":0.42647168,"Quick Ratio":"N\/A","Day High":78.244,"Day Low":75.61,"VS Average Volume":0.9015927315,"Company Summary":"Dollar General Corporation, a discount retailer, provides various merchandise products in the southern, southwestern, midwestern, and eastern United States. It offers consumable products, including paper and cleaning products, such as paper towels, bath tissues, paper dinnerware, trash and storage bags, disinfectants, and laundry products; packaged food comprising cereals, pasta, canned soups, fruits and vegetables, condiments, spices, sugar, and flour; and perishables that include milk, eggs, bread, refrigerated and frozen food, beer, and wine. The company's consumable products also comprise snacks, such as candies, cookies, crackers, salty snacks, and carbonated beverages; health and beauty products, including over-the-counter medicines and personal care products, such as soaps, body washes, shampoos, cosmetics, and dental hygiene and foot care products; pet supplies and pet food; and tobacco products. In addition, it offers seasonal products comprising holiday items, toys, batteries, small electronics, greeting cards, stationery, prepaid phones and accessories, gardening supplies, hardware, and automotive and home office supplies; and home products that include kitchen supplies, cookware, small appliances, light bulbs, storage containers, frames, candles, craft supplies and kitchen, and bed and bath soft goods. Further, the company provides apparel, which comprise basic items for infants, toddlers, girls, boys, women, and men, as well as socks, underwear, disposable diapers, shoes, and accessories. The company was formerly known as J.L. Turner & Son, Inc. and changed its name to Dollar General Corporation in 1968. Dollar General Corporation was founded in 1939 and is based in Goodlettsville, Tennessee.","Row Color":"negative-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Salesforce, Inc.","Symbol":"CRM","Current Price":"354.31","Latest MA":"276.15","Price Target":"402.88","Difference from MA":"28.30%","Difference from Open":"-2.66%","Change from Yesterday":"-1.04%","Change from Last Report":"0.00","Latest Volume":"4,557,834","Market Cap":"339,074,678,784","Earning Date":"2024-12-03","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":48.561626,"ROE":0.09734,"DTE":21.148,"Stock Sentiment":"Strong Buy","Industry":"Software—Application","Sector":"Technology","Beta":1.288,"Trailing PEG":1.594,"Trailing PS":9.298634,"Quick Ratio":"N\/A","Day High":364.8,"Day Low":352.52,"VS Average Volume":0.7562196269,"Company Summary":"Salesforce, Inc. provides Customer Relationship Management (CRM) technology that brings companies and customers together worldwide. The company's service includes sales to store data, monitor leads and progress, forecast opportunities, gain insights through analytics and artificial intelligence, and deliver quotes, contracts, and invoices; and service that enables companies to deliver trusted and highly personalized customer support at scale. In addition, its platform offering comprise a flexible platform that enables companies of various sizes, locations, and industries to build business workflow and apps with customer; online learning platform that allows anyone to learn in-demand Salesforce skills; and Slack, an intelligent productivity platform. The company's marketing services enables companies to plan, personalize, automate, and optimize customer marketing journey, connecting interaction, and connected products; and commerce services, which empowers shopping experience across various customer touchpoint, such as mobile, web, social, and stores and provides click-to-code tools that offers customers to build and deploy solutions. Further, its analytics offering includes Tableau, an end-to-end analytics solution for range of enterprise use cases and intelligent analytics with AI models, spot trends, predict outcomes, creates summaries, timely recommendations, and take action from any device; and integration service including MuleSoft, which provides building blocks to deliver end-to-end and connected experiences. Additionally, the company provides data cloud, a hyperscale data engine native to Salesforce; vertical services to meet the needs of customers in industries, such as financial services, healthcare and life sciences, manufacturing and automotive and government; and offers salesforce starter for small and medium-sized businesses. Salesforce, Inc. was incorporated in 1999 and is headquartered in San Francisco, California.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Interactive Brokers Group, Inc.","Symbol":"IBKR","Current Price":"179.49","Latest MA":"138.83","Price Target":"199.00","Difference from MA":"29.28%","Difference from Open":"-0.83%","Change from Yesterday":"-0.45%","Change from Last Report":"0.00","Latest Volume":"797,154","Market Cap":"75,838,472,192","Earning Date":"2025-01-14","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":25.69002,"ROE":0.21709,"DTE":107.179,"Stock Sentiment":"Buy","Industry":"Capital Markets","Sector":"Financial Services","Beta":0.792,"Trailing PEG":13.6189,"Trailing PS":15.3426,"Quick Ratio":"N\/A","Day High":181.245,"Day Low":177.55,"VS Average Volume":0.7526547908,"Company Summary":"Interactive Brokers Group, Inc. operates as an automated electronic broker worldwide. The company engages in the execution, clearance, and settlement of trades in stocks, options, futures, foreign exchange instruments, bonds, mutual funds, exchange traded funds (ETFs), precious metals, and cryptocurrencies. It also custodies and services accounts for hedge and mutual funds, ETFs, registered investment advisors, proprietary trading groups, introducing brokers, and individual investors. In addition, the company offers custody, prime brokerage, securities, and margin lending services. It serves institutional and individual customers through electronic exchanges and market centers. The company was founded in 1977 and is headquartered in Greenwich, Connecticut.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"lululemon athletica inc.","Symbol":"LULU","Current Price":"391.63","Latest MA":"293.67","Price Target":"380.90","Difference from MA":"33.36%","Difference from Open":"1.19%","Change from Yesterday":"0.59%","Change from Last Report":"0.00","Latest Volume":"1,442,506","Market Cap":"47,694,270,464","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":25.956234,"ROE":0.43159,"DTE":36.186,"Stock Sentiment":"Strong Buy","Industry":"Apparel Retail","Sector":"Consumer Cyclical","Beta":1.237,"Trailing PEG":1.5418,"Trailing PS":4.7745404,"Quick Ratio":"N\/A","Day High":392.6,"Day Low":385.0,"VS Average Volume":0.6868507086,"Company Summary":"Lululemon Athletica Inc., together with its subsidiaries, designs, distributes, and retails athletic apparel, footwear, and accessories under the lululemon brand for women and men. It offers pants, shorts, tops, and jackets for healthy lifestyle, such as yoga, running, training, and other activities. It also provides fitness-inspired accessories. The company sells its products through a chain of company-operated stores; outlets; interactive workout platform; yoga and fitness studios, university campus retailers, and other partners; license and supply arrangements; and temporary locations, as well as through mobile apps and lululemon.com e-commerce website. It has operations in the United States, Canada, Mainland China, Australia, South Korea, Hong Kong, Japan, New Zealand, Taiwan, Singapore, Malaysia, Macau, Thailand, the Asia Pacific, the United Kingdom, Germany, France, Ireland, Spain, the Netherlands, Sweden, Norway, Switzerland, Europe, the Middle East, and Africa. Lululemon Athletica Inc. was founded in 1998 and is based in Vancouver, Canada.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Jefferies Financial Group Inc.","Symbol":"JEF","Current Price":"80.92","Latest MA":"59.28","Price Target":"88.75","Difference from MA":"36.51%","Difference from Open":"-0.70%","Change from Yesterday":"-0.20%","Change from Last Report":"0.00","Latest Volume":"1,153,852","Market Cap":"16,628,979,712","Earning Date":"2025-01-06","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":17.516098,"ROE":0.056739997,"DTE":295.803,"Stock Sentiment":"Buy","Industry":"Capital Markets","Sector":"Financial Services","Beta":1.292,"Trailing PEG":null,"Trailing PS":2.6603787,"Quick Ratio":"N\/A","Day High":81.87,"Day Low":80.43,"VS Average Volume":0.7208331251,"Company Summary":"Jefferies Financial Group Inc. operates as an investment banking and capital markets firm in the Americas, Europe, the Middle East, and the Asia-Pacific. The company operates in two segments, Investment Banking and Capital Markets, and Asset Management. It provides investment banking, advisory services with respect to mergers or acquisitions, debt financing, restructurings or recapitalizations, and private capital advisory transactions; underwriting and placement services related to corporate debt, municipal bonds, mortgage-backed and asset-backed securities, equity and equity-linked securities, and loan syndication services; and corporate lending services. The company also offers financing, securities lending, and other prime brokerage services; equities research, sales, and trading services; wealth management services; and online foreign exchange trading services. In addition, it provides investment grade distressed debt securities, U.S. and European government and agency securities, municipal bonds, leveraged loans, emerging markets debt, and interest rate and credit index derivative products; and manages and offers services to a diverse group of alternative asset management platforms across a spectrum of investment strategies and asset classes. The company was formerly known as Leucadia National Corporation and changed its name to Jefferies Financial Group Inc. in May 2018. Jefferies Financial Group Inc. was founded in 1962 and is headquartered in New York, New York.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Carnival Corporation","Symbol":"CCL","Current Price":"25.90","Latest MA":"18.88","Price Target":"27.12","Difference from MA":"37.18%","Difference from Open":"-1.46%","Change from Yesterday":"-1.07%","Change from Last Report":"0.00","Latest Volume":"12,118,377","Market Cap":"34,753,912,832","Earning Date":"2024-12-20","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":15.661376,"ROE":0.20120001,"DTE":352.355,"Stock Sentiment":"Strong Buy","Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.668,"Trailing PEG":null,"Trailing PS":1.4197439,"Quick Ratio":"N\/A","Day High":26.405,"Day Low":25.78,"VS Average Volume":0.4671774309,"Company Summary":"Carnival Corporation & plc engages in the provision of leisure travel services in North America, Australia, Europe, Asia, and internationally. The company operates through four segments: NAA Cruise Operations, Europe Cruise Operations, Cruise Support, and Tour and Other. It operates port destinations, private islands, and a solar park, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. The company offers its services under the Carnival Cruise Line, Princess Cruises, Holland America Line, Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises, and Cunard brand. Additionally, it sells its cruises primarily through travel agents, tour operators, vacation planners, and websites. Carnival Corporation & plc was founded in 1972 and is headquartered in Miami, Florida.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Broadcom Inc.","Symbol":"AVGO","Current Price":"224.80","Latest MA":"162.87","Price Target":"221.12","Difference from MA":"38.02%","Difference from Open":"5.20%","Change from Yesterday":"24.43%","Change from Last Report":"0.00","Latest Volume":"121,336,628","Market Cap":"1,049,946,423,296","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":42.671852,"ROE":0.12509,"DTE":166.032,"Stock Sentiment":"Strong Buy","Industry":"Semiconductors","Sector":"Technology","Beta":1.187,"Trailing PEG":1.671,"Trailing PS":22.427565,"Quick Ratio":"N\/A","Day High":228.7,"Day Low":211.11,"VS Average Volume":5.1260967824,"Company Summary":"Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides set-top box system-on-chips (SoCs); cable, digital subscriber line, and passive optical networking central office\/consumer premise equipment SoCs; wireless local area network access point SoCs; Ethernet switching and routing custom silicon solutions; serializer\/deserializer application specific integrated circuits; optical and copper, and physical layer devices; and fiber optic components and RF semiconductor devices. The company also offers RF front end modules and filter; Wi-Fi, Bluetooth, and global positioning system\/global navigation satellite system SoCs; custom touch controllers; inductive charging; attached small computer system interface, and redundant array of independent disks controllers and adapters; peripheral component interconnect express; fiber channel host bus adapters; read channel based SoCs; custom flash controllers; preamplifiers; optocouplers, industrial fiber optics, and motion control encoders and subsystems; light emitting diode, ethernet PHYs, switch ICs, and camera microcontrollers. Its products are used in various applications, including enterprise and data center networking, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was founded in 1961 and is headquartered in Palo Alto, California.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"DocuSign, Inc.","Symbol":"DOCU","Current Price":"94.48","Latest MA":"63.13","Price Target":"97.60","Difference from MA":"49.66%","Difference from Open":"-0.13%","Change from Yesterday":"-0.04%","Change from Last Report":"0.00","Latest Volume":"2,691,817","Market Cap":"19,087,134,720","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":73.678955,"ROE":0.70342004,"DTE":6.913,"Stock Sentiment":"Hold","Industry":"Software—Application","Sector":"Technology","Beta":0.898,"Trailing PEG":0.5751,"Trailing PS":6.6773863,"Quick Ratio":"N\/A","Day High":96.61,"Day Low":93.3901,"VS Average Volume":0.704872461,"Company Summary":"DocuSign, Inc. provides electronic signature solution in the United States and internationally. The company provides e-signature solution that enables sending and signing of agreements on various devices; Contract Lifecycle Management (CLM), which automates workflows across the entire agreement process; Document Generation streamlines the process of generating new, custom agreements; and Gen for Salesforce, which allows sales representatives to automatically generate agreements with a few clicks from within Salesforce. It also provides Identify, a signer-identification option for checking government-issued IDs; Standards-Based Signatures, which support signatures that involve digital certificates; Monitor that uses advanced analytics to track DocuSign eSignature web, mobile, and API account; Notary which enables notaries public to conduct remote online notarization transactions; and Web Forms, a web forms that quickly draft agreements using pre-populated data from completed forms or external systems via APIs. In addition, the company offers Rooms for Real Estate that provides a way for brokers and agents to manage the entire real estate transaction digitally. Signature and CLM are FedRAMP, an authorized version of DocuSign eSignature for U.S. federal government agencies; and life sciences modules that support compliance with the electronic signature practices. The company sells its products through direct and partner-assisted sales, and digital self-service purchasing. DocuSign, Inc. was incorporated in 2003 and is headquartered in San Francisco, California.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"RH","Symbol":"RH","Current Price":"446.04","Latest MA":"296.68","Price Target":"427.06","Difference from MA":"50.35%","Difference from Open":"0.47%","Change from Yesterday":"16.95%","Change from Last Report":"0.00","Latest Volume":"3,053,988","Market Cap":"8,297,592,832","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":36.386684,"ROE":"N\/A","DTE":"N\/A","Stock Sentiment":"Hold","Industry":"Specialty Retail","Sector":"Consumer Cyclical","Beta":2.43,"Trailing PEG":1.5765,"Trailing PS":2.7240055,"Quick Ratio":"N\/A","Day High":457.26,"Day Low":429.07,"VS Average Volume":4.5747900217,"Company Summary":"RH, together with its subsidiaries, operates as a retailer in the home furnishings market. The company offers products in various categories, including furniture, lighting, textiles, bathware, décor, outdoor and garden, baby, child, and teen furnishings. It provides its products through rh.com, rhbabyandchild.com, rhteen.com, rhmodern.com, and waterworks.com online channels, as well as operates RH Galleries, RH outlet stores, RH Guesthouse, and Waterworks showrooms in the United States, Canada, the United Kingdom, and Germany. The company was formerly known as Restoration Hardware Holdings, Inc. and changed its name to RH in January 2017. RH was incorporated in 2011 and is headquartered in Corte Madera, California.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Ciena Corporation","Symbol":"CIEN","Current Price":"89.72","Latest MA":"57.30","Price Target":"86.67","Difference from MA":"56.59%","Difference from Open":"2.94%","Change from Yesterday":"6.15%","Change from Last Report":"0.00","Latest Volume":"6,658,777","Market Cap":"12,799,096,832","Earning Date":"2024-12-12","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":39.933235,"ROE":0.047319997,"DTE":55.23,"Stock Sentiment":"Strong Buy","Industry":"Communication Equipment","Sector":"Technology","Beta":0.938,"Trailing PEG":null,"Trailing PS":3.1835935,"Quick Ratio":"N\/A","Day High":91.24,"Day Low":86.9,"VS Average Volume":3.1931817364,"Company Summary":"Ciena Corporation provides hardware and software services for delivery of video, data, and voice traffic metro, aggregation, and access communications network worldwide. The company's Networking Platforms segment offers convergence of coherent optical transport, open optical networking, optical transport network switching, IP routing, and switching services. Its products include 6500 Packet-Optical Platform, Waveserver stackable interconnect system, and the 6500 Reconfigurable line system, and the 5400 family of Packet-Optical platforms, as well as 8100 coherent routing platforms; 3000 family of service delivery switches and the 5000 family of service aggregation switches, as well as 8700 Packetwave Platform and 6500 Packet Transport System. This segment also sells operating system software and enhanced software features embedded in each of its products. The company's Blue Planet Automation Software and Services segment provides multi-domain service orchestration, inventory, route optimization and analysis, multi-cloud orchestration, and unified assurance and analytics services. Its Platform Software and Service segment offers MCP domain controller solution, and OneControl unified management system, as well as planning tools. The company's Global Services segment provides maintenance support and training, installation and deployment, and consulting and network design services. Ciena Corporation was incorporated in 1992 and is headquartered in Hanover, Maryland.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Marvell Technology, Inc.","Symbol":"MRVL","Current Price":"120.77","Latest MA":"76.50","Price Target":"120.41","Difference from MA":"57.86%","Difference from Open":"2.41%","Change from Yesterday":"10.79%","Change from Last Report":"0.00","Latest Volume":"36,722,464","Market Cap":"104,502,272,000","Earning Date":"2024-12-03","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":120.01748,"ROE":-0.06528,"DTE":30.791,"Stock Sentiment":"Strong Buy","Industry":"Semiconductors","Sector":"Technology","Beta":1.436,"Trailing PEG":null,"Trailing PS":19.79622,"Quick Ratio":"N\/A","Day High":121.86,"Day Low":115.1,"VS Average Volume":3.0357021574,"Company Summary":"Marvell Technology, Inc., together with its subsidiaries, provides data infrastructure semiconductor solutions, spanning the data center core to network edge. The company develops and scales complex System-on-a-Chip architectures, integrating analog, mixed-signal, and digital signal processing functionality. It offers a portfolio of Ethernet solutions, including controllers, network adapters, physical transceivers, and switches; single or multiple core processors; and custom application specific integrated circuits. The company also provides electro-optical products, including pulse amplitude modulations, coherent digital signal processors, laser drivers, trans-impedance amplifiers, silicon photonics, and data center interconnect solutions; fibre channel products comprising host bus adapters and controllers; storage controllers for hard disk drives and solid-state-drives; and host system interfaces, including serial attached SCSI, serial advanced technology attachment, peripheral component interconnect express, non-volatile memory express (NVMe), and NVMe over fabrics. It has operations in the United States, Argentina, China, India, Israel, Japan, Singapore, South Korea, Taiwan, and Vietnam. Marvell Technology, Inc. was incorporated in 1995 and is headquartered in Wilmington, Delaware.","Row Color":"positive-row","Last Updated":"16-12-2024 10:36:29"},{"Company Name":"Toro Company (The)","Symbol":"TTC","Current Price":"88.32","Latest MA":"87.78","Price Target":"97.40","Difference from MA":"0.62%","Difference from Open":"0.99%","Change from Yesterday":"0.67%","Change from Last Report":"0.00","Latest Volume":"871,248","Market Cap":"9,062,957,056","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.179153,"ROE":0.2565,"DTE":67.875,"Stock Sentiment":"Hold","Industry":"Tools & Accessories","Sector":"Industrials","Beta":0.694,"Trailing PEG":null,"Trailing PS":2.0180266,"Quick Ratio":"N\/A","Day High":88.33,"Day Low":87.11,"VS Average Volume":1.183411956,"Company Summary":"The Toro Company designs, manufactures, markets, and sells professional turf maintenance equipment and services. It operates through two segments: Professional and Residential. The Professional segment offers turf and landscape equipment products, including sports fields and grounds mowing and maintenance equipment, golf course mowing and maintenance equipment, landscape contractor mowing equipment, landscape creation and renovation equipment, and other maintenance equipment; rental, specialty, and underground construction equipment, such as horizontal directional drills, walk and ride trenchers, stand-on skid steers, vacuum excavators, stump grinders, turf renovation products, asset locators, pipe rehabilitation solutions, materials handling equipment, and other after-market tools; and snow and ice management equipment, such as snowplows, as well as stand-on snow and ice removal equipment, such as snowplow, snow brush, and snow thrower attachments, salt and sand spreaders, and related parts and accessories for light and medium duty trucks, utility task vehicles, skid steers, and front-end loaders. This segment also provides irrigation and lighting products that consist of sprinkler heads, electric and hydraulic valves, controllers, computer irrigation central control systems, coupling systems, and ag-irrigation drip tape and hose products, as well as professionally installed landscape lighting products offered through distributors and landscape contractors. The Residential segment provides walk power mowers, zero-turn riding mowers, snow throwers, replacement parts, and home solution products that include grass and hedge trimmers, leaf blowers, blower-vacuums, chainsaws, string trimmers, hoses, and hose-end retail irrigation products. It sells its products through a network of distributors, dealers, mass retailers, hardware retailers, equipment rental centers, home centers, and online. The company was founded in 1914 and is headquartered in Bloomington, Minnesota.","Row Color":"positive-row","Last Updated":"16-12-2024 10:37:32"},{"Company Name":"FedEx Corporation","Symbol":"FDX","Current Price":"283.42","Latest MA":"279.06","Price Target":"311.44","Difference from MA":"1.56%","Difference from Open":"0.03%","Change from Yesterday":"-0.10%","Change from Last Report":"0.00","Latest Volume":"791,434","Market Cap":"69,246,033,920","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.623032,"ROE":0.1507,"DTE":"N\/A","Stock Sentiment":"Strong Buy","Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":1.177,"Trailing PEG":1.1568,"Trailing PS":0.790561,"Quick Ratio":"N\/A","Day High":284.11,"Day Low":281.85,"VS Average Volume":0.4295251384,"Company Summary":"FedEx Corporation, together with its subsidiaries, provides transportation, e-commerce, and business services in the United States and internationally. It operates through FedEx Express, FedEx Ground, FedEx Freight, and FedEx Services segments. The FedEx Express segment offers express transportation, small-package ground delivery, and freight transportation services; and time-critical transportation services. The FedEx Ground segment provides small-package ground delivery services. The FedEx Freight segment offers less-than-truckload freight transportation services. The FedEx Services segment provides sales, marketing, information technology, communications, customer service, technical support, billing and collection, and back-office support services. In addition, the company offers supply chain management solutions; and air and ocean freight forwarding and cargo transportation, specialty transportation, customs brokerage, third party logistics and supply chain, and document and business solutions, as well as provides trade management tools and data. The company was founded in 1971 and is headquartered in Memphis, Tennessee.","Row Color":"positive-row","Last Updated":"16-12-2024 10:37:32"},{"Company Name":"General Mills, Inc.","Symbol":"GIS","Current Price":"66.69","Latest MA":"68.37","Price Target":"73.78","Difference from MA":"-2.46%","Difference from Open":"-0.28%","Change from Yesterday":"0.92%","Change from Last Report":"0.00","Latest Volume":"3,193,220","Market Cap":"37,023,551,488","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":14.090936,"ROE":0.24168,"DTE":139.823,"Stock Sentiment":"Buy","Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.107,"Trailing PEG":3.3991,"Trailing PS":1.8698196,"Quick Ratio":"N\/A","Day High":67.18,"Day Low":66.395,"VS Average Volume":0.8476872316,"Company Summary":"General Mills, Inc. manufactures and markets branded consumer foods worldwide. The company operates through four segments: North America Retail; International; Pet; and North America Foodservice. It offers grain, ready-to-eat cereals, refrigerated yogurt, soup, meal kits, refrigerated and frozen dough products, dessert and baking mixes, bakery flour, frozen pizza and pizza snacks, snack bars, fruit and savory snacks, ice cream and frozen desserts, unbaked and fully baked frozen dough products, frozen hot snacks, ethnic meals, side dish mixes, frozen breakfast and entrees, nutrition bars, and frozen and shelf-stable vegetables. The company also manufactures and markets pet food products, including dog and cat food; and operates ice cream parlors. It markets its products under the Annie's, Betty Crocker, Bisquick, Blue Buffalo, Bugles, Cascadian Farm, Cheerios, Chex, Cinnamon Toast Crunch, Cocoa Puffs, Cookie Crisp, Dunkaroos, Edgard & Cooper, Fiber One, Fruit by the Foot, Fruit Gushers, Fruit Roll-Ups, Gardetto's, Gold Medal, Golden Grahams, Häagen-Dazs, Kitano, Kix, Lärabar, Latina, Lucky Charms, Muir Glen, Nature Valley, Nudges, Oatmeal Crisp, Old El Paso, Pillsbury, Progresso, Tastefuls, Total, Totino's , Trix, True Chews, True Solutions, Wanchai Ferry, Wheaties, Wilderness, and Yoki brands. The company sells its products to grocery stores, mass merchandisers, membership stores, natural food chains, drug, dollar and discount chains, e-commerce retailers, commercial and noncommercial foodservice distributors and operators, restaurants, convenience stores, and pet specialty stores. General Mills, Inc. was founded in 1866 and is headquartered in Minneapolis, Minnesota.","Row Color":"negative-row","Last Updated":"16-12-2024 10:37:32"},{"Company Name":"Birkenstock Holding plc","Symbol":"BIRK","Current Price":"55.06","Latest MA":"52.57","Price Target":"65.88","Difference from MA":"4.74%","Difference from Open":"3.09%","Change from Yesterday":"2.74%","Change from Last Report":"0.00","Latest Volume":"1,715,037","Market Cap":"10,341,864,448","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":31.931799,"ROE":0.04422,"DTE":57.584,"Stock Sentiment":"Strong Buy","Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":null,"Trailing PS":6.0006094,"Quick Ratio":"N\/A","Day High":55.3486,"Day Low":53.115,"VS Average Volume":1.5269679878,"Company Summary":"Birkenstock Holding plc manufactures and sells footwear products. It also offers sandals, shoes, closed-toe silhouettes, skincare products, and accessories. The company sells its products through e-commerce sites and a network of owned retail stores, as well as business-to-business channels. It operates in the United States, Brazil, Canada, Mexico, Europe, APMA, and internationally. Birkenstock Holding plc was founded in 1774 and is based in London, the United Kingdom. Birkenstock Holding plc operates as a subsidiary of BK LC Lux MidCo S.à r.l.","Row Color":"positive-row","Last Updated":"16-12-2024 10:37:32"},{"Company Name":"ConAgra Brands, Inc.","Symbol":"CAG","Current Price":"28.20","Latest MA":"29.69","Price Target":"30.67","Difference from MA":"-5.01%","Difference from Open":"0.53%","Change from Yesterday":"0.46%","Change from Last Report":"0.00","Latest Volume":"2,663,916","Market Cap":"13,459,098,624","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.590118,"ROE":0.05605,"DTE":100.881,"Stock Sentiment":"Buy","Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.332,"Trailing PEG":0.3385,"Trailing PS":1.1270578,"Quick Ratio":"N\/A","Day High":28.21,"Day Low":27.79,"VS Average Volume":0.5275015381,"Company Summary":"Conagra Brands, Inc., together with its subsidiaries, operates as a consumer packaged goods food company primarily in the United States. The company operates through four segments: Grocery & Snacks, Refrigerated & Frozen, International, and Foodservice. The Grocery & Snacks segment primarily offers shelf stable food products through various retail channels. The Refrigerated & Frozen segment provides temperature-controlled food products through various retail channels. The International segment offers food products in various temperature states through retail and foodservice channels outside of the United States. The Foodservice segment offers branded and customized food products, including meals, entrees, sauces, and various custom-manufactured culinary products packaged for restaurants and other foodservice establishments. The company sells its products under the Birds Eye, Marie Callender's, Duncan Hines, Healthy Choice, Slim Jim, Reddi-wip, Angie's, BOOMCHICKAPOP brands. The company was incorporated in 1919 and is headquartered in Chicago, Illinois.","Row Color":"negative-row","Last Updated":"16-12-2024 10:37:32"},{"Company Name":"Nike, Inc.","Symbol":"NKE","Current Price":"77.25","Latest MA":"81.89","Price Target":"89.63","Difference from MA":"-5.67%","Difference from Open":"-0.13%","Change from Yesterday":"-0.91%","Change from Last Report":"0.00","Latest Volume":"6,897,525","Market Cap":"114,986,622,976","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.29979,"ROE":0.3798,"DTE":86.962,"Stock Sentiment":"Strong Buy","Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.035,"Trailing PEG":3.95,"Trailing PS":2.2991807,"Quick Ratio":"N\/A","Day High":77.83,"Day Low":76.765,"VS Average Volume":0.5766640638,"Company Summary":"NIKE, Inc., together with its subsidiaries, engages in the design, development, marketing, and sale of athletic footwear, apparel, equipment, accessories, and services worldwide. The company provides athletic and casual footwear, apparel, and accessories under the NIKE, Jumpman, Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also sells a line of performance equipment and accessories comprising bags, sport balls, socks, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. In addition, the company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel; licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks; and operates digital platforms, including fitness and activity apps; sport, fitness, and wellness content; and digital services and features in retail stores. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was founded in 1964 and is headquartered in Beaverton, Oregon.","Row Color":"negative-row","Last Updated":"16-12-2024 10:37:32"},{"Company Name":"Darden Restaurants, Inc.","Symbol":"DRI","Current Price":"166.69","Latest MA":"155.96","Price Target":"183.63","Difference from MA":"6.88%","Difference from Open":"0.90%","Change from Yesterday":"1.03%","Change from Last Report":"0.00","Latest Volume":"1,472,723","Market Cap":"19,586,074,624","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.76226,"ROE":0.48619,"DTE":326.282,"Stock Sentiment":"Strong Buy","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.309,"Trailing PEG":1.7682,"Trailing PS":1.7156087,"Quick Ratio":"N\/A","Day High":166.99,"Day Low":164.39,"VS Average Volume":1.2081363146,"Company Summary":"Darden Restaurants, Inc., together with its subsidiaries, owns and operates full-service restaurants in the United States and Canada. It operates under Olive Garden, LongHorn Steakhouse, Cheddar's Scratch Kitchen, Yard House, The Capital Grille, Seasons 52, Bahama Breeze, Eddie V's Prime Seafood, and Capital Burger brand names. Darden Restaurants, Inc. was incorporated in 1995 and is based in Orlando, Florida.","Row Color":"positive-row","Last Updated":"16-12-2024 10:37:32"},{"Company Name":"Paychex, Inc.","Symbol":"PAYX","Current Price":"140.98","Latest MA":"131.55","Price Target":"138.92","Difference from MA":"7.17%","Difference from Open":"-0.41%","Change from Yesterday":"-0.15%","Change from Last Report":"0.00","Latest Volume":"2,138,150","Market Cap":"50,738,417,664","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.67161,"ROE":0.45672,"DTE":22.517,"Stock Sentiment":"Strong Sell","Industry":"Software—Application","Sector":"Technology","Beta":0.987,"Trailing PEG":4.2125,"Trailing PS":9.553819,"Quick Ratio":"N\/A","Day High":141.865,"Day Low":140.41,"VS Average Volume":1.2806951447,"Company Summary":"Paychex, Inc., together with its subsidiaries, provides integrated human capital management solutions (HCM) for payroll, benefits, human resources (HR), and insurance services for small to medium-sized businesses in the United States, Europe, and India. It offers payroll processing services; payroll tax administration services; employee payment services; and regulatory compliance services, such as new-hire reporting and garnishment processing. The company also provides HR solutions, including integrated HCM technology solutions and HR advisory services through both virtual and on-site availability of a professionally trained HR representative, as well as HR support to non-payroll clients through its HR Partner Plus solution; and retirement services administration, such as plan implementation, ongoing compliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services. In addition, it offers cloud-based HR administration software products for employee benefits management and administration, time and attendance, digital communication solutions, recruiting, and onboarding solutions; plan administration outsourcing and state unemployment insurance services; various business services to small to medium-sized businesses comprising payroll funding and outsourcing services, which include payroll processing, invoicing, and tax preparation; and payment processing services, financial fitness programs, and a small-business loan resource center. Further, the company provides insurance services for property and casualty coverage, such as workers' compensation, business-owner policies, cyber security protection, and commercial auto, as well as health and benefits coverage, including health, dental, vision, and life. It markets and sells its services primarily through its direct sales force. The company was founded in 1971 and is headquartered in Rochester, New York.","Row Color":"positive-row","Last Updated":"16-12-2024 10:37:32"},{"Company Name":"Micron Technology, Inc.","Symbol":"MU","Current Price":"102.50","Latest MA":"110.51","Price Target":"147.25","Difference from MA":"-7.25%","Difference from Open":"1.72%","Change from Yesterday":"4.34%","Change from Last Report":"0.00","Latest Volume":"23,926,017","Market Cap":"114,189,107,200","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.1564045,"ROE":0.01743,"DTE":31.194,"Stock Sentiment":"Strong Buy","Industry":"Semiconductors","Sector":"Technology","Beta":1.179,"Trailing PEG":0.1637,"Trailing PS":4.5473742,"Quick Ratio":"N\/A","Day High":103.2,"Day Low":99.6651,"VS Average Volume":1.1348119174,"Company Summary":"Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Mainland China, rest of the Asia Pacific, Hong Kong, Japan, Europe, and internationally. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Embedded Business Unit, and Storage Business Unit. It provides memory and storage technologies comprising dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; non-volatile and re-writeable semiconductor storage devices; and non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers serves the data center, PC, graphics, networking, automotive, industrial, and consumer embedded markets, as well as for smartphone and other mobile-device markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.","Row Color":"negative-row","Last Updated":"16-12-2024 10:37:32"},{"Company Name":"Lamb Weston Holdings, Inc.","Symbol":"LW","Current Price":"79.27","Latest MA":"73.89","Price Target":"82.00","Difference from MA":"7.29%","Difference from Open":"8.60%","Change from Yesterday":"6.79%","Change from Last Report":"0.00","Latest Volume":"8,223,824","Market Cap":"11,303,743,488","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":16.353973,"ROE":0.37015,"DTE":221.158,"Stock Sentiment":"Buy","Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.715,"Trailing PEG":2.6742,"Trailing PS":1.7507812,"Quick Ratio":"N\/A","Day High":80.98,"Day Low":70.35,"VS Average Volume":3.445233482,"Company Summary":"Lamb Weston Holdings, Inc. engages in the production, distribution, and marketing of frozen potato products in the United States, Canada, Mexico, and internationally. It offers frozen potatoes, commercial ingredients, and appetizers under the Lamb Weston brand, as well as under various customer labels. The company also provides its products under its owned or licensed brands, such as Grown in Idaho and Alexia, and other licensed brands, as well as under retailers' own brands. It sells its products through a network of internal sales personnel and independent brokers, agents, and distributors to quick service and full-service restaurants and chains, wholesale, grocery, mass merchants, club retailers, and specialty retailers, as well as foodservice distributors and institutions, including businesses, educational institutions, independent restaurants, regional chain restaurants, and convenience stores. The company was incorporated in 1950 and is headquartered in Eagle, Idaho.","Row Color":"positive-row","Last Updated":"16-12-2024 10:37:32"},{"Company Name":"Accenture plc","Symbol":"ACN","Current Price":"358.68","Latest MA":"333.00","Price Target":"389.33","Difference from MA":"7.71%","Difference from Open":"-0.25%","Change from Yesterday":"-0.42%","Change from Last Report":"0.00","Latest Volume":"1,067,386","Market Cap":"224,123,338,752","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":25.457056,"ROE":0.26674998,"DTE":14.127,"Stock Sentiment":"Strong Buy","Industry":"Information Technology Services","Sector":"Technology","Beta":1.245,"Trailing PEG":2.2419,"Trailing PS":3.4535525,"Quick Ratio":"N\/A","Day High":360.7626,"Day Low":356.25,"VS Average Volume":0.4319613504,"Company Summary":"Accenture plc provides strategy and consulting, industry X, song, and technology and operation services in North America, Europe, the Middle East, Africa, and internationally. It offers systems integration and application management; security; intelligent platform; infrastructure; software engineering; data and AI; and automation services. The company also operates business processes; and designs, manufactures, and assembles automation equipment, robotics, and other commercial hardware products. It serves communications, media, and technology; banking and capital markets, and insurance; health and public service; consumer goods, retail, travel services; industrial; life science; chemicals, natural resources, energy, and utilities sectors. It has collaboration agreement with Kyoto University to advance learning, research, and innovation in human-centered  AI. The company was founded in 1951 and is based in Dublin, Ireland.","Row Color":"positive-row","Last Updated":"16-12-2024 10:37:32"},{"Company Name":"Cintas Corporation","Symbol":"CTAS","Current Price":"211.22","Latest MA":"196.09","Price Target":"214.15","Difference from MA":"7.72%","Difference from Open":"0.22%","Change from Yesterday":"-0.17%","Change from Last Report":"0.00","Latest Volume":"1,370,666","Market Cap":"85,184,815,104","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":45.29906,"ROE":0.40462002,"DTE":70.573,"Stock Sentiment":"Buy","Industry":"Specialty Business Services","Sector":"Industrials","Beta":1.313,"Trailing PEG":4.4491,"Trailing PS":8.731646,"Quick Ratio":"N\/A","Day High":211.98,"Day Low":209.4,"VS Average Volume":0.96587264,"Company Summary":"Cintas Corporation engages in the provision of corporate identity uniforms and related business services primarily in the United States, Canada, and Latin America. It operates through Uniform Rental and Facility Services, First Aid and Safety Services, and All Other segments. The company rents and services uniforms and other garments, including flame resistant clothing, mats, mops and shop towels, and other ancillary items; and provides restroom cleaning services and supplies, as well as sells uniforms. In addition, the company offers first aid and safety services, and fire protection products and services. It provides its products and services through its distribution network and local delivery routes, or local representatives to small service and manufacturing companies, as well as major corporations. The company was founded in 1968 and is based in Cincinnati, Ohio. Cintas Corporation was formerly a subsidiary of Cintas Corporation.","Row Color":"positive-row","Last Updated":"16-12-2024 10:37:32"},{"Company Name":"Lennar Corporation","Symbol":"LEN","Current Price":"154.39","Latest MA":"169.53","Price Target":"196.07","Difference from MA":"-8.93%","Difference from Open":"0.31%","Change from Yesterday":"-0.69%","Change from Last Report":"0.00","Latest Volume":"2,105,497","Market Cap":"41,658,593,280","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.719563,"ROE":0.15878001,"DTE":14.665,"Stock Sentiment":"Buy","Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.619,"Trailing PEG":1.0892,"Trailing PS":1.1424974,"Quick Ratio":"N\/A","Day High":155.14,"Day Low":152.32,"VS Average Volume":1.0616226033,"Company Summary":"Lennar Corporation, together with its subsidiaries, operates as a homebuilder primarily under the Lennar brand in the United States. It operates through Homebuilding East, Homebuilding Central, Homebuilding Texas, Homebuilding West, Financial Services, Multifamily, and Lennar Other segments. The company's homebuilding operations include the construction and sale of single-family attached and detached homes, as well as the purchase, development, and sale of residential land; and development, construction, and management of multifamily rental properties. It also offers residential mortgage financing, title, insurance, and closing services for home buyers and others, as well as originates and sells securitization commercial mortgage loans. In addition, the company is involved in the fund investment activity. It primarily serves first-time, move-up, active adult, and luxury homebuyers. Lennar Corporation was founded in 1954 and is based in Miami, Florida.","Row Color":"negative-row","Last Updated":"16-12-2024 10:37:32"},{"Company Name":"CarMax Inc","Symbol":"KMX","Current Price":"86.26","Latest MA":"76.79","Price Target":"82.86","Difference from MA":"12.33%","Difference from Open":"-0.61%","Change from Yesterday":"-0.60%","Change from Last Report":"0.00","Latest Volume":"1,129,562","Market Cap":"13,363,744,768","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":23.16395,"ROE":0.06853,"DTE":314.637,"Stock Sentiment":"Buy","Industry":"Auto & Truck Dealerships","Sector":"Consumer Cyclical","Beta":1.686,"Trailing PEG":1.0552,"Trailing PS":0.48281053,"Quick Ratio":"N\/A","Day High":86.78,"Day Low":85.53,"VS Average Volume":0.5814470158,"Company Summary":"CarMax, Inc., through its subsidiaries, operates as a retailer of used vehicles and related products in the United States. It operates in two segments: CarMax Sales Operations and CarMax Auto Finance. The CarMax Sales Operations segment offers customers a range of makes and models of used vehicles, including domestic, imported, and luxury vehicles, as well as hybrid and electric vehicles; used vehicle auctions; extended protection plans to customers at the time of sale; and reconditioning and vehicle repair services. The CarMax Auto Finance segment provides financing alternatives for retail customers across a range of credit spectrum and arrangements with various financial institutions. The company was founded in 1993 and is based in Richmond, Virginia.","Row Color":"positive-row","Last Updated":"16-12-2024 10:37:32"},{"Company Name":"Jabil Inc.","Symbol":"JBL","Current Price":"135.13","Latest MA":"117.52","Price Target":"149.25","Difference from MA":"14.98%","Difference from Open":"0.36%","Change from Yesterday":"1.11%","Change from Last Report":"0.00","Latest Volume":"741,643","Market Cap":"15,093,075,968","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":16.940334,"ROE":0.60295,"DTE":207.887,"Stock Sentiment":"Strong Buy","Industry":"Electronic Components","Sector":"Technology","Beta":1.245,"Trailing PEG":null,"Trailing PS":0.52255917,"Quick Ratio":"N\/A","Day High":135.42,"Day Low":133.395,"VS Average Volume":0.5677441135,"Company Summary":"Jabil Inc. provides manufacturing services and solutions worldwide. It operates in two segments, Electronics Manufacturing Services and Diversified Manufacturing Services. The company offers electronics design, production, and product management services; electronic circuit design services, such as application-specific integrated circuit design, firmware development, and rapid prototyping services; and designs plastic and metal enclosures that include the electro-mechanics, such as the printed circuit board assemblies (PCBA). It also provides three-dimensional mechanical design comprising the analysis of electronic, electro-mechanical, and optical assemblies, as well as various industrial design, mechanism development, and tooling management services. In addition, the company provides computer-assisted design services consisting of PCBA design, as well as PCBA design validation and verification services; and other consulting services, such as the generation of a bill of materials, approved vendor list, and assembly equipment configuration for various PCBA designs. Further, it offers product and process validation services, such as product system, product safety, regulatory compliance, and reliability tests, as well as manufacturing test solution development services. Additionally, the company provides systems assembly, test, direct-order fulfillment, and configure-to-order services. It serves 5G, wireless and cloud, digital print and retail, industrial and semi-cap, networking and storage, automotive and transportation, connected devices, healthcare and packaging, and mobility industries. The company was formerly known as Jabil Circuit, Inc. and changed its name to Jabil Inc. in June 2017. Jabil Inc. was founded in 1966 and is headquartered in Saint Petersburg, Florida.","Row Color":"positive-row","Last Updated":"16-12-2024 10:37:32"},{"Company Name":"Cal-Maine Foods, Inc.","Symbol":"CALM","Current Price":"108.12","Latest MA":"75.25","Price Target":"86.33","Difference from MA":"43.68%","Difference from Open":"1.83%","Change from Yesterday":"2.11%","Change from Last Report":"0.00","Latest Volume":"592,178","Market Cap":"5,301,837,312","Earning Date":"2024-12-17","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":33.52558,"ROE":0.24239999,"DTE":"N\/A","Stock Sentiment":"Hold","Industry":"Farm Products","Sector":"Consumer Defensive","Beta":-0.132,"Trailing PEG":null,"Trailing PS":1.9984536,"Quick Ratio":"N\/A","Day High":108.22,"Day Low":106.04,"VS Average Volume":1.0278352001,"Company Summary":"Cal-Maine Foods, Inc., together with its subsidiaries, engages in the production, grading, packaging, marketing, and distribution of shell eggs and egg products. The company offers specialty eggs, such as nutritionally enhanced, cage free, organic, free-range, pasture-raised, and brown eggs, as well as conventional eggs under the Egg-Land's Best, Land O' Lakes, Farmhouse Eggs, Sunups, Sunny Meadow, and 4-Grain brand names. It sells its products to various customers, including national and regional grocery store chains, club stores, independent supermarkets, foodservice distributors, and egg product consumers primarily in the southwestern, southeastern, mid-western, northeastern, and mid-Atlantic regions of the United States. The company was founded in 1957 and is headquartered in Ridgeland, Mississippi.","Row Color":"positive-row","Last Updated":"16-12-2024 10:37:32"}]