[{"Company Name":"Broadcom Inc.","Symbol":"AVGO","Current Price":"226.05","Latest MA":"165.06","Price Target":"236.09","Difference from MA":"36.95%","Difference from Open":"-0.85%","Change from Yesterday":"1.00%","Change from Last Report":"1.09","Latest Volume":"2,666,270","Market Cap":"1,054,897,274,880","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":29.778841,"ROE":0.12509,"DTE":166.032,"Industry":"Semiconductors","Sector":"Technology","Beta":1.187,"Trailing PEG":0.6364,"Trailing PE":173.73846,"Trailing PS":22.53332,"Quick Ratio":0.841,"Day High":228.05,"Day Low":224.92,"VS Average Volume":0.1019079354,"Company Summary":"Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides set-top box system-on-chips (SoCs); cable, digital subscriber line, and passive optical networking central office\/consumer premise equipment SoCs; wireless local area network access point SoCs; Ethernet switching and routing custom silicon solutions; serializer\/deserializer application specific integrated circuits; optical and copper, and physical layer devices; and fiber optic components and RF semiconductor devices. The company also offers RF front end modules and filter; Wi-Fi, Bluetooth, and global positioning system\/global navigation satellite system SoCs; custom touch controllers; inductive charging; attached small computer system interface, and redundant array of independent disks controllers and adapters; peripheral component interconnect express; fiber channel host bus adapters; read channel based SoCs; custom flash controllers; preamplifiers; optocouplers, industrial fiber optics, and motion control encoders and subsystems; light emitting diode, ethernet PHYs, switch ICs, and camera microcontrollers. Its products are used in various applications, including enterprise and data center networking, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was founded in 1961 and is headquartered in Palo Alto, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 16:33:30"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"9.67","Latest MA":"10.54","Price Target":"9.94","Difference from MA":"-8.25%","Difference from Open":"0.62%","Change from Yesterday":"-0.52%","Change from Last Report":"0.31","Latest Volume":"696,823","Market Cap":"8,332,658,688","Earning Date":"2025-01-02","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":6.0179725,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.056432154,"Quick Ratio":0.332,"Day High":9.715,"Day Low":9.56,"VS Average Volume":0.0287118705,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"19-12-2024 16:33:30"},{"Company Name":"UiPath, Inc.","Symbol":"PATH","Current Price":"13.04","Latest MA":"12.96","Price Target":"15.81","Difference from MA":"0.59%","Difference from Open":"-6.86%","Change from Yesterday":"1.43%","Change from Last Report":"0.54","Latest Volume":"1,102,172","Market Cap":"7,229,974,528","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":25.944696,"ROE":-0.058920003,"DTE":4.505,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.87,"Trailing PEG":0.8235,"Trailing PE":"N\/A","Trailing PS":5.2294903,"Quick Ratio":3.339,"Day High":13.19,"Day Low":13.015,"VS Average Volume":0.1298203447,"Company Summary":"UiPath Inc. provides an end-to-end automation platform that offers a range of robotic process automation (RPA) solutions primarily in the United States, Romania, the United Kingdom, the Netherlands, and internationally. The company offers a suite of interrelated software to build, manage, run, engage, measure, and govern automation within the organization. Its platform's embedded AI, ML, and NLP capabilities improve decisioning and information processing; emulate human behavior allows organizations to address a myriad of use cases; emulate human behavior allows organizations to address a myriad of use cases; multi-tenant platform enterprise deployment with security and governance and Automation Cloud, which enables customers to begin automating without the need to provision infrastructure, install applications, or perform additional configurations; intuitive interface and low-code, drag-and-drop functionality; signed to enable people and automations to work together; and tracks, measures, and forecasts the performance of automations, enables customers to gain powerful insights and generate key performance indicators with actionable metric. It serves banking and financial services, healthcare, insurance, public sectors, manufacturing, retail, and telecom industries. The company was founded in 2005 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"19-12-2024 16:33:30"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"69.51","Latest MA":"63.16","Price Target":"82.14","Difference from MA":"10.05%","Difference from Open":"-2.35%","Change from Yesterday":"2.13%","Change from Last Report":"0.12","Latest Volume":"588,522","Market Cap":"131,508,772,864","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.554136,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.7515,"Trailing PE":19.810543,"Trailing PS":1.8974545,"Quick Ratio":"N\/A","Day High":69.8,"Day Low":69.1,"VS Average Volume":0.0434227025,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 16:33:30"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"37.52","Latest MA":"43.55","Price Target":"55.96","Difference from MA":"-13.84%","Difference from Open":"-3.72%","Change from Yesterday":"0.59%","Change from Last Report":"0.51","Latest Volume":"655,883","Market Cap":"53,027,930,112","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":10.469364,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.679,"Trailing PE":12.074342,"Trailing PS":1.4732026,"Quick Ratio":1.003,"Day High":37.855,"Day Low":37.48,"VS Average Volume":0.0537493587,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 16:33:30"},{"Company Name":"Micron Technology, Inc.","Symbol":"MU","Current Price":"88.91","Latest MA":"109.78","Price Target":"146.68","Difference from MA":"-19.02%","Difference from Open":"-1.36%","Change from Yesterday":"-14.54%","Change from Last Report":"-14.43","Latest Volume":"9,901,486","Market Cap":"98,845,990,912","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.913052,"ROE":0.01743,"DTE":31.194,"Industry":"Semiconductors","Sector":"Technology","Beta":1.179,"Trailing PEG":0.166,"Trailing PE":25.423353,"Trailing PS":3.9363623,"Quick Ratio":1.592,"Day High":91.0,"Day Low":88.15,"VS Average Volume":0.4438539931,"Company Summary":"Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Mainland China, rest of the Asia Pacific, Hong Kong, Japan, Europe, and internationally. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Embedded Business Unit, and Storage Business Unit. It provides memory and storage technologies comprising dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; non-volatile and re-writeable semiconductor storage devices; and non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers serves the data center, PC, graphics, networking, automotive, industrial, and consumer embedded markets, as well as for smartphone and other mobile-device markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 16:33:30"},{"Company Name":"Carnival Corporation","Symbol":"CCL","Current Price":"25.38","Latest MA":"19.17","Price Target":"27.52","Difference from MA":"32.41%","Difference from Open":"-2.80%","Change from Yesterday":"1.97%","Change from Last Report":"0.83","Latest Volume":"1,102,574","Market Cap":"33,962,221,568","Earning Date":"2024-12-20","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":14.664132,"ROE":0.20120001,"DTE":352.355,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.668,"Trailing PEG":null,"Trailing PE":21.632479,"Trailing PS":1.3874023,"Quick Ratio":0.202,"Day High":25.445,"Day Low":25.0,"VS Average Volume":0.0432084585,"Company Summary":"Carnival Corporation & plc engages in the provision of leisure travel services in North America, Australia, Europe, Asia, and internationally. The company operates through four segments: NAA Cruise Operations, Europe Cruise Operations, Cruise Support, and Tour and Other. It operates port destinations, private islands, and a solar park, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. The company offers its services under the Carnival Cruise Line, Princess Cruises, Holland America Line, Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises, and Cunard brand. Additionally, it sells its cruises primarily through travel agents, tour operators, vacation planners, and websites. Carnival Corporation & plc was founded in 1972 and is headquartered in Miami, Florida.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 16:33:30"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"26.11","Latest MA":"22.36","Price Target":"26.87","Difference from MA":"16.81%","Difference from Open":"-1.79%","Change from Yesterday":"1.08%","Change from Last Report":"0.33","Latest Volume":"532,454","Market Cap":"58,007,019,520","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.515118,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":1.8913,"Trailing PE":23.106195,"Trailing PS":3.8285935,"Quick Ratio":0.291,"Day High":26.19,"Day Low":26.01,"VS Average Volume":0.0384564883,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"19-12-2024 16:33:30"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"44.32","Latest MA":"41.08","Price Target":"50.10","Difference from MA":"7.88%","Difference from Open":"-1.82%","Change from Yesterday":"1.86%","Change from Last Report":"0.34","Latest Volume":"1,621,686","Market Cap":"339,985,334,272","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.0316725,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":1.9273,"Trailing PE":16.054348,"Trailing PS":3.592938,"Quick Ratio":"N\/A","Day High":44.41,"Day Low":43.83,"VS Average Volume":0.0466268985,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 16:33:30"},{"Company Name":"Nike, Inc.","Symbol":"NKE","Current Price":"77.67","Latest MA":"80.92","Price Target":"88.53","Difference from MA":"-4.02%","Difference from Open":"-0.40%","Change from Yesterday":"0.68%","Change from Last Report":"0.99","Latest Volume":"551,899","Market Cap":"115,448,053,760","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":25.047554,"ROE":0.3798,"DTE":86.962,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.035,"Trailing PEG":3.9321,"Trailing PE":22.223495,"Trailing PS":2.308407,"Quick Ratio":1.417,"Day High":77.94,"Day Low":76.7,"VS Average Volume":0.0455634389,"Company Summary":"NIKE, Inc., together with its subsidiaries, engages in the design, development, marketing, and sale of athletic footwear, apparel, equipment, accessories, and services worldwide. The company provides athletic and casual footwear, apparel, and accessories under the NIKE, Jumpman, Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also sells a line of performance equipment and accessories comprising bags, sport balls, socks, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. In addition, the company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel; licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks; and operates digital platforms, including fitness and activity apps; sport, fitness, and wellness content; and digital services and features in retail stores. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was founded in 1964 and is headquartered in Beaverton, Oregon.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"19-12-2024 16:33:30"},{"Company Name":"Hewlett Packard Enterprise Comp","Symbol":"HPE","Current Price":"21.05","Latest MA":"19.87","Price Target":"24.21","Difference from MA":"5.98%","Difference from Open":"-2.84%","Change from Yesterday":"2.26%","Change from Last Report":"2.26","Latest Volume":"715,247","Market Cap":"27,301,847,040","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.21544,"ROE":0.086660005,"DTE":53.696,"Industry":"Communication Equipment","Sector":"Technology","Beta":1.206,"Trailing PEG":3.5699,"Trailing PE":10.906735,"Trailing PS":0.94079417,"Quick Ratio":0.469,"Day High":21.2,"Day Low":21.02,"VS Average Volume":0.053421472,"Company Summary":"Hewlett Packard Enterprise Company provides solutions that allow customers to capture, analyze, and act upon data seamlessly in the Americas, Europe, the Middle East, Africa, the Asia Pacific, and Japan. It operates in six segments: Compute, HPC & AI, Storage, Intelligent Edge, Financial Services, and Corporate Investments and Other. The company offers general purpose servers for multi-workload computing and workload-optimized servers; HPE ProLiant rack and tower servers; HPE Synergy; HPE Alletra, HPE GreenLake, Zerto, HPE InfoSight, and HPE CloudPhysics storage products; HPE Cray EX, HPE Cray XD, and converged edge systems; and HPE Superdome Flex, HPE Nonstop, and HPE Integrity products. It also provides HPE Aruba products that includes hardware products, such as Wi-Fi access points, switches, and gateways; HPE Aruba Networking software and services comprising cloud-based management, network management and access control, analytics and assurance, software-defined wide-area networking, network security, analytics and assurance, and location services software; and professional and support services, as well as as-a-service and consumption models. In addition, the company offers leasing, financing, IT consumption, and utility programs and asset management services for customers to facilitate technology deployment models and the acquisition of various IT solutions, including hardware, software, and services from Hewlett Packard Enterprise and others; consultative-led services; HPE Ezmeral Container Platform; HPE Ezmeral Software Container Platform and HPE Ezmeral Software Data Fabric; OpsRamp; and Hewlett Packard Labs. It serves commercial and large enterprise groups, such as business and public sector enterprises; and through various partners comprising resellers, distribution partners, original equipment manufacturers, independent software vendors, systems integrators, and advisory firms. The company was founded in 1939 and is headquartered in Spring, Texas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"19-12-2024 16:33:30"}]