[{"Company Name":"Micron Technology, Inc.","Symbol":"MU","Current Price":"105.32","Latest MA":"110.28","Price Target":"147.25","Difference from MA":"-4.50%","Difference from Open":"-0.40%","Change from Yesterday":"2.39%","Change from Last Report":"0.40","Latest Volume":"3,885,583","Market Cap":"116,917,387,264","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.083925,"ROE":0.01743,"DTE":31.194,"Stock Sentiment":"Strong Buy","Industry":"Semiconductors","Sector":"Technology","Beta":1.179,"Trailing PEG":0.1637,"Trailing PS":4.656023,"Quick Ratio":"N\/A","Day High":105.9499,"Day Low":104.6,"VS Average Volume":0.1842933529,"Company Summary":"Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Mainland China, rest of the Asia Pacific, Hong Kong, Japan, Europe, and internationally. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Embedded Business Unit, and Storage Business Unit. It provides memory and storage technologies comprising dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; non-volatile and re-writeable semiconductor storage devices; and non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers serves the data center, PC, graphics, networking, automotive, industrial, and consumer embedded markets, as well as for smartphone and other mobile-device markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.","Row Color":"negative-row","Last Updated":"16-12-2024 16:35:42"},{"Company Name":"Nike, Inc.","Symbol":"NKE","Current Price":"77.43","Latest MA":"81.18","Price Target":"89.63","Difference from MA":"-4.62%","Difference from Open":"0.10%","Change from Yesterday":"0.58%","Change from Last Report":"0.23","Latest Volume":"603,279","Market Cap":"115,671,334,912","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.88464,"ROE":0.3798,"DTE":86.962,"Stock Sentiment":"Strong Buy","Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.035,"Trailing PEG":3.95,"Trailing PS":2.3128717,"Quick Ratio":"N\/A","Day High":77.71,"Day Low":76.66,"VS Average Volume":0.0504368335,"Company Summary":"NIKE, Inc., together with its subsidiaries, engages in the design, development, marketing, and sale of athletic footwear, apparel, equipment, accessories, and services worldwide. The company provides athletic and casual footwear, apparel, and accessories under the NIKE, Jumpman, Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also sells a line of performance equipment and accessories comprising bags, sport balls, socks, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. In addition, the company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel; licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks; and operates digital platforms, including fitness and activity apps; sport, fitness, and wellness content; and digital services and features in retail stores. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was founded in 1964 and is headquartered in Beaverton, Oregon.","Row Color":"negative-row","Last Updated":"16-12-2024 16:35:42"},{"Company Name":"UiPath, Inc.","Symbol":"PATH","Current Price":"13.82","Latest MA":"13.10","Price Target":"15.81","Difference from MA":"5.47%","Difference from Open":"-1.99%","Change from Yesterday":"-0.78%","Change from Last Report":"-1.36","Latest Volume":"559,585","Market Cap":"7,639,480,832","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":27.414206,"ROE":-0.058920003,"DTE":4.505,"Stock Sentiment":"Hold","Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.87,"Trailing PEG":0.8169,"Trailing PS":5.525689,"Quick Ratio":"N\/A","Day High":13.97,"Day Low":13.765,"VS Average Volume":0.064877803,"Company Summary":"UiPath Inc. provides an end-to-end automation platform that offers a range of robotic process automation (RPA) solutions primarily in the United States, Romania, the United Kingdom, the Netherlands, and internationally. The company offers a suite of interrelated software to build, manage, run, engage, measure, and govern automation within the organization. Its platform's embedded AI, ML, and NLP capabilities improve decisioning and information processing; emulate human behavior allows organizations to address a myriad of use cases; emulate human behavior allows organizations to address a myriad of use cases; multi-tenant platform enterprise deployment with security and governance and Automation Cloud, which enables customers to begin automating without the need to provision infrastructure, install applications, or perform additional configurations; intuitive interface and low-code, drag-and-drop functionality; signed to enable people and automations to work together; and tracks, measures, and forecasts the performance of automations, enables customers to gain powerful insights and generate key performance indicators with actionable metric. It serves banking and financial services, healthcare, insurance, public sectors, manufacturing, retail, and telecom industries. The company was founded in 2005 and is headquartered in New York, New York.","Row Color":"positive-row","Last Updated":"16-12-2024 16:35:42"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"10.02","Latest MA":"10.68","Price Target":"9.94","Difference from MA":"-6.21%","Difference from Open":"-1.57%","Change from Yesterday":"-3.90%","Change from Last Report":"0.00","Latest Volume":"1,293,038","Market Cap":"8,621,927,424","Earning Date":"2025-01-02","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":6.5040383,"ROE":-0.75969005,"DTE":277.898,"Stock Sentiment":"Hold","Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PS":0.0583912,"Quick Ratio":"N\/A","Day High":10.18,"Day Low":9.94,"VS Average Volume":0.0546033955,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Row Color":"negative-row","Last Updated":"16-12-2024 16:35:42"},{"Company Name":"Hewlett Packard Enterprise Comp","Symbol":"HPE","Current Price":"21.41","Latest MA":"19.80","Price Target":"23.93","Difference from MA":"8.15%","Difference from Open":"-1.46%","Change from Yesterday":"-1.74%","Change from Last Report":"-0.16","Latest Volume":"871,529","Market Cap":"27,820,650,496","Earning Date":"2024-12-05","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.394586,"ROE":0.086660005,"DTE":53.696,"Stock Sentiment":"Strong Buy","Industry":"Communication Equipment","Sector":"Technology","Beta":1.206,"Trailing PEG":3.7849,"Trailing PS":0.9586716,"Quick Ratio":"N\/A","Day High":21.833,"Day Low":21.34,"VS Average Volume":0.0641366537,"Company Summary":"Hewlett Packard Enterprise Company provides solutions that allow customers to capture, analyze, and act upon data seamlessly in the Americas, Europe, the Middle East, Africa, the Asia Pacific, and Japan. It operates in six segments: Compute, HPC & AI, Storage, Intelligent Edge, Financial Services, and Corporate Investments and Other. The company offers general purpose servers for multi-workload computing and workload-optimized servers; HPE ProLiant rack and tower servers; HPE Synergy; HPE Alletra, HPE GreenLake, Zerto, HPE InfoSight, and HPE CloudPhysics storage products; HPE Cray EX, HPE Cray XD, and converged edge systems; and HPE Superdome Flex, HPE Nonstop, and HPE Integrity products. It also provides HPE Aruba products that includes hardware products, such as Wi-Fi access points, switches, and gateways; HPE Aruba Networking software and services comprising cloud-based management, network management and access control, analytics and assurance, software-defined wide-area networking, network security, analytics and assurance, and location services software; and professional and support services, as well as as-a-service and consumption models. In addition, the company offers leasing, financing, IT consumption, and utility programs and asset management services for customers to facilitate technology deployment models and the acquisition of various IT solutions, including hardware, software, and services from Hewlett Packard Enterprise and others; consultative-led services; HPE Ezmeral Container Platform; HPE Ezmeral Software Container Platform and HPE Ezmeral Software Data Fabric; OpsRamp; and Hewlett Packard Labs. It serves commercial and large enterprise groups, such as business and public sector enterprises; and through various partners comprising resellers, distribution partners, original equipment manufacturers, independent software vendors, systems integrators, and advisory firms. The company was founded in 1939 and is headquartered in Spring, Texas.","Row Color":"positive-row","Last Updated":"16-12-2024 16:35:42"},{"Company Name":"GameStop Corporation","Symbol":"GME","Current Price":"27.44","Latest MA":"24.32","Price Target":"10.00","Difference from MA":"12.84%","Difference from Open":"-4.39%","Change from Yesterday":"-1.41%","Change from Last Report":"-0.40","Latest Volume":"752,521","Market Cap":"12,329,580,544","Earning Date":"2024-12-04","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":"Infinity","ROE":0.015039999,"DTE":12.171,"Stock Sentiment":"Sell","Industry":"Specialty Retail","Sector":"Consumer Cyclical","Beta":-0.098,"Trailing PEG":null,"Trailing PS":2.7086074,"Quick Ratio":"N\/A","Day High":27.8,"Day Low":27.35,"VS Average Volume":0.0696984637,"Company Summary":"GameStop Corp., a specialty retailer, provides games and entertainment products through its stores and ecommerce platforms in the United States, Canada, Australia, and Europe. The company sells new and pre-owned gaming platforms; accessories, such as controllers, gaming headsets, and virtual reality products; new and pre-owned gaming software; and in-game digital currency, digital downloadable content, and full-game downloads. It sells collectibles comprising apparel, toys, trading cards, gadgets, and other retail products for pop culture and technology enthusiasts, as well as engages in the digital asset wallet and NFT marketplace activities. The company operates stores and ecommerce sites under the GameStop, EB Games, and Micromania brands; and pop culture themed stores that sell collectibles, apparel, gadgets, electronics, toys, and other retail products under the Zing Pop Culture brand, as well as offers Game Informer magazine, a print and digital gaming publication. The company was formerly known as GSC Holdings Corp. GameStop Corp. was founded in 1996 and is headquartered in Grapevine, Texas.","Row Color":"positive-row","Last Updated":"16-12-2024 16:35:42"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"69.97","Latest MA":"60.70","Price Target":"76.14","Difference from MA":"15.27%","Difference from Open":"-1.25%","Change from Yesterday":"-0.55%","Change from Last Report":"0.04","Latest Volume":"968,952","Market Cap":"233,230,778,368","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.784738,"ROE":0.099139996,"DTE":"N\/A","Stock Sentiment":"Strong Buy","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.2839,"Trailing PS":2.9949377,"Quick Ratio":"N\/A","Day High":70.56,"Day Low":69.84,"VS Average Volume":0.0541231754,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Row Color":"positive-row","Last Updated":"16-12-2024 16:35:42"},{"Company Name":"Devon Energy Corporation","Symbol":"DVN","Current Price":"33.37","Latest MA":"42.31","Price Target":"50.81","Difference from MA":"-21.12%","Difference from Open":"-1.85%","Change from Yesterday":"-1.65%","Change from Last Report":"-0.17","Latest Volume":"696,945","Market Cap":"21,887,905,792","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.00994,"ROE":0.26279,"DTE":64.021,"Stock Sentiment":"Strong Buy","Industry":"Oil & Gas E&P","Sector":"Energy","Beta":2.071,"Trailing PEG":14.898,"Trailing PS":1.5064977,"Quick Ratio":"N\/A","Day High":33.75,"Day Low":33.32,"VS Average Volume":0.0789403936,"Company Summary":"Devon Energy Corporation, an independent energy company, engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. It operates in Delaware, Eagle Ford, Anadarko, Williston, and Powder River Basins. The company was founded in 1971 and is headquartered in Oklahoma City, Oklahoma.","Row Color":"negative-row","Last Updated":"16-12-2024 16:35:42"},{"Company Name":"Salesforce, Inc.","Symbol":"CRM","Current Price":"351.67","Latest MA":"276.32","Price Target":"403.23","Difference from MA":"27.27%","Difference from Open":"-3.39%","Change from Yesterday":"-0.50%","Change from Last Report":"-0.38","Latest Volume":"576,483","Market Cap":"337,371,201,536","Earning Date":"2024-12-03","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":31.398462,"ROE":0.09734,"DTE":21.148,"Stock Sentiment":"Strong Buy","Industry":"Software - Application","Sector":"Technology","Beta":1.288,"Trailing PEG":1.594,"Trailing PS":9.251918,"Quick Ratio":"N\/A","Day High":353.7,"Day Low":350.56,"VS Average Volume":0.0956480116,"Company Summary":"Salesforce, Inc. provides Customer Relationship Management (CRM) technology that brings companies and customers together worldwide. The company's service includes sales to store data, monitor leads and progress, forecast opportunities, gain insights through analytics and artificial intelligence, and deliver quotes, contracts, and invoices; and service that enables companies to deliver trusted and highly personalized customer support at scale. In addition, its platform offering comprise a flexible platform that enables companies of various sizes, locations, and industries to build business workflow and apps with customer; online learning platform that allows anyone to learn in-demand Salesforce skills; and Slack, an intelligent productivity platform. The company's marketing services enables companies to plan, personalize, automate, and optimize customer marketing journey, connecting interaction, and connected products; and commerce services, which empowers shopping experience across various customer touchpoint, such as mobile, web, social, and stores and provides click-to-code tools that offers customers to build and deploy solutions. Further, its analytics offering includes Tableau, an end-to-end analytics solution for range of enterprise use cases and intelligent analytics with AI models, spot trends, predict outcomes, creates summaries, timely recommendations, and take action from any device; and integration service including MuleSoft, which provides building blocks to deliver end-to-end and connected experiences. Additionally, the company provides data cloud, a hyperscale data engine native to Salesforce; vertical services to meet the needs of customers in industries, such as financial services, healthcare and life sciences, manufacturing and automotive and government; and offers salesforce starter for small and medium-sized businesses. Salesforce, Inc. was incorporated in 1999 and is headquartered in San Francisco, California.","Row Color":"positive-row","Last Updated":"16-12-2024 16:35:42"},{"Company Name":"Carnival Corporation","Symbol":"CCL","Current Price":"26.43","Latest MA":"18.96","Price Target":"27.12","Difference from MA":"39.40%","Difference from Open":"0.55%","Change from Yesterday":"1.54%","Change from Last Report":"0.38","Latest Volume":"1,756,778","Market Cap":"35,324,203,008","Earning Date":"2024-12-20","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":15.351376,"ROE":0.20120001,"DTE":352.355,"Stock Sentiment":"Strong Buy","Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.668,"Trailing PEG":null,"Trailing PS":1.4430411,"Quick Ratio":"N\/A","Day High":26.46,"Day Low":26.11,"VS Average Volume":0.0677258211,"Company Summary":"Carnival Corporation & plc engages in the provision of leisure travel services in North America, Australia, Europe, Asia, and internationally. The company operates through four segments: NAA Cruise Operations, Europe Cruise Operations, Cruise Support, and Tour and Other. It operates port destinations, private islands, and a solar park, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. The company offers its services under the Carnival Cruise Line, Princess Cruises, Holland America Line, Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises, and Cunard brand. Additionally, it sells its cruises primarily through travel agents, tour operators, vacation planners, and websites. Carnival Corporation & plc was founded in 1972 and is headquartered in Miami, Florida.","Row Color":"positive-row","Last Updated":"16-12-2024 16:35:42"},{"Company Name":"Broadcom Inc.","Symbol":"AVGO","Current Price":"237.43","Latest MA":"163.18","Price Target":"226.65","Difference from MA":"45.50%","Difference from Open":"2.43%","Change from Yesterday":"5.53%","Change from Last Report":"0.65","Latest Volume":"8,915,847","Market Cap":"1,108,033,536,000","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":31.636171,"ROE":0.12509,"DTE":166.032,"Stock Sentiment":"Strong Buy","Industry":"Semiconductors","Sector":"Technology","Beta":1.187,"Trailing PEG":1.671,"Trailing PS":23.668344,"Quick Ratio":"N\/A","Day High":238.2299,"Day Low":230.81,"VS Average Volume":0.3766669255,"Company Summary":"Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides set-top box system-on-chips (SoCs); cable, digital subscriber line, and passive optical networking central office\/consumer premise equipment SoCs; wireless local area network access point SoCs; Ethernet switching and routing custom silicon solutions; serializer\/deserializer application specific integrated circuits; optical and copper, and physical layer devices; and fiber optic components and RF semiconductor devices. The company also offers RF front end modules and filter; Wi-Fi, Bluetooth, and global positioning system\/global navigation satellite system SoCs; custom touch controllers; inductive charging; attached small computer system interface, and redundant array of independent disks controllers and adapters; peripheral component interconnect express; fiber channel host bus adapters; read channel based SoCs; custom flash controllers; preamplifiers; optocouplers, industrial fiber optics, and motion control encoders and subsystems; light emitting diode, ethernet PHYs, switch ICs, and camera microcontrollers. Its products are used in various applications, including enterprise and data center networking, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was founded in 1961 and is headquartered in Palo Alto, California.","Row Color":"positive-row","Last Updated":"16-12-2024 16:35:42"},{"Company Name":"Marvell Technology, Inc.","Symbol":"MRVL","Current Price":"119.67","Latest MA":"76.79","Price Target":"120.41","Difference from MA":"55.85%","Difference from Open":"-2.32%","Change from Yesterday":"-0.74%","Change from Last Report":"-0.11","Latest Volume":"1,823,325","Market Cap":"103,732,158,464","Earning Date":"2024-12-03","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":43.419834,"ROE":-0.06528,"DTE":30.791,"Stock Sentiment":"Strong Buy","Industry":"Semiconductors","Sector":"Technology","Beta":1.436,"Trailing PEG":null,"Trailing PS":19.650335,"Quick Ratio":"N\/A","Day High":123.21,"Day Low":119.1601,"VS Average Volume":0.1507271308,"Company Summary":"Marvell Technology, Inc., together with its subsidiaries, provides data infrastructure semiconductor solutions, spanning the data center core to network edge. The company develops and scales complex System-on-a-Chip architectures, integrating analog, mixed-signal, and digital signal processing functionality. It offers a portfolio of Ethernet solutions, including controllers, network adapters, physical transceivers, and switches; single or multiple core processors; and custom application specific integrated circuits. The company also provides electro-optical products, including pulse amplitude modulations, coherent digital signal processors, laser drivers, trans-impedance amplifiers, silicon photonics, and data center interconnect solutions; fibre channel products comprising host bus adapters and controllers; storage controllers for hard disk drives and solid-state-drives; and host system interfaces, including serial attached SCSI, serial advanced technology attachment, peripheral component interconnect express, non-volatile memory express (NVMe), and NVMe over fabrics. It has operations in the United States, Argentina, China, India, Israel, Japan, Singapore, South Korea, Taiwan, and Vietnam. Marvell Technology, Inc. was incorporated in 1995 and is headquartered in Wilmington, Delaware.","Row Color":"positive-row","Last Updated":"16-12-2024 16:35:42"}]