[{"Company Name":"Lamb Weston Holdings, Inc.","Symbol":"LW","Current Price":"72.95","Latest MA":"73.39","Price Target":"80.67","Difference from MA":"-0.60%","Difference from Open":"-0.06%","Change from Yesterday":"-1.68%","Change from Last Report":"0.12","Latest Volume":"1,630,533","Market Cap":"10,509,120,512","Earning Date":"2025-01-02","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":14.797393,"ROE":0.37015,"DTE":221.158,"Stock Sentiment":"Buy","Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.715,"Trailing PEG":2.5042,"Trailing PS":1.6277059,"Quick Ratio":"N\/A","Day High":73.7,"Day Low":70.35,"VS Average Volume":0.7154705248,"Company Summary":"Lamb Weston Holdings, Inc. engages in the production, distribution, and marketing of frozen potato products in the United States, Canada, Mexico, and internationally. It offers frozen potatoes, commercial ingredients, and appetizers under the Lamb Weston brand, as well as under various customer labels. The company also provides its products under its owned or licensed brands, such as Grown in Idaho and Alexia, and other licensed brands, as well as under retailers' own brands. It sells its products through a network of internal sales personnel and independent brokers, agents, and distributors to quick service and full-service restaurants and chains, wholesale, grocery, mass merchants, club retailers, and specialty retailers, as well as foodservice distributors and institutions, including businesses, educational institutions, independent restaurants, regional chain restaurants, and convenience stores. The company was incorporated in 1950 and is headquartered in Eagle, Idaho.","Row Color":"negative-row","Last Updated":"13-12-2024 19:25:26"},{"Company Name":"General Mills, Inc.","Symbol":"GIS","Current Price":"66.76","Latest MA":"67.81","Price Target":"73.83","Difference from MA":"-1.55%","Difference from Open":"-0.18%","Change from Yesterday":"1.03%","Change from Last Report":"-0.06","Latest Volume":"1,321,557","Market Cap":"37,062,414,336","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":14.198092,"ROE":0.24168,"DTE":139.823,"Stock Sentiment":"Buy","Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.107,"Trailing PEG":3.368,"Trailing PS":1.8717823,"Quick Ratio":"N\/A","Day High":67.18,"Day Low":66.395,"VS Average Volume":0.35063277,"Company Summary":"General Mills, Inc. manufactures and markets branded consumer foods worldwide. The company operates through four segments: North America Retail; International; Pet; and North America Foodservice. It offers grain, ready-to-eat cereals, refrigerated yogurt, soup, meal kits, refrigerated and frozen dough products, dessert and baking mixes, bakery flour, frozen pizza and pizza snacks, snack bars, fruit and savory snacks, ice cream and frozen desserts, unbaked and fully baked frozen dough products, frozen hot snacks, ethnic meals, side dish mixes, frozen breakfast and entrees, nutrition bars, and frozen and shelf-stable vegetables. The company also manufactures and markets pet food products, including dog and cat food; and operates ice cream parlors. It markets its products under the Annie's, Betty Crocker, Bisquick, Blue Buffalo, Bugles, Cascadian Farm, Cheerios, Chex, Cinnamon Toast Crunch, Cocoa Puffs, Cookie Crisp, Dunkaroos, Edgard & Cooper, Fiber One, Fruit by the Foot, Fruit Gushers, Fruit Roll-Ups, Gardetto's, Gold Medal, Golden Grahams, Häagen-Dazs, Kitano, Kix, Lärabar, Latina, Lucky Charms, Muir Glen, Nature Valley, Nudges, Oatmeal Crisp, Old El Paso, Pillsbury, Progresso, Tastefuls, Total, Totino's , Trix, True Chews, True Solutions, Wanchai Ferry, Wheaties, Wilderness, and Yoki brands. The company sells its products to grocery stores, mass merchandisers, membership stores, natural food chains, drug, dollar and discount chains, e-commerce retailers, commercial and noncommercial foodservice distributors and operators, restaurants, convenience stores, and pet specialty stores. General Mills, Inc. was founded in 1866 and is headquartered in Minneapolis, Minnesota.","Row Color":"negative-row","Last Updated":"13-12-2024 19:25:26"},{"Company Name":"ConAgra Brands, Inc.","Symbol":"CAG","Current Price":"28.12","Latest MA":"29.28","Price Target":"30.80","Difference from MA":"-3.95%","Difference from Open":"0.25%","Change from Yesterday":"0.20%","Change from Last Report":"-0.16","Latest Volume":"1,049,575","Market Cap":"13,423,302,656","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.529882,"ROE":0.05605,"DTE":100.881,"Stock Sentiment":"Buy","Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.332,"Trailing PEG":0.3369,"Trailing PS":1.1240603,"Quick Ratio":"N\/A","Day High":28.19,"Day Low":27.79,"VS Average Volume":0.2073320572,"Company Summary":"Conagra Brands, Inc., together with its subsidiaries, operates as a consumer packaged goods food company primarily in the United States. The company operates through four segments: Grocery & Snacks, Refrigerated & Frozen, International, and Foodservice. The Grocery & Snacks segment primarily offers shelf stable food products through various retail channels. The Refrigerated & Frozen segment provides temperature-controlled food products through various retail channels. The International segment offers food products in various temperature states through retail and foodservice channels outside of the United States. The Foodservice segment offers branded and customized food products, including meals, entrees, sauces, and various custom-manufactured culinary products packaged for restaurants and other foodservice establishments. The company sells its products under the Birds Eye, Marie Callender's, Duncan Hines, Healthy Choice, Slim Jim, Reddi-wip, Angie's, BOOMCHICKAPOP brands. The company was incorporated in 1919 and is headquartered in Chicago, Illinois.","Row Color":"negative-row","Last Updated":"13-12-2024 19:25:26"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"10.24","Latest MA":"10.73","Price Target":"9.94","Difference from MA":"-4.52%","Difference from Open":"6.15%","Change from Yesterday":"5.29%","Change from Last Report":"-0.45","Latest Volume":"17,332,296","Market Cap":"8,958,145,536","Earning Date":"2025-01-02","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":6.6733975,"ROE":-0.75969005,"DTE":277.898,"Stock Sentiment":"Hold","Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PS":0.060668204,"Quick Ratio":"N\/A","Day High":10.36,"Day Low":9.41,"VS Average Volume":0.7410239492,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Row Color":"negative-row","Last Updated":"13-12-2024 19:25:26"},{"Company Name":"Nike, Inc.","Symbol":"NKE","Current Price":"77.05","Latest MA":"81.28","Price Target":"89.70","Difference from MA":"-5.20%","Difference from Open":"-0.39%","Change from Yesterday":"-1.17%","Change from Last Report":"-0.25","Latest Volume":"3,555,489","Market Cap":"115,990,478,848","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.267057,"ROE":0.3798,"DTE":86.962,"Stock Sentiment":"Strong Buy","Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.035,"Trailing PEG":3.9863,"Trailing PS":2.319253,"Quick Ratio":"N\/A","Day High":77.83,"Day Low":76.99,"VS Average Volume":0.2966605374,"Company Summary":"NIKE, Inc., together with its subsidiaries, engages in the design, development, marketing, and sale of athletic footwear, apparel, equipment, accessories, and services worldwide. The company provides athletic and casual footwear, apparel, and accessories under the NIKE, Jumpman, Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also sells a line of performance equipment and accessories comprising bags, sport balls, socks, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. In addition, the company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel; licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks; and operates digital platforms, including fitness and activity apps; sport, fitness, and wellness content; and digital services and features in retail stores. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was founded in 1964 and is headquartered in Beaverton, Oregon.","Row Color":"negative-row","Last Updated":"13-12-2024 19:25:26"},{"Company Name":"UnitedHealth Group Incorporated","Symbol":"UNH","Current Price":"522.78","Latest MA":"553.55","Price Target":"641.12","Difference from MA":"-5.56%","Difference from Open":"1.38%","Change from Yesterday":"1.36%","Change from Last Report":"0.00","Latest Volume":"4,228,381","Market Cap":"497,682,415,616","Earning Date":"2025-01-10","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":17.477543,"ROE":0.15252,"DTE":74.683,"Stock Sentiment":"Strong Buy","Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.591,"Trailing PEG":1.4248,"Trailing PS":1.2634804,"Quick Ratio":"N\/A","Day High":525.54,"Day Low":510.7398,"VS Average Volume":1.1239115082,"Company Summary":"UnitedHealth Group Incorporated operates as a diversified health care company in the United States. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage, and health and well-being services to individuals age 50 and older addressing their needs; Medicaid plans, children's health insurance and health care programs; and health and dental benefits, and hospital and clinical services, as well as health care benefits products and services to state programs caring for the economically disadvantaged, medically underserved, and those without the benefit of employer-funded health care coverage. The Optum Health segment provides care delivery, care management, wellness and consumer engagement, and health financial services patients, consumers, care delivery systems, providers, employers, payers, and public-sector entities. The Optum Insight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The Optum Rx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and community health pharmacy services, infusion, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease\/drug therapy management. UnitedHealth Group Incorporated was founded in 1974 and is based in Minnetonka, Minnesota.","Row Color":"negative-row","Last Updated":"13-12-2024 19:25:26"},{"Company Name":"Paychex, Inc.","Symbol":"PAYX","Current Price":"141.15","Latest MA":"130.46","Price Target":"138.92","Difference from MA":"8.19%","Difference from Open":"-0.29%","Change from Yesterday":"-0.03%","Change from Last Report":"-0.21","Latest Volume":"554,908","Market Cap":"50,817,523,712","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.679693,"ROE":0.45672,"DTE":22.517,"Stock Sentiment":"Strong Sell","Industry":"Software - Application","Sector":"Technology","Beta":0.987,"Trailing PEG":4.2188,"Trailing PS":9.568714,"Quick Ratio":"N\/A","Day High":141.865,"Day Low":140.41,"VS Average Volume":0.3352237854,"Company Summary":"Paychex, Inc., together with its subsidiaries, provides integrated human capital management solutions (HCM) for payroll, benefits, human resources (HR), and insurance services for small to medium-sized businesses in the United States, Europe, and India. It offers payroll processing services; payroll tax administration services; employee payment services; and regulatory compliance services, such as new-hire reporting and garnishment processing. The company also provides HR solutions, including integrated HCM technology solutions and HR advisory services through both virtual and on-site availability of a professionally trained HR representative, as well as HR support to non-payroll clients through its HR Partner Plus solution; and retirement services administration, such as plan implementation, ongoing compliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services. In addition, it offers cloud-based HR administration software products for employee benefits management and administration, time and attendance, digital communication solutions, recruiting, and onboarding solutions; plan administration outsourcing and state unemployment insurance services; various business services to small to medium-sized businesses comprising payroll funding and outsourcing services, which include payroll processing, invoicing, and tax preparation; and payment processing services, financial fitness programs, and a small-business loan resource center. Further, the company provides insurance services for property and casualty coverage, such as workers' compensation, business-owner policies, cyber security protection, and commercial auto, as well as health and benefits coverage, including health, dental, vision, and life. It markets and sells its services primarily through its direct sales force. The company was founded in 1971 and is headquartered in Rochester, New York.","Row Color":"positive-row","Last Updated":"13-12-2024 19:25:26"},{"Company Name":"Micron Technology, Inc.","Symbol":"MU","Current Price":"101.25","Latest MA":"110.39","Price Target":"147.25","Difference from MA":"-8.28%","Difference from Open":"0.47%","Change from Yesterday":"3.09%","Change from Last Report":"-0.02","Latest Volume":"13,414,373","Market Cap":"117,212,348,416","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.8013124,"ROE":0.01743,"DTE":31.194,"Stock Sentiment":"Strong Buy","Industry":"Semiconductors","Sector":"Technology","Beta":1.179,"Trailing PEG":0.1569,"Trailing PS":4.6677694,"Quick Ratio":"N\/A","Day High":103.2,"Day Low":99.6651,"VS Average Volume":0.6350628555,"Company Summary":"Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Mainland China, rest of the Asia Pacific, Hong Kong, Japan, Europe, and internationally. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Embedded Business Unit, and Storage Business Unit. It provides memory and storage technologies comprising dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; non-volatile and re-writeable semiconductor storage devices; and non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers serves the data center, PC, graphics, networking, automotive, industrial, and consumer embedded markets, as well as for smartphone and other mobile-device markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.","Row Color":"negative-row","Last Updated":"13-12-2024 19:25:26"},{"Company Name":"Lennar Corporation","Symbol":"LEN","Current Price":"152.73","Latest MA":"169.07","Price Target":"196.07","Difference from MA":"-9.66%","Difference from Open":"-0.77%","Change from Yesterday":"-1.76%","Change from Last Report":"-0.30","Latest Volume":"869,293","Market Cap":"41,944,829,952","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.564465,"ROE":0.15878001,"DTE":14.665,"Stock Sentiment":"Buy","Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.619,"Trailing PEG":1.0969,"Trailing PS":1.1503475,"Quick Ratio":"N\/A","Day High":155.14,"Day Low":152.71,"VS Average Volume":0.4412706341,"Company Summary":"Lennar Corporation, together with its subsidiaries, operates as a homebuilder primarily under the Lennar brand in the United States. It operates through Homebuilding East, Homebuilding Central, Homebuilding Texas, Homebuilding West, Financial Services, Multifamily, and Lennar Other segments. The company's homebuilding operations include the construction and sale of single-family attached and detached homes, as well as the purchase, development, and sale of residential land; and development, construction, and management of multifamily rental properties. It also offers residential mortgage financing, title, insurance, and closing services for home buyers and others, as well as originates and sells securitization commercial mortgage loans. In addition, the company is involved in the fund investment activity. It primarily serves first-time, move-up, active adult, and luxury homebuyers. Lennar Corporation was founded in 1954 and is based in Miami, Florida.","Row Color":"negative-row","Last Updated":"13-12-2024 19:25:26"},{"Company Name":"Bruker Corporation","Symbol":"BRKR","Current Price":"57.09","Latest MA":"63.66","Price Target":"72.42","Difference from MA":"-10.33%","Difference from Open":"-2.54%","Change from Yesterday":"-2.45%","Change from Last Report":"-0.32","Latest Volume":"571,663","Market Cap":"8,821,116,928","Earning Date":"2025-01-06","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":20.884628,"ROE":0.19725999,"DTE":132.635,"Stock Sentiment":"Strong Buy","Industry":"Medical Devices","Sector":"Healthcare","Beta":1.204,"Trailing PEG":null,"Trailing PS":2.7214751,"Quick Ratio":"N\/A","Day High":59.45,"Day Low":56.31,"VS Average Volume":0.413438451,"Company Summary":"Bruker Corporation, together with its subsidiaries, develops, manufactures, and distributes scientific instruments, and analytical and diagnostic solutions in the United States, Europe, the Asia Pacific, and internationally. The company operates through four segments: Bruker Scientific Instruments (BSI) BioSpin, BSI CALID, BSI Nano, and Bruker Energy & Supercon Technologies. It offers life science tools, and single and multiple modality systems; life science mass spectrometry; MALDI Biotyper rapid pathogen identification platform and related test kits, DNA test strips, and fluorescence-based polymerase chain reaction technology; genotype and fluorotype molecular diagnostics kits; research, analytical, and process analysis instruments and solutions; SARS-CoV 2 testing for the diagnosis of COVID-19 infection; and Fluorotyper-SARS-CoV 2 plus kits. It also provides range of portable analytical and bioanalytical detection systems, and related products; X-ray instruments; analytical tools for electron microscopes, as well as handheld, portable, and mobile X-ray fluorescence spectrometry instruments; atomic force microscopy instrumentation; non-contact nanometer resolution solution topography; and automated X-ray metrology, automated AFM defect-detection, and photomask repair and cleaning equipment. In addition, the company offers advanced optical fluorescence microscopy instruments; products and services to support the multi-omics needs of researchers in translational research, drug, and biomarker discovery; superconducting materials, such as metallic low temperature superconductors; devices and complex tools based on metallic low temperature superconductors; and non-superconducting high technology tools, such as synchrotron and beamline instrumentation. The company was incorporated in 1991 and is headquartered in Billerica, Massachusetts.","Row Color":"negative-row","Last Updated":"13-12-2024 19:25:26"},{"Company Name":"Ollie's Bargain Outlet Holdings","Symbol":"OLLI","Current Price":"112.79","Latest MA":"93.74","Price Target":"119.87","Difference from MA":"20.32%","Difference from Open":"1.27%","Change from Yesterday":"1.38%","Change from Last Report":"0.29","Latest Volume":"612,783","Market Cap":"7,051,253,248","Earning Date":"2024-12-10","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":29.985155,"ROE":0.13548,"DTE":31.499,"Stock Sentiment":"Strong Buy","Industry":"Discount Stores","Sector":"Consumer Defensive","Beta":0.844,"Trailing PEG":null,"Trailing PS":3.1816978,"Quick Ratio":"N\/A","Day High":113.4725,"Day Low":111.16,"VS Average Volume":0.5740915274,"Company Summary":"Ollie's Bargain Outlet Holdings, Inc. operates as a retailer of brand name merchandise in the United States. The company offers housewares, bed and bath, food, floor coverings, health and beauty aids, books and stationery, toys, and electronics; and other products, including hardware, candy, clothing, sporting goods, pet and lawn, and garden products. It provides its products primarily under the Ollie's, Ollie's Bargain Outlet, Good Stuff Cheap, Ollie's Army, Real Brands Real Cheap!, Real Brands! Real Bargains, Sarasota Breeze, Steelton Tools, American Way, and Middleton Home names. The company was formerly known as Bargain Holdings, Inc. and changed its name to Ollie's Bargain Outlet Holdings, Inc. in March 2015. The company was founded in 1982 and is headquartered in Harrisburg, Pennsylvania.","Row Color":"positive-row","Last Updated":"13-12-2024 19:25:26"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"61.62","Latest MA":"50.28","Price Target":"78.22","Difference from MA":"22.56%","Difference from Open":"-1.08%","Change from Yesterday":"-0.03%","Change from Last Report":"0.06","Latest Volume":"2,041,495","Market Cap":"40,949,215,232","Earning Date":"2025-01-10","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":8.310058,"ROE":0.4067,"DTE":186.78,"Stock Sentiment":"Strong Buy","Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PS":0.6790126,"Quick Ratio":"N\/A","Day High":62.29,"Day Low":60.94,"VS Average Volume":0.2424324435,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Row Color":"positive-row","Last Updated":"13-12-2024 19:25:26"},{"Company Name":"Carnival Corporation","Symbol":"CCL","Current Price":"25.85","Latest MA":"18.88","Price Target":"27.12","Difference from MA":"36.92%","Difference from Open":"-1.66%","Change from Yesterday":"-1.30%","Change from Last Report":"-0.02","Latest Volume":"7,103,725","Market Cap":"35,242,917,888","Earning Date":"2024-12-20","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":15.068549,"ROE":0.20120001,"DTE":352.355,"Stock Sentiment":"Strong Buy","Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.668,"Trailing PEG":null,"Trailing PS":1.4397205,"Quick Ratio":"N\/A","Day High":26.405,"Day Low":25.84,"VS Average Volume":0.2715728419,"Company Summary":"Carnival Corporation & plc engages in the provision of leisure travel services in North America, Australia, Europe, Asia, and internationally. The company operates through four segments: NAA Cruise Operations, Europe Cruise Operations, Cruise Support, and Tour and Other. It operates port destinations, private islands, and a solar park, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. The company offers its services under the Carnival Cruise Line, Princess Cruises, Holland America Line, Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises, and Cunard brand. Additionally, it sells its cruises primarily through travel agents, tour operators, vacation planners, and websites. Carnival Corporation & plc was founded in 1972 and is headquartered in Miami, Florida.","Row Color":"positive-row","Last Updated":"13-12-2024 19:25:26"}]